import 'package:yosria/models/azkar_models.dart';
import 'package:yosria/models/consts/azkar_algomari_collection.dart';
import 'package:yosria/models/consts/azkar_morning_evening_collection.dart';
import 'package:yosria/models/consts/poems_collection.dart';
import 'package:yosria/models/consts/salawat_yousria_collection.dart';

const alhadraCollection = <Zikr>[
  almarefAlzawquia,
  salawatYousria,
  duaaEstighatha,
  hadraPrayerAfterAzkar,
  alhyliaAndNasab,
  yaRasoulAllah,
  khitamFawatih,
];

const alhyliaAndNasab = Zikr(title: 'الحلية والنسب النبوي الشريف', content: '');

const hadraPrayerAfterAzkar = Zikr(title: 'ختام الصلاة', content: '''
سبحان الله، الحمد لله، الله أكبر (ثلاث وثلاثون)

الله أكبر كبيرا والحمد لله كثيرا، وسبحان الله بكرة وأصيلا، لا إله إلا الله وحده، لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير.

فاعْلَـمْ أَنَّـهُ (لَا إِلَـهَ إِلَّا اللهُ، مُحَمَّـدٌ رَسُـولُ اللهِ) (من مائةٍ إلى ألف مرة)]. وممكن أيضاً بالتهليل الإدريسي:
Fلَا إِلَـهَ إِلَّا اللهُ __ مُحَمَّـدٌ رَسُـولُ اللهِX
Fفي كل لمحةٍ وَ __ نفسٍ عَدَدَ مَاX
      وسعهُ عِلمُ الله [مائة مرة]
	  
أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ سَيِّدَنَا مُحَمَّدًا رَسُولُ اللهِ ﷺ

ثَبِّتْنَا يَا رَبِّ بِقَوْلِهَا  وَانْفَعْنَا يَا رَبِّ بِفَضْلِهَا  وَاجْعَلْنَا مِنْ خِيَارِ أَهْلِهَا.

أَمْسَيْنَا فِي حِمَاكَ يَا مَوْلَانَا صَبِّحْنَا فِيِ رِضَاكَ يَا مَوْلَانَا.

لَا إِلَهَ إِلَّا أَنْتَ وَاحِدٌ رَّبَّنَا يَا مُجَمِّعْنَا اغْفِرْ ذَنْبَنَا.

اغْفِرْ لَنَا مَا مَضَى، وَأَصْلِحْ لَنَا مَا بَقِيَ بِحُرْمَةِ الْأَبْرَارِ يَا عَالِمَ الْأَسْرَارِ.
k
يَا عَالِمَ السِّرِّ مِنَّا، لَا تَكْشِفَ السِّتْرَ عَنَّا، وَعَافِنَا وَاعْفُ عَنَّا، وَكُن لَّنَا حَيْثُ كُنَّا.

يَا مَوْلَانَا يَا مُجِيبُ * مَنْ يَرْجُوكَ لَا يَخِيبُ * تَوَسَّلْنَا بِالْحَبِيبِ * اقْضِ حَاجَتَنَا قَرِيب * هَذَا وَقْتُ الْحَاجَاتِ * يَا حَاضِرًا لَا يَغِيبُ (ثلاث مرات).


اللَّهُمَّ اجْمَعْنَا عَلَى مَحَبَّتِكَ وَأَعِنَّا عَلَى طَاعَتِكَ وَخِدْمَتِكَ وَطَهِّرْنَا تَطْهِيرًا نَصْلُحُ بِهِ لِحَضْرَتِكَ وَلُقِيِّ نَبِيِّكَ عَلَيْهِ السَّلَامُ وَزِدْنَا فِيكَ تَحَيُّرًا وَبِكَ افْتِتَانًا، وَغَيِّبْنَا فِيكَ عَنْ كُلِّ شَيْءٍ سِوَاكَ حَتَّى لَا نَكُونَ إِلَّا بِكَ وَلَكَ، وَاحْفَظْنَا فِيكَ سَائِرَ يَوْمِنَا وَبَقِيَّةِ عُمْرِنَا حَتَّى تَتَوَفَّانَا وَأَنْتَ عَنَّا رَاضٍ وَنَحْنُ عَنْكَ غَيْرُ مَفْتُونِينَ بِحَقِّ مَوْلَانَا رَسُولِ اللهِ صلى الله عليه وسلمﷺ.


Fنَحنُ باللهِ عِزَُنا __ وَبِالحَبيب المُقَرَّبِX
Fبِهِمَا عَزَّ قَدْرُنَا __ لا بِجَاهٍ وَمَنصِبِX
Fكُلُّ مَنْ رَامَ ذُّلَّنّا __ مِنْ قَرِيبٍ وَأجْنَبِيX
Fسَيْفُنَا فِيهِ قَوْلُنَا __ حَسْبُنَا اللهُ وِالنّبِيX
''');

const yaRasoulAllah = Zikr(title: 'يا رسول الله انظر حالنا', content: '''
يا رسول الله، انظر حالنا، يا حبيب الله، اسمع قَالنَا، إنَّي في بحر هَمٍّ مُغْرِقٍ، خُذ بيدي، سَهِّل أَحوالنا.
''');
