import 'package:aldurar_alnaqia/models/azkar_models.dart';
import 'package:aldurar_alnaqia/models/consts/azkar_algomari_collection.dart';

const morningEveningAzkarCollection = [
  alwazifaZarouquia,
  almusabaeat,
  alasas,
  almarefAlzawquia,
  alhylia,
  khitamFawatih,
];

// TODO: fix this mess :(
const alhylia = Zikr(title: 'الحلية والنسب النبوي الشريف', content: '');

// === alasas
const alasas = Zikr(
    title: 'ورد الأساس',
    notes:
        'بعد صلاة الصبح إلى ما قبل الظهر ومثله بعد صلاة المغرب إلى ما قبل الفجر وتقضيه إذا فاتك.',
    url:
        'https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D8%A3%D8%B3%D8%A7%D8%B3.mp3',
    content: '''
أَسْتَغْفِرُ اللهَ (100 مرة).

اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِهِ وَسَلِّم (100 مرة).

لَا إِلَهَ إِلَّا الله وَحْدَهُ لَا شَرِيكَ لَه، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيءٍ قَدِير (100 مرة)
  ''');

// === AlwazifaZarouquia ===
const alwazifaZarouquia = Zikr(
  title: 'الوظيفة الزروقية',
  notes:
      'الوظيفةُ الزَّرُّوقِيَّةُ المسماة بـ (سفينة النجا لمن إلى الله التجا) لسيدي أحمد زَرٌّوق\nتقرأ بعد صلاة الصبح وبعد صلاة العصر',
  url:
      "https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%88%D8%B8%D9%8A%D9%81%D8%A9%20%D9%84%D9%84%D9%85%D8%AA%D8%B9%D8%AC%D9%84.mp3",
  content: '''
أَعُوذُ بِاللهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ.
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ

﴿وَإِلَٰهُكُمۡ إِلَٰهٌ وَٰحِدٌ ۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ۝١٦٣﴾ [البقرة: 163]

﴿ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ﴾ [البقرة: 255]

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿الٓمٓ۝١ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ۝٢﴾ [آل عمـران: 1-2]

﴿وَعَنَتِ ٱلۡوُجُوهُ لِلۡحَيِّ ٱلۡقَيُّومِۖ﴾ [طه: 111]

﴿ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٌ وَلَا نَوۡمٌ ۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ۝٢٥٥﴾ [البقرة: 255]

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿حمٓ۝١تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡعَلِيمِ۝٢غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ۝٣﴾ [غافر: 1-3]

﴿لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ۝٢٨٤ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ۝٢٨٥لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ۝٢٨٦﴾ [البقرة: 284-286].

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ يَـٰٓأَيُّهَا ٱلۡكَٰفِرُونَ۝١لَآ أَعۡبُدُ مَا تَعۡبُدُونَ۝٢وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ۝٣وَلَآ أَنَا۠ عَابِدٌ مَّا عَبَدتُّمۡ۝٤وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ۝٥لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ۝٦﴾ [الكافرون: 1-6].

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿إِذَا جَآءَ نَصۡرُ ٱللَّهِ وَٱلۡفَتۡحُ۝١وَرَأَيۡتَ ٱلنَّاسَ يَدۡخُلُونَ فِي دِينِ ٱللَّهِ أَفۡوَاجٗا۝٢فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَٱسۡتَغۡفِرۡهُۚ إِنَّهُۥ كَانَ تَوَّابَۢا۝٣﴾ [النصر: 1-3].

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ هُوَ ٱللَّهُ أَحَدٌ۝١ٱللَّهُ ٱلصَّمَدُ۝٢لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ۝٣وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ۝٤﴾ [الإخلاص: 1-4] (ثلاثًا).

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ۝١مِن شَرِّ مَا خَلَقَ۝٢وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ۝٣وَمِن شَرِّ ٱلنَّفَّـٰثَٰتِ فِي ٱلۡعُقَدِ۝٤وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ۝٥﴾ [الفلق:1-5] (ثلاثًا).

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ۝١مَلِكِ ٱلنَّاسِ۝٢إِلَٰهِ ٱلنَّاسِ۝٣مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ۝٤ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ۝٥مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ۝٦﴾ [الناس: 1-6] (ثلاثًا).

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ (ثلاثًا). [تقرأ مرة واحدة للمتعجل]

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

اللَّهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ (أَمَتُكَ)، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ (ثلاثًا).

اللَّهُمَّ إِنِّي أَصْبَحْتُ [أَمْسَيْتُ] مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ، فَأَتِمَّ نِعْمَتَكَ عَلَيَّ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالْآخِرَةِ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

اللَّهُمَّ مَا أَصْبَحَ [أَمْسَى] بِي مِن نِّعْمَةٍ، أَوْ بِأَحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ (ثَلاثًا).[تقرأ مرة واحدة للمتعجل]

يَا رَبِّ لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ وَعَظِيم سُلْطَانِكَ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

رَضِيتُ بِالله رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبسيدنا مُحَمَّدٍ صلى الله عليه وسلم نَبِيًّا ورَسُولًا (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

سُبْحَانَ الله وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ (ثلاثًا).

أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ (ثلاثًا).

بِسْمِ الله الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ (ثلاثًا).

أَعُوذُ بِالله السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ (ثلاثًا).

﴿هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ۝٢٢هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ۝٢٣هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ۝٢٤﴾ [الحشر: 22-24].

سُبْحَانَ الله وَبِحَمْدِهِ، سُبْحَانَ الله الْعَظِيمِ (ثلاثًا).

تَحَصَّنْتُ بِذِي الْعِزَّةِ وَالْجَبَرُوتِ، وَاعْتَصَمْتُ بِرَبِّ الْمَلَكُوتِ، وَتَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ [اصْرِفْ عَنَّا الْأَذَى إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (ثلاثًا)] (ثلاثًا).

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿لِإِيلَٰفِ قُرَيۡشٍ۝١إِۦلَٰفِهِمۡ رِحۡلَةَ ٱلشِّتَآءِ وَٱلصَّيۡفِ۝٢فَلۡيَعۡبُدُواْ رَبَّ هَٰذَا ٱلۡبَيۡتِ۝٣ٱلَّذِيٓ أَطۡعَمَهُم مِّن جُوعٍ وَءَامَنَهُم مِّنۡ خَوۡفِۭ۝٤﴾ [قريش: 1-4].

اللَّهُمَّ كَمَا أَطْعَمْتَهُمْ فَأَطْعِمْنَا، وَكَمَا آمَنْتَهُمْ فَآمِنَّا، وَاجْعَلْنَا لَكَ مِنَ الشَّاكِرِينَ.

سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

أَسْتَغْفِرُ الله الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيَّ الْقَيُّومَ وَأَتُوبُ إِلَيْهِ (ثلاثًا).

[اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَنَبِيِّكَ وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ] (ثلاثًا) تَسْلِيمًا عَدَدَ مَا أَحَاطَ بِهِ عِلْمُكَ، وَخَطَّ بِهِ قَلَمُكَ، وَأَحْصَاهُ كِتَابُكَ، وَالرِّضَا عَنْ سَادَاتِنَا أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ وَعَلِيٍّ، وَعَنِ الصَّحَابَةِ أَجْمَعِينَ وَعَنِ التَّابِعِينَ وَتَابِعِي التَّابِعِينَ لَهُمْ بِإِحْسَانٍ إِلَى يَوْمِ الدِّينِ ﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182]

فاعْلَـمْ أَنَّـهُ (لَا إِلَـهَ إِلَّا اللهُ، مُحَمَّـدٌ رَسُـولُ اللهِ) (من مائةٍ إلى ألف مرة)]. وممكن أيضاً بالتهليل الإدريسي:
F لَا إِلَـهَ إِلَّا اللهُ __ مُحَمَّـدٌ رَسُـولُ اللهِX
F في كل لمحةٍ وَ __ نفسٍ عَدَدَ مَاX
      وسعهُ عِلمُ الله [مائة مرة]
      
أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ سَيِّدَنَا مُحَمَّدًا رَسُولُ اللهِ صلى الله عليه وسلم (ثلاثًا).

ثَبِّتْنَا يَا رَبِّ بِقَوْلِهَا (ثلاثًا) وَانْفَعْنَا يَا رَبِّ بِفَضْلِهَا (ثلاثًا) وَاجْعَلْنَا مِنْ خِيَارِ أَهْلِهَا (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

آمين آمين آمين آمين رب العالمين (ثلاثًا).

أَصْبَحْنَا [أَمْسَيْنَا] فِي حِمَاكَ يَا مَوْلَانَا مَسِّنَا [صَبِّحْنَا] فِيِ رِضَاكَ يَا مَوْلَانَا (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

آمين آمين آمين آمين ربَّ العالمين (ثلاثًا).

لَا إِلَهَ إِلَّا أَنْتَ وَاحِدٌ رَبَّنَا يَا مُجَمِّعْنَا اغْفِرْ ذَنْبَنَا (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

آمين آمين آمين آمين رب العالمين (ثلاثًا).

اغْفِرْ لَنَا مَا مَضَى، وَأَصْلِحْ لَنَا مَا بَقِيَ بِحُرْمَةِ الْأَبْرَارِ يَا عَالِمَ الْأَسْرَارِ (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

آمين آمين آمين آمين ربَّ العالمين (ثلاثًا).

يَا عَالِمَ السِّرِّ مِنَّا، لَا تَكْشِفَ السِّتْرَ عَنَّا، وَعَافِنَا وَاعْفُ عَنَّا، وَكُن لَّنَا حَيْثُ كُنَّا (ثلاثًا).[تقرأ مرة واحدة للمتعجل]

آمين آمين آمين آمين ربَّ العالمين (ثلاثًا).

يَا مَوْلَانَا يَا مُجِيبُ * مَنْ يَرْجُوكَ لَا يَخِيبُ * تَوَسَّلْنَا بِالْحَبِيبِ * اقْضِ حَاجَتَنَا قَرِيب * هَذَا وَقْتُ الْحَاجَاتِ * يَا حَاضِرًا لَا يَغِيبُ (ثلاثًا).

آمين آمين آمين آمين ربَّ العالمين (ثلاثًا).

اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ (عَشْرًا).

آمين آمين آمين آمين رب العالمين (ثلاثًا).

وسلام على المرسلين والحمد لله رب العالمين

﴿بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ۝١ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝٢ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ۝٣مَٰلِكِ يَوۡمِ ٱلدِّينِ۝٤إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ۝٥ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ۝٦صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ۝٧﴾ [الفاتحة: 1-7]. آمين (ثلاثًا).

﴿إِنَّ ٱللَّهَ وَمَلَـٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا۝٥٦﴾ [الأحزاب: 56] (صلواتُ الله وسلامُهُ وتحيَّاتُهُ وَرَحْمَتُهُ وَبَرَكَاتُهُ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ  وَنَبِيِّكَ وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَصَحْبِهِ عَدَدَ الشَّفْعِ وَالْوَتْرِ وَعَدَدَ كَلِمَاتِ رَبِّنَا التَّامَّاتِ الْمُبَارَكَاتِ) (ثلاثًا).

وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، وَهُوَ حَسْبُنَا وَنِعْمَ الْوَكِيلُ، فَنِعْمَ الْمَوْلَى وَنِعْمَ النَّصِيرُ.

﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182].
''',
);

// === almusabaeat ===
const almusabaeat = Zikr(
    title: 'المسبعات العشر',
    notes: 'تُقْرَأُ قَبْلَ الشُّرُوقِ وَقَبْلَ الغُرُوبِ',
    url:
        "https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%85%D8%B3%D8%A8%D8%B9%D8%A7%D8%AA.mp3",
    content: '''
## سورة الفاتحة
﴿بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ۝١ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝٢ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ۝٣مَٰلِكِ يَوۡمِ ٱلدِّينِ۝٤إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ۝٥ٱهۡدِنَا ٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ۝٦صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ۝٧﴾ آمين (سبع مرات)
## سورة الناس
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ۝١مَلِكِ ٱلنَّاسِ۝٢إِلَٰهِ ٱلنَّاسِ۝٣مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ۝٤ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ۝٥مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ۝٦﴾ (سبع مرات)
## سورة الفلق
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ۝١مِن شَرِّ مَا خَلَقَ۝٢وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ۝٣وَمِن شَرِّ ٱلنَّفَّـٰثَٰتِ فِي ٱلۡعُقَدِ۝٤وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ۝٥﴾ (سبع مرات)
## سورة الإخلاص
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ﴿قُلۡ هُوَ ٱللَّهُ أَحَدٌ۝١ٱللَّهُ ٱلصَّمَدُ۝٢لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ۝٣وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ۝٤٤﴾ (سبع مرات)
## سورة الكافرون
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿قُلۡ يَـٰٓأَيُّهَا ٱلۡكَٰفِرُونَ۝١لَآ أَعۡبُدُ مَا تَعۡبُدُونَ۝٢وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ۝٣وَلَآ أَنَا۠ عَابِدٌ مَّا عَبَدتُّمۡ۝٤وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ۝٥لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ۝٦ ﴾ (سبع مرات)
## آية الكرسي
﴿ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٌ وَلَا نَوۡمٌ ۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ۝٢٥٥﴾ (سبع مرات)
## الباقيات الصالحات
سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَلاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ العَلِيِّ العَظِيمِ (سبع مرات)
## الصلاة الإبراهيمية
اللهم صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ فِى العَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ (سبع مرات)

اللهم اغْفِرْ لِي وَلِوَالِدَيَّ وَللْمُؤْمِنِينَ وَالمُؤْمِنَاتِ وَالمُسْلِمِينَ وَالمُسْلِمَاتِ الأَحْيَاءِ مِنْهُمْ وَالأَمْوَاتِ (سبع مرات)

اللهم افْعَلْ بِي وَبِهِمْ عَاجِلاً وَآجِلاً فِى الدِّينِ وَالدُّنْيَا وَالآخِرَةِ مَا أَنْتَ لَهُ أَهْلٌ، وَلاَ تَفْعَلْ بِنَا يَا مَوْلاَنَا مَا نَحْنُ لَهُ أَهْلٌ، إِنَّكَ غَفُورٌ حَلِيمٌ، جَوَادٌ كَرِيمٌ، رَؤُوفٌ رَحِيمٌ (سبع مرات)
  ''');

const khitamFawatih = Zikr(
    title: 'ختام الورد والحضرة (الفواتح)',
    url:
        "https://ia600908.us.archive.org/16/items/hadra_yousria/%D8%A7%D9%84%D9%81%D9%88%D8%A7%D8%AA%D8%AD.mp3",
    content: '''
الفاتحة: لسيدنا ومولانا رسول الله صل الله عليه وآله وسلم ولجميع إخوانه من الأنبياء والمرسلين، والملائكة؛ والمقربين، وآل بيت نبينا ومشايخنا، ووالدينا، وأزواجنا، وذريتنا، وأحبابنا، ومرضانا، وموتانا، ومكروبنا، وكل من سألنا الدعاء، والمسلمين أجمعين، لهم منا جميعاً الفاتحة.

الفاتحة: لسيدنا ومولانا الدكتور علي جمعة - حفظه الله ورضي عنه - ولسيدنا ومولانا الدكتور يسري جبر الحسيني الحسني - حفظه الله ورضي عنه - ولسيدنا ومولانا عبد الله الصديقي الغماري الحسني - رحمه الله ورضي عنه - ولأرواح آبائهم، وأجدادهم، ومشايخهم، وتلامذتهم، ومريديهم، وسائر سلسلة الطريقة الشاذلية رجالا ونساءً أحياء وأمواتا، وسائر أهل الطرق الصوفية، وأولياء الله الصالحين في كل مكان لهم منا جميعاً الفاتحة.

الفاتحة: أن ينجينا الله نحن وسائر المسلمين من: شرور أنفسنا، وسيئات أعمالنا، ومن فتنة المحيا والممات، ومن فتنة القبر، وظلمته، وعذابه وضمته وسؤاله، ومن فتنة المسيح الدجال، وفتنة إبليس، وشياطين الإنس والجنّ، واليهود، والأمريكان، وأعداء الإسلام والمسلمين.

 سبحانك اللَّهمَّ وبحمدِك أشهدُ أن لا إلهَ إلا أنت أستغفرُك وأتوبُ إليك
 
﴿وَٱلۡعَصۡرِ۝١إِنَّ ٱلۡإِنسَٰنَ لَفِي خُسۡرٍ۝٢إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَٰتِ وَتَوَاصَوۡاْ بِٱلۡحَقِّ وَتَوَاصَوۡاْ بِٱلصَّبۡرِ۝٣﴾ [العصر:1-3]
''');
