import 'package:yosria/models/azkar_models.dart';

const chosenSalawatCollection = [
  salahAzimia,
  salahIbnBashish,
  salahAlbaha,
  salahAlfateh,
  salahAlmohtag,
  salahAlmotardy,
  salahNoorania,
  salahAlqasm,
  salahAlshafia,
  salahZatia,
];

const salahAzimia = Zikr(
    title: 'الصلاة العظيمية',
    notes:
        'الصَّلَاةُ الْعَظِيمِيَّةُ لِسَيِّدِي أَحْمَدِ بْنِ إِدْرِيس رضي الله عنه',
    content: '''
اللَّهُمَّ إِنِّي أَسْأَلُكَ بِنُورِ وَجْهِ اللهِ الْعَظِيمِ، الَّذِي مَلَأَ أَرْكَانَ عَرْشِ اللهِ الْعَظِيمِ، وَقَامَتْ بِهِ عَوَالِمُ اللهِ الْعَظِيمِ، أَنْ تُصَلِّيَ عَلَى سَيِّدِنَا وَمَوْلَانَا مُحَمَّدٍ ذِي الْقَدْرِ الْعَظِيمِ، وَعَلَى آلِ نَبَيِّ اللهِ الْعَظِيمِ، بِقَدْرِ عَظَمَةِ ذَاتِ اللهِ الْعَظِيمِ، فِي كُلِّ لَمْحَةٍ وَنَفَسٍ عَدَدَ مَا وَسِعَهُ عِلْمُ اللهِ الْعَظِيمِ، صَلَاةً دَائِمَةً بِدَوَامِ اللهِ الْعَظِيمِ، تَعْظِيمًا لِحَقِّكَ يَا مَوْلَانَا يَا مُحَمَّدُ يَا ذَا الْخُلُقِ الْعَظِيمِ، وَسَلِّمْ عَلَيْهِ وَعَلَى آلِهِ مِثْلَ ذَلِكَ، وَاجْمَعْ بَيْنِي وَبَيْنَهُ كَمَا جَمَعْتَ بَيْنَ الرُّوحِ وَالْجَسَدِ ظَاهِرًا وَبَاطِنًا يَقَظَةً وَمَنَامًا وَاجْعَلْهُ يَا رَبِّ رُوحًا لِذَاتِي مِن جَمِيعِ الْوُجُوهِ فِي الدُّنْيَا وَالْآخِرَةِ يَا عَظِيمُ.
    ''');

const salahIbnBashish =
    Zikr(title: 'الصلاة المشيشية', notes: 'صَلَاةُ سَيِّدِي ابْنِ مَشِيش رضي الله عنه', content: '''
اللَّهُمَّ صَلِّ عَلَىٰ مَنْ مِنْهُ انْشَقَّتِ الْأَسْرَارُ وَاَنْفَلَقَتِ الْأَنْوَارُ، وَفِيهِ ارْتَقَتِ الْحَقَائِقُ، وَتَنَزَّلَتْ عُلُومُ آَدَمَ فَأَعْجَزَ الْخَلَائِقَ، وَلَهُ تَضَاءَلَتِ الْفُهُومُ فَلَمْ يُدْرِكْهُ مِنَّا سَابِقٌ وَلَا لَاحِقٌ فِرِيَاضُ الْمَلَكُوتِ بِزَهْرِ جَمَالِهِ مُونِقَةٌ، وَحِيَاضُ الْجَبَرُوتِ بِفَيْضِ أَنْوَارِهِ مُتَدَفِّقَةٌ، وَلَا شَيْءَ إِلَّا وَهُوَ بِهِ مَنُوطٌ؛ إِذْ لَوْلَا الْوَاسِطَةُ لَذَهَبَ _كَمَا قِيلَ_ الْمَوْسُوطُ، صَلَاةً تَلِيقُ بِكَ مِنْكَ إِلَيْهِ كَمَا هُوَ أَهْلُهُ، اللَّهُمَّ إِنَّهُ سِرُّكَ الْجَامِعُ الدَّالُّ عَلَيْكَ، وَحِجَابُكَ الْأَعْظَمُ الْقَائِمُ لَكَ بَيْنَ يَدَيْكَ، اللَّهُمَّ أَلْحِقْنِي بِنَسَبِهِ، وَحَقِّقْنِي بِحَسَبِهِ، وَعَرِّفْنِي إِيَّاهُ مَعْرَفَةً أَسْلَمُ بِهَا مِنْ مَوَارِدِ الْجَهْلِ، وَأَكْرَعُ بِهَا مِنْ مَوَارِدِ الْفَضْلِ، وَاحْمِلْنِي عَلَى سَبِيلِهِ إِلَى حَضْرَتِكَ حَمْلًا مَحْفُوفًا بِنُصْرَتِكَ، وَاقْذِفْ بِي عَلَى الْبَاطِلِ فَأَدْمَغَهُ، وَزُجَّ بِي فِي بِحَارِ الْأَحَدِيَّةِ، وَانْشُلْنِي مِنْ أَوْحَالِ التَّوْحِيدِ، وَأَغْرِقْنِي فِي عَيْنِ بَحْرِ الْوَحْدَةِ حَتَّى لَا أَرَى وَلَا أَسْمَعَ وَلَا أَجِدَ وَلَا أُحِسَّ إِلَّا بِهَا وَاجْعَلِ الْحِجَابَ الْأَعْظَمَ حَيَاةَ رُوحِي، وَرُوحَهُ سِرَّ حَقِيقَتِي، وَحَقِيقَتَهُ جَامِعَ عَوَالِمِي بِتَحْقِيقِ الْحَقِّ الْأَوَّلِ يَا أَوَّلُ يَا آخِرُ يَا ظَاهِرُ يَا بَاطِنُ، اسْمَعْ نِدَائِي بِمَا سَمِعْتَ بِهِ نِدَاءَ عَبْدِكَ زَكَرِيَّا، وَانْصُرْنِي بِكَ لَكَ، وَأَيِّدْنِي بِكَ لَكَ، وَاجْمَعْ بَيْنِي وَبَيْنَكَ، (وَحُلْ بَيْنِي وَبَيْنَ غَيْرِكَ) (ثَلَاثًا) 
الله. الله. الله.
﴿إِنَّ ٱلَّذِي فَرَضَ عَلَيۡكَ ٱلۡقُرۡءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٖۚ﴾ [القصص: 85]، ﴿رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا۝١٠﴾ [الكهف: 10] (ثلاثًا)، ﴿إِنَّ ٱللَّهَ وَمَلَـٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا۝٥٦﴾ [الأحزاب: 56].
صَلَوَاتُ اللهِ وَسَلاَمُهُ وَتَحِيَّاتُهُ وَرَحْمَتُهُ وَبَرَكَاتُهُ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَرَسُولِكِ النَّبِي الأُمِّي وَعَلَى آلِهِ وَصَحْبِهِ عَدَدَ الشَّفْعِ وَالْوَتْرِ وَعَدَدَ كَلِمَاتِ رَبِّنَا التَّامَّاتِ المُبَارَكَاتِ.
﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182].
''');

const salahAlbaha = Zikr(title: 'صلاة البهاء', 
  content: '''
اللَّهُمَّ صَلِّ بِكُلِّ صَلَوَاتِكَ فِي أَبْهَى بَهَائِهَا عَلَى سَيِّدِنَا مُحَمَّدٍ طِبِّ الْقُلُوبِ وَدَوَائِهَا، وَعَافِيَةِ الْأَبْدَانِ وَشِفَائِهَا، وَنُورِ الْأَبْصَارِ وَضِيَائِهَا، وَرُوْحِ الْأَرْوَاحِ وَسِرِّ بَقَائِهَا، وَبَهْجَةِ النُّفُوسِ وَصَفَائِهَا، وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ.
'''
);

const salahAlfateh = Zikr(title: 'صلاة الفاتح', 
  content: '''
اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ الْفَاتِحِ لِمَا أُغْلِقَ، وَالْخَاتِمِ لِمَا سَبَقَ، نَاصِرِ الحَقِّ بِالحَقِّ والْهَادِي إِلَى صِرَاطِكَ الْمُسْتَقِيمِ، وَعَلَى آلِهِ وَصَحْبِهِ حَقَّ قَدْرِهِ وَمِقْدَارِهِ الْعَظِيمِ. (ثلاثًا).
'''
);

const salahAlmohtag = Zikr(title: 'صلاة المحتاج', 
  content: '''
اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةَ الْعَبْدِ الْحَائِرِ الْمُحْتَاجِ، الَّذِي ضَجَّ مِن كُلِّ ضِيقٍ وَحَرَجٍ، وَالْتَجَأَ إِلَى بَابِ الْكَرِيمِ فَفُتِحَتْ لَهُ أَبْوَابُ الْفَرَجِ، وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ.
'''
);

const salahAlmotardy = Zikr(
    title: 'صلاة المتردي',
    notes:
        'صَلَاةُ الْمُتَرَدِّي لِسَيِّدِي أَبِي الْفَيْضِ مُحَمَّدِ بْنِ عَبْدِ الْكَبِيرِ الْكَتَّانِي رضي الله عنه',
      content: '''
اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا وَمَوْلَانَا أَحْمَدٍ الْمُتَرَدِّي بِأَرْدَيَةِ الْكِبْرِيَاءِ وَأَشِعَّةِ الْفَرْدَانِيَّةِ، الْمُلَثَّمِ بِمَعَانِي عَظَمَةِ سُرَادِقَاتِ غَيْبِ الْهُوِيَّةِ، الْمُتَأَحَّدِ فِي عَيْنِ الْكَثْرَةِ، الْمُتَكَثِّرِ فِي عَيْنِ الْوَحْدَةِ، الْمُلْتَحِفِ بِوَحَدَاتِ الذَّاتِ، الْمُسْتَوِي بِقَدَمِ الْأَحَدِيَّةِ عَلَى عَرْشِ الصِّفَاتِ، الْمُثْنَى عَلَيْهِ بِلَسَانِ جَمْعِ الْجَمْعِ فِي مَهَامِهِ الْغَارَاتِ، عَلَى خَطِّ قَوْسِ لِسَانِ الْأَزَلِ بِمَحْوِ الذَّاتِ بِالذَّاتِ لِلذَّاتِ فِي الذَّاتِ، الْحَمْدُ لِلهِ رَبِّ الْعَالَمِينَ، الرَّحْمَنِ الرَّحِيمِ، مَالِكِ يَوْمِ الدِّينِ، خَطِّ الدَّائِرَةِ وَنُقْطَةِ الَبُرُوجِ، دِفْتَرِ الْمَثَانِي وَقَهْرَمَانِ الْعُرُوجِ، الْعَبْدِ الْحَقَّانِي، الْمُتَفَرِّدِ بِلَيْسِ كَمِثْلِهِ شَيْءٍ الْأَحَدِيِّ الثَّانِي الْمَتْلُوِّ عَلَيْهِ بِلِسَانِ الْجَمْعِ فِي حَضْرَةِ جَمْعِ جَمْعِهِ ﴿وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ﴾ [النمل: 6]، هَيْهَاتَ هَيْهَاتَ وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ، وَآلِهِ وَصَحْبِهِ وَسَلِّمْ.
'''
    );

const salahNoorania = Zikr(
    title: 'الصلاة النورانية',
    notes:
        '«الصَّلَاةُ النُّورَانِيَّةُ » لِسَيِّدِي أَحْمَدِ الْبَدَوِي رضي الله عنه',
    
      content: '''
اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا وَمَوْلَانَا مُحَمَّدِ شَجَرَةِ الْأَصْلِ النُّورَانِيَّةِ، وَلَمْعَةِ الْقَبْضَةِ الرَّحْمَانِيَّةِ، وَأَفْضَلِ الْخَلِيقَةِ الْإِنْسَانِيَّةِ، وَأَشْرَفِ الصُّورَةِ الْجِسْمَانِيَّةِ، وَمَعْدِنِ الْأَسْرَارِ الرَّبَّانِيَّةِ، وَخَزَائِنِ الْعُلُومِ الِاصْطِفَائِيَّةِ، صَاحِبِ الْقَبْضَةِ الْأَصْلِيَّـةِ، وَالبَهْجَةِ السَّنِيَّةِ وَالرُّتْبَةِ العَلِيَّةِ، مَنِ انْدَرَجَتِ النَّبِيُّونَ تَحْتَ لِوَائِهِ فَهُم مِّنْهُ وَإِلَيْهِ، وَصَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَى آلِهِ وَصَحْبِهِ عَدَدَ مَا خَلَقْتَ وَرَزَقْتَ وَأَمَتَّ وَأَحْيَيْتَ إِلَى يَوْمِ تَبْعَثُ مَنْ أَفْنَيْتَ وَسَلِّمْ تَسْلِيمًا كَثِيرًا وَالحَمْدُ للهِ رَبِّ العَالَمِين.
اللَّهُمَّ يَا مَن لَطَفْتَ بِخَلْقِ السَّمَاوَاتِ وَالأَرْض، وَلَطَفْتَ بالأَجِنَّةِ فِي بُطُونِ أُمَّهَاتِهَا، الْطُفْ بِنْا فِي قَضَائِك وَقَدَرِكَ، لُطْفًا يَلِيقُ بِكَرَمِكَ، يَا أَرْحَمَ الرَّاحِمِينَ.
اللَّهُمَّ انْصُرْ بِفَضْلِكَ دِينَنَا، وَأَهْلِكِ الْكَفَرَةَ أَعْدَاءَنَا، وَآمِنَّا فِي أَوْطَانِنَا، وَوَلِّ أُمُورَنَا خِيَارَنَا، وَلَا تُوَلِّ أُمُورَنَا شِرَارَنَا، وَارْفَعْ مَقْتَكَ وَغَضَبَكَ عَنَّا، وَلَا تُسَلِّطْ عَلَيْنَا بِذُنُوبِنَا مَن لَّا يَخَافُكَ وَلَا يَرْحَمُنَا.. يَا رَبَّ الْعَالَمِينَ.
'''
    );

const salahAlqasm = Zikr(
    title: 'صلاة القاسم',
    notes:
        '«صَلَاةُ الْقَاسِمِ» لِسَيِّدِي أَبِي الْفَيْضِ مُحَمَّدِ بْنِ عَبْدِ الْكَبِيرِ الْكَتَّانِي رضي الله عنه',
    
      content: '''
اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا وَمَوْلَانَا أَحْمَدِ، الْقَاسِمِ أَمْدَادِ الْخَزَائِنِ الْإِلَهِيَّةِ، عَلَى أَجْنَادِ الدَّوَائِرِ الْمُلْكِيَّةِ مِن لُّجَّةِ قَامُوسِ بَحْرِ جُودِكَ الْأَعْظَمِ، الطَّامِحَةِ لِشَآبِيبِ فَيْضِهِ قَوَابِلُ الْمُمْكِنَاتِ فِي عَالَمِ الْبُطُونِ وَالظُّهُورِ، الَّذِي جَعَلْتَ اسْمَهُ الْجَامِعَ الْمُفِيضَ مَيَازِيبَ رَحَمَاتِ الْعَطَايَا، الرَّاعِيَ بِرَعَايَةِ اللهِ، وَالْحَامِيَ بِحِرْزِ اللهِ، وَالْكَالِئَ بِكِلَاءَةِ اللهِ مُتَّحِدًا بِاسْمِكَ الْأَعْظَمِ الَّذِي بِهِ انْتَظَمَ أَمْرُ الْعَالَمِ، وَاسْتَقَامَ أَمْرُ السَّمَاوَاتِ وَالْأَرَضِينَ مِنْ مَنِّكَ وَنَعْتِكَ، وَوَضَعْتَ فِي عَالَمِ التَّخْطِيطِ مِنَ التَّجَلِّي الرَّحْمَانِي صُورَةَ هَيْكَلِهِ الْجِسْمَانِي مِثَالًا انْطَبَعَتِ الْكَائِنَاتُ أَجْمَعُهَا بِشَكْلِهِ الْمُحَمَّدِيِّ عُنْوَانًا لِلسَّعَادَاتِ الْأَبَدِيَّةِ السَّرْمَدِيَّةِ عَلَى صُورَةِ أُنْمُوذَج الْأَشْيَاءِ مِن رَّحْمَةِ بَحْرِ حَقِيقَةِ «خَلَقَ اللهُ سَيَّدَنَا آدَمَ عَلَى صُورَتِهِ»، وَفَجَّرْتَ عُنْصُرَ مَوْضُوعِ مَادَّةِ مَحْمُولِهِ رُوحِ الْعَالَمِ، وَآدَمِ آدَمَ وَنُقْطَةِ بَاءِ كُتْبِ الْغُيُوبَاتِ مِنْ أَنِيَّةِ «أَنَا اللهُ» بَابِكَ الْأَعْظَمِ، وَصِرَاطَكَ الْأَقْدَسِ الْأَقْوَمِ، السَّابِحِ فِي بِحَارِ عَظَمَةِ نُورِ وَجْهِكَ، الدَّالِّ عَلَيْكَ بِكَ فِي جَمِيعِ الْحَضَرَاتِ وَالْحَيْثِيَّاتِ، وَزُجَّ بِي فِي أَرْضِ الْأَنْوَارِ، وَاحْمِلْنِي بِعِنَايَتِهِ عَلَى مَطِيَّةِ الْأَسْرَارِ، وَأَشْهِدْنِيهِ حَتَّى أَتَحَقَّقَهُ وُجْدَانًا وَعَيَانًا، وَأَغْرِقْنِي فِي عَيْنِ حَيَاةِ طَوَالِعِ سُعُودِ حَقِيقَتِهِ الرَّبَّانِيَّةِ حَتَّى أَكُونَ بِهِ وَمِنْهُ وَإِلَيْهِ؛ بَلْ حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا وَوَجَدَ اللهَ عِنْدَهُ، وَآلِهِ وَصَحْبِهِ وَسَلِّمْ تَسْلِيمًا عَدَدَ رِضَاكَ عَنْهُ، يَا أَللهُ. يَا أَللهُ. يَا أَللهُ.
'''
    );

const salahAlshafia = Zikr(
    title: 'الصلاة الشافعية',
    notes:
        '''«الصَّلَاةُ الشَّافِعَيَّةُ» لِلْإِمَامِ الشَّافِعِيِّ رضي الله عنه
( تقرأ في أي وقت حسب نشاط المريد وعلى الأقل يوم الجمعة وليلتها في كل أسبوع)
''',
    
      content: '''
اللَّهُمَّ صَلِّ أَفْضَلَ صَلاَةٍ عَلَى أَسْعَدِ مَخْلُوقَاتِكَ سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِهِ وَصَحْبِهِ وسَلِّم عَدَدَ مَعْلُومَاتِكَ وَمِدَادَ كَلِمَاتِكَ كُلَّمَا ذَكَرَكَ الذَّاكِرُونَ وَغَفَلَ عَنْ ذِكْرِهِ الْغَافِلُونَ، وَعَدَدَ مَا أَحَاطَ بِهِ عِلْمُكَ، وَخَطَّ بِهِ قَلَمُكَ، وَأَحْصَاهُ كِتَابُكَ وَالرِّضَا عَنْ سَادَاتِنَا أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ وَعَلِيٍّ وَعَنِ الصَّحَابَةِ أَجْمَعِينَ وَعَنِ التَّابِعِينَ وَتَابِعِي التَّابِعِينَ لَهُمْ بِإحْسَانٍ إِلَى يَوْمِ الدِّينِ. وَرَضِيَ اللهُ عَنْ أَشْيَاخِنَا وَإِخوَانِنَا وَأَوْلِيَاءِ اللهِ أَجْمَعِينَ.
'''
    );

const salahZatia = Zikr(
    title: 'الصلاة الذاتية',
    notes:
        '«الصَّلَاةُ الذَّاتِيَّةُ » لِسَيِّدِي إِبْرَاهِيمَ الدُّسُوقِي رضي الله عنه',
    
      content: '''
اللَّهُمَّ صَلِّ عَلَى الذَّاتِ المُحَمَّدَيَّةِ، اللَّطِيفَةِ الأَحَدِيَّةِ، شَمْسِ سَمَاءِ الأَسْرَارِ، وَمَظْهَرِ الأَنْوَارِ، وَمَرْكَزِ مَدَارِ الجَلَالِ، وَقُطْبِ فَلَكِ الجَمَالِ، اللَّهُمَّ بِسِرِّهِ لَدَيْكَ وَبِسَيْرِهِ إِلَيْكَ آمِنْ خَوفِي، وَأَقِلْ عَثْرَتِي وَأَذْهِبْ حُزْنِي وَحِرْصِي وَكُنْ لِي وَخُذْنِي إِلَيْكَ مِنْيِ، وَارْزُقْنِي الفَنَاءَ عَنِّي، وَلَا تَجْعَلْنِي مَفْتُونًا بِنَفْسِي مَحْجُوبًا بِحِسِّي، وَاكْشِفْ لِي عَنْ كُلِّ سِرٍّ مَكْتُومٍ يَا حَيُّ يَا قَيُّوم.
'''
    );
