import 'package:yosria/models/azkar_models.dart';

const ibnAtaAllahCollection = <Zikr>[
  monagaIbnAtaAllah,
  hawatfAlhaqaeq,
];
const monagaIbnAtaAllah = Zikr(
    title: 'مناجاة سيدي ابن عطاء الله السكندري',
    notes: '''
مناجاةٌ سيدي ابنِ عطاءِ اللهِ السَّكَنْدَرِيِّ رضي الله عنه

تقراً الاثنين صباحًا جماعة بمسجد الأشراف
  ''',
    content: '''
1. إِلَهِي أَنَا الفَقِيرُ فِي غِنَايَ، فَكَيْفَ لَا أَكُونُ فَقِيرًا فِي فَقْرِي.
2. إِلَهِي أَنَا الْجَاهِلُ فِي عِلْمِي، فَكَيْفَ لَا أَكُونُ جَهُولًا فِي جَهْلِي.
3. إِلَهِي إِنَّ اخْتِلَافَ تَدْبِيرِكَ وَسُرْعَةَ حُلُولِ مَقادِيرِكَ مَنَعَا عِبَادَكَ الْعَارِفِينَ بِكَ عَنِ السُّكُونِ إِلَى عَطَاءٍ، وَالْيَأْسِ مِنْكَ فِي بَلَاءٍ.
4. إِلَهِي مِنِّي ما يَلِيقُ بِلُؤْمِي، وَمِنْكَ مَا يَلِيقُ بِكَرَمِكَ.
5. إِلَهِي وَصَفْتَ نَفْسَكَ بِاللُّطْفِ وَالرَّأْفَةِ بِي قَبْلَ وُجُودِ ضَعْفِي، أَفَتَمْنَعُنِي مِنْهُمَا بَعْدَ وُجُودِ ضَعْفِي؟!
6. إِلَهِي إِنْ ظَهَرَتِ الْمَحَاسِنُ مِنِّي فَبِفَضْلِكَ وَلَكَ المِنَّةُ عَلَيَّ، وَإِنْ ظَهَرَتِ المَسَاوِي مِنِّي فَبِعَدْلِكَ وَلَكَ الحُجَّةُ عَلَيَّ.
7. إِلهِي كَيْفَ تَكِلُنِي إِلَى نَفْسِي، وَقَد تَّوَكَّلْتَ لِي، وَكَيْفَ أُضَامُ وَأَنْتَ النَّاصِرُ لِي، أَمْ كَيْفَ أَخِيبُ وَأَنْتَ الْحَفِيُّ بِي، هَا أَنَا أَتَوَسَّلُ إِلَيْكَ بِفَقْرِي إِلَيْكَ، وَكَيْفَ أَتَوَسَّلُ إِلَيْكَ بِما هُوَ مَحَالٌ أَنْ يَصِلَ إِلَيْكَ، أَمْ كَيْفَ أَشْكُو إِلَيْكَ حَالِي وَهُوَ لَا يَخْفَى عَلَيْكَ، أَمْ كَيْفَ أُتَرْجِمُ لَكَ بِمَقَالِي وَهُوَ مِنْكَ بَرَزَ إِلَيْكَ، أَمْ كَيْفَ تُخَيِّبُ آمَالِي وَهِيَ قَدْ وَفَدَتْ إِلَيْكَ، أَمْ كَيْفَ لا تُحْسِنُ أَحْوَالِي وَبِكَ قَامَتْ إِلَيْكَ؟!
8. إِلَهِي مَا أَلْطَفَكَ بِي مَعَ عَظِيمِ جَهْلِي، وَما أَرْحَمَكَ بِي مَعَ قَبِيحِ فِعْلِي.
9. إِلهِي مَا أَقْرَبَكَ مِنِّي، وَمَا أَبْعَدَنِي عَنْكَ.
10. إِلَهِي مَا أَرْأَفَكَ بِي، فَمَا الَّذِي يَحْجُبُنِي عَنْكَ؟!.
11. إِلَهِي قَدْ عَلِمْتُ بِاخْتِلَافِ الْآثارِ وَتَنَقُّلَاتِ الْأَطْوَارِ أَنَّ مُرَادَكَ مِنِّي أَنْ تَتَعَرَّفَ إِلَيَّ فِي كُلِّ شَيْءٍ حَتَّى لَا أَجْهَلَكَ فِي شَيْءٍ.
12. إِلَهِي كُلَّمَا أَخْرَسَنِي لُؤْمِي أَنْطَقَنِي كَرَمُكَ، وَكُلَّمَا آيَسَتْنِي أَوْصَافِي أَطْمَعَتْنِي مِنَّتُكَ.
13. إِلَهِي مَنْ كَانَتْ مَحَاسِنُهُ مَسَاوِيَ فَكَيْفَ لا تَكُونُ مَساوِيه مَساوِيَ، وَمَنْ كَانَتْ حَقائِقُهُ دَعَاوِيَ فَكَيْفَ لَا تَكُونُ دَعَاوِيه دَعَاوِيَ.
14. إِلَهِي حُكْمُكَ النَّافِذُ وَمَشِيئَتُكَ الْقَاهِرَةُ لَمْ يَتْرُكَا لِذِي مَقَالٍ مَقَالًا، وَلَا لِذِي حَالٍ حَالًا.
15. إِلَهِي كَمْ مِنْ طَاعَةٍ بَنَيْتُهَا وَحَالَةٍ شَيَّدتُّهَا هَدَمَ اعْتِمَادِي عَلَيْهَا عَدْلُكَ؛ بَلْ أَقَالَنِي مِنْهَا فَضْلُكَ.
16. إِلَهِي أَنْتَ تَعْلَمُ وَإِنْ لَمْ تَدُمِ الطَّاعَةُ مِنِّي فِعْلًا جَزْمًا فَقَدْ دَامَتْ مَحَبَّةً وَعَزْمًا.
17. إِلَهِي كَيْفَ أَعْزِمُ وَأَنْتَ الْقَاهِرُ، وَكَيْفَ لَا أَعْزِمُ وَأَنْتَ الْآمِرُ؟!.
18. إِلَهِي تَرَدُّدِي فِي الْآثَارِ يُوجِبُ بُعْدَ الْمَزارِ، فَاجْمَعْنِي عَلَيْكَ بِخِدْمَةٍ تُوَصِّلُنِي إِلَيْكَ.
19. إِلَهِي كَيْفَ يُسْتَدَلُّ عَلَيْكَ بِما هُوَ فِي وُجُودِهِ مُفْتَقِرٌ إِلَيْكَ، أَيَكُونُ لِغَيْرِكَ مِنَ الظُّهُورِ مَا لَيْسَ لَكَ حَتَّى يَكُونَ هُوَ المُظْهِرُ لَكَ؟!، مَتى غِبْتَ حَتَّى تَحْتاجَ إِلى دَلِيلٍ يَدُلُّ عَلَيْكَ، وَمَتى بَعُدتَّ حَتَّى تَكُونَ الْآثَارُ هِيَ الَّتِي تُوصِّلُ إِلَيْكَ، عَمِيَتْ عَيْنٌ لا تَراكَ عَلَيْها رَقِيبًا، وَخَسِرَتْ صَفْقَةُ عَبْدٍ لَمْ يَجْعَل لَّهُ مِنْ حُبِّكَ نَصِيبًا.
20. إِلَهِي أَمَرْتَ بِالرُّجُوعِ إِلَى الْآثَارِ، فَارْجِعْنِي إِلَيْهَا بِكِسْوَةِ الْأنْوَارِ وَهِدَايَةِ الاِسْتِبْصَارِ حَتَّى أَرْجِعَ إِلَيْكَ مِنْها كَما دَخَلْتُ إِلَيْكَ مِنْها مَصُونَ السِّرِّ عَنْ النَّظَرِ إِلَيْها، وَمَرْفُوعَ الهِمَّةِ عَنِ الاِعْتِمادِ عَلَيْها، إِنَّكَ عَلى كُلِّ شَيءٍ قَدِيرٌ.
21. إِلَهِي هَذَا ذُلِّي ظَاهِرٌ بَيْنَ يَدَيْكَ، وَهَذَا حَالِي لَا يَخْفَى عَلَيْكَ، مِنْكَ أَطْلُبُ الوُصُولَ إِلَيْكَ، وَبِكَ أَسْتَدِلُّ عَلَيْكَ لَا بِغَيْرك فَاهْدِنِي بِنُورِكَ إِلَيْكَ، وَأَقِمْنِي بِصِدْقِ العُبُودِيَّةِ بَيْنَ يَدَيْكَ.
22. إِلَهِي عَلِّمْنِي مِنْ عِلْمِكَ المَخْزُونِ، وَصُنِّي بِسِرِّ اسْمِكَ المَصُونِ.
23. إِلَهِي حَقِّقْنِي بِحَقَائِقِ أَهْلِ القُرْبِ، وَاسْلُكْ بِي مَسَالِكَ أَهْلِ الجَذْبِ.
24. إِلَهِي أَغْنِنِي بِتَدْبِيرِكَ لِي عَنْ تَدْبِيرِي، وَبِاخْتِيَارِكَ عَنْ اخْتِيارِي، وَأوْقِفْنِي عَلى مَراكِزِ اضطِّرارِي.
25. إِلَهِي أَخْرِجْنِي مِنْ ذُلِّ نَفْسِي وَطَهِّرْنِي مِنْ شَكِّي وَشِرْكِي قَبْلَ حُلُولِ رَمْسِي، بِكَ أَسْتَنْصِرُ فَانْصُرْنِي، وَعَلَيْكَ أَتَوَكَّلُ فَلَا تَكِلْنِي، وَإِيَّاكَ أَسْأَلُ فَلا تُخَيِّبْنِي، وَفِي فَضْلِكَ أَرْغَبُ فَلا تَحْرِمْنِي، وَلِجَنابِكَ أَنْتَسِبُ فَلا تُبْعِدْنِي، وَبِبَابِكَ أَقِفُ فَلا تَطْرُدْنِي.
26. إِلَهِي تَقَدَّسَ رِضَاكَ أَنْ تَكُونَ لَهُ عِلَّةٌ مِنْكَ، فَكَيْفَ تَكُونُ لَهُ عِلَّةٌ مِنِّي، أَنْتَ الغَنِيُّ بِذَاتِكَ عَنْ أَنْ يَصِلَ إِلَيْكَ النَّفْعُ، فَكَيْفَ لا تَكُونُ غَنِيًّا عَنِّي.
27. إِلَهِي إِنَّ القَضَا وَالقَدَرَ غَلَبَنِي، وَإِنَّ الهَوَى بِوَثَائِقِ الشَّهْوَةِ أَسَرَنِي، فَكُنْ أَنْتَ النَّاصِرُ لِي حَتَّى تَنْصُرَنِي وَتَنْصُرَ بِي، وَاغْنِنِي بِفَضْلِكَ حَتَّى أسْتَغْنِيَ بِكَ عَنْ طَلَبِي، أَنْتَ الَّذِي أَشْرَقْتَ الْأَنْوَارَ فِي قُلُوبِ أَوْلِيَائِكَ حَتَّى عَرَفُوكَ وَوَحَّدُوكَ، وَأَنْتَ الَّذِي أَزَلْتَ الأَغْيارَ عَنْ قُلُوبِ أَحْبَابِكَ حَتَّى لَمْ يُحِبُّوا سِوَاكَ وَلَمْ يَلْجَأَواْ إِلَى غَيْرِكَ، أَنْتَ المُؤْنِسُ لَهُمْ حَيْثُ أَوْحَشَتْهُمُ العَوالِمُ، وَأَنْتَ الَّذِي هَدَيْتَهُمْ حَتَّى اسْتَبانَتْ لَهُمْ المَعالِمُ. مَاذَا وَجَدَ مَنْ فَقَدَك؟!،َ وَمَا الَّذِي فَقَدَ مَنْ وَجَدَكَ؟!، لَقَدْ خَابَ مَنْ رَضِيَ دُونَكَ بَدَلًا، وَلَقَدْ خَسِرَ مَنْ بَغَى عَنْكَ مُتَحَوَّلًا.
28. إِلَهِي كَيْفَ يُرْجَى سِوَاكَ وَأَنْتَ مَا قَطَعْتَ الْإِحْسَانَ، وَكَيْفَ يُطْلَبُ مِنْ غَيْرِكَ وَأَنْتَ ما بَدَّلْتَ عادَةَ الاِمْتِنَانِ، يَا مَنْ أَذَاقَ أَحِبّاءَهُ حَلَاوَةَ مُؤَانَسَتِهِ فَقَامُواْ بَيْنَ يَدَيْهِ مُتَمَلِّقِينَ، وَيَا مَنْ أَلْبَسَ أَوْلِيَاءَهُ مَلَابِسَ هَيْبَتِهِ فَقَامُواْ بِعِزَّتِهِ مُسْتَعِزّينَ. أَنْتَ الذَّاكِرُ مِن قَبْلِ الذَّاكِرِينَ، وَأَنْتَ الْبَادِئُ بِالْإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ الْعَابِدِينَ، وَأَنْتَ الْجَوَادُ بِالعَطاءِ مِنْ قَبْلِ طَلَبِ الطَّالِبِينَ، وَأَنْتَ الْوَهَّابُ، ثُمَّ أَنْتَ لِمَا وَهَبْتَنَا مِنَ المُسْتَقْرِضِينَ.
29. إِلَهِي اطْلُبْنِي بِرَحْمَتِكَ حَتَّى أَصِلَ إِلَيْكَ، وَاجْذُبْنِي بِمَنَّتِكَ حَتَّى أُقْبِلَ عَلَيْكَ.
30. إِلَهِي إِنَّ رَجَائِي لَا يَنْقَطِعُ عَنْكَ وَإِنْ عَصَيْتُكَ، كَمَا أَنَّ خَوْفِي لا يُزايِلُنِي وَإِنْ أَطَعْتُكَ.
31. إِلَهِي قَدْ دَفَعَتْنِي العَوالِمُ إِلَيْكَ، وَقَدْ أَوْقَفَنِي عِلْمِي بِكَرَمِكَ عَلَيْكَ.
32. إِلَهِي كَيْفَ أَخِيبُ وَأَنْتَ أَمَلِي، أَمْ كَيْفَ أُهَانُ وَعَلَيْكَ مُتَّكَلِي.
33. إِلَهِي كَيْفَ أسْتَعِزُّ وَأَنْتَ فِي الذِّلَّةِ أَرْكَزْتَنِي، أَمْ كَيْفَ لا أَسْتَعِزُّ وَإِلَيْكَ نَسَبْتَنِي، أَمْ كَيْفَ لَا أَفْتَقِرُ وَأَنْتَ الَّذِي فِي الفَقْرِ أَقَمْتَنِي، أَمْ كَيْفَ أَفْتَقِرُ إِلَى غَيْرِكَ وَأَنْتَ الَّذِي بِجُودِكَ أَغْنَيْتَنِي، أَنْتَ الَّذِي لَا إِلهَ غَيْرُكَ، تَعَرَّفْتَ لِكُلِّ شَيءٍ فَمَا جَهِلَكَ شَيْءٌ، وَأَنْتَ الَّذِي تَعَرَّفْتَ إِلَيَّ فِي كُلِّ شَيْءٍ، فَرَأَيْتُكَ ظَاهِرًا فِي كُلِّ شَيْءٍ، فَأَنْتَ الظَّاهِرُ لِكُلِّ شَيْءٍ. يَا مَنْ اسْتَوَى بِرَحْمَانِيَّتِهِ عَلَى عَرْشِهِ، فَصَارَ الْعَرْشُ غَيْبًا فِي رَحْمَانِيَّتِهِ، كَمَا صَارَتِ الْعَوَالِمُ غَيْبًا فِي عَرْشِهِ، مَحَقْتَ الْآثَارَ بِالْآثَارِ، وَمَحَوْتَ الْأَغْيَارَ بِمُحِيطَاتِ أَفْلَاكِ الْأَنْوَارِ، يَا مَنْ احْتَجَبَ فِي سُرَادِقَاتِ عِزِّهِ عَنْ أَنْ تُدْرِكَهُ الأبْصارُ، يَا مَنْ تَجَلَّى بِكَمَالِ بَهَائِهِ فَتَحَقَّقَتْ عَظَمَتُهُ الْأَسْرَارَ، كَيْفَ تَخْفَى وَأَنْتَ الظَّاهِرُ، أَمْ كَيْفَ تَغِيبُ وَأَنْتَ الرَّقِيبُ الحاضِرُ؟!.
 
وَاللهُ الْمُوَفِّقُ 
﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182].
''');

const hawatfAlhaqaeq = Zikr(title: 'هواتف الحقائق', notes: '''
هواتف الحقائق للإمام ابن عطاء الله السكندري في مناجاة الحق تبارك وتعالى لعبده المؤمن على ألسن هواتف الحقائق في شأن التدبير و الرزق

تقراً الاثنين صباحًا جماعة بمسجد الأشراف
  ''', footer: '''
[1]: ‎هم الذين عاينوا هذه الاحوال ورأو لطف الله وبدائع وده ؛ ومتع أسرارهم بشهود فضله وإفضاله ومنته ورحمته ورعايته.
[2]: ‎أي اخرج عا تريده لنفسك من حظوظ النفس والدنيا أبلغك عين المراد منك.
''', content: '''
1. أيها العبد: ألقِ سمعك وأنت شهيد؛ يأتك من الله المزيد، وأصغ بسمعك فأنا لست عنك ببعيد.

2. أيها العبد: كنت بتدبيري لك قبل أن تكون لنفسك، فكن لنفسك بألا تكون لها، وتوليت رعايتها قبل ظهورك وأنا الآن على الرعاية لها.

3. أيها العبد: أنَا المنفرد بالخلق والتصوير، وأنا المنفرد بالحكم والتدبير، لم تشاركني في خلقي وتصويري، فلا تشاركني في حكمي وتدبيري.

4. أيها العبد: أنا المدبِّرُ لملكي، وليس لي فيه ظهير، وأنا المنفرد بحكمي، ولا أحتاج إلى وزير.

5. أيها العبد: من كان لك بتدبيره قبل الإيجاد فلا تشاركه في المراد، ومن عَوَّدَكَ حسن النظر منه لك فلا تقابله بالعناد.

6. أيها العبد: عودْتُكَ حسنَ النظر مني لك، فعودني إسقاط التدبير منك معي، أشاكٌّ بعد وجود التجرِبة، وحَيْرَةٌ بعد وجود البيان، وضلالٌ بعد وضوح الهدى، وقد سلمت لي قيامي بمملكتي وأنت من مملكتي، فلا تنازع ربوبيتي، ولا تضادد بتدبيرك مع وجود إلهيتي.

7. أيها العبد: متى أحوجتك إليك حتى تحتال عليَّ! متى وكلت شيئًا من مملكتي لغيري حتى أكل ذلك إليك! متى خاب من كنت له مدبرًا! ومتى خذل من كنت له ناصرًا!.

8. أيها العبد: لتشغلك خدمتي عن طلب قسمتي، وليمنعك حسن الظن بي عن اتهام ربوبيتي، لا ينبغي أن يُتَّهَمَ محسن، ولا أن ينازع مقتدر، ولا أن يضاد قهار، ولا أن يعترض على حكيم، ولا أن يعال همٌّ مع لطيف.

9. أيها العبد: لقد فاز بالنجح من خرج عن الإرادة معي، ولقد ذل من احتال عليَّ، ولقد استوجب النصر مني عبدٌ إذا تحرك تحرك بي، ولقد استمسك بأقوى الأسباب من استمسك بسببي.

10. أيها العبد: نريد منك أن تريدنا ولا تريد معنا، ونريد منك أن تختارنا ولا تختار معنا، ونرضى لك أن ترضانا، ولا ترضى سوانا، وكما سلمت لي تدبيري في أرضي وسمائي، وانفرادي فيهما بحكمي وقضائي، سلم وجودك لي فإنك لي، ولا تدبر معي فإنك معي، واتخذني وكيلًا، وثِقْ بي كفيلًا أعطِكَ عطاءً جزيلًا، وأهبك فخرًا جليلًا.

11. أيها العبد: ويحك إنَّا أجللنا قدرك أن نشغلك بأمر نفسك، فلا تصغر قدرك يا من رفعناه، ولا تَذِلَّنَّ بحوالتك على غيرنا.

12. أيها العبد: يا من أعززناه ويحك أنت أجلُّ عندنا من أن نشغلك بغيرنا، لحضرتي خلقتك، وإليها خطبتك، وبجواذب عنايتي إليها جذبتك، فإن اشتغلت بنفسك حجبتك، وإن اتبعت هواها طردتك، وإن خرجت عنها قرَّبْتُكَ، وإن توددت إلي بإعراضك عَمَّنْ سواي أحببتك.

13. أيها العبد: ما آمن بي من نازعني، ولا وحَّدني من دبَّرَ معي، ولا رضي بي من شكا ما أنزلت به إلى غيري، ولا اختارني من اختار معي، ولا رضي ولا امتثل أمري من لم يستسلم لقهري.

14. أيها العبد: لو طلبت التدبير لنفسك لجهلت فكيف إذا دبرت لها؟! ولو اخترت معي ما أنصفت فكيف إذا اخترت عليَّ؟!.

15. أيها العبد: يكفيك من الجهل أن تسكن لما في يديك ولا تسكن لما في يدي، أنا أختار لك أن تختارني فتختار عليَّ.

16. أيها العبد: يا مهمومًا بنفسه، لو ألقيتها إلينا لاسترحت، ويحك أعباء التدبير لا تحملها إلا الربوبيَّةُ، وليس بقويٍّ عليها ضعيف البشرية.

17. أيها العبد: ويحك أنت محمول فلا تكن حاملًا! أردنا راحتك فلا تكن متبعًا لنفسك!.

18. أيها العبد: أمرتك بخدمتي وضمنت لك بقسمتي، فأهملتَ ما أمرت، وشككتَ فيما ضمنت، ولم أكتفِ لك بالضمان حتى أقسمت، ولم أكتفِ بالقسم حتى مثلت، فخاطبت عبادًا يفهمون: فقلت: ﴿وَفِي ٱلسَّمَآءِ رِزۡقُكُمۡ وَمَا تُوعَدُونَ۝٢٢فَوَرَبِّ ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِنَّهُۥ لَحَقٌّ مِّثۡلَ مَآ أَنَّكُمۡ تَنطِقُونَ۝٢٣﴾[الذاريات: 22-23]، وقد رزقت من غفل عني وعصاني، فكيف لا أرزق من أطاعني ودعاني!

19. أيها العبد: ويحك! الغارس للشجرة ساقيها، والممدُّ للخليقة هو باريها، مني كان الإيجاد، وعليَّ دوام الإمداد، مني كان الخلق، وعليَّ دوام الرزق، أأدخلك داري وأمنعك إبراري! أنبرزك لكوني ونمنعك جُوْدَ عوني!

20. أيها العبد: أنخرجك إلى وجودي ونمنعك جودي، لك هيأت مِنَّتِي، وفيك أظهرتُ رَحْمَتِي، وما قنعتُ بالدنيا حتى ادَّخَرْتُ لك جنتي، وما اكتفيتُ لك بذلك حتى أتْحَفْتُكَ برُؤْيَتِي، وإذا كانت هَذِهِ أفعالي، فلا تَشُكَّ في أفضالي، تخيرْني ولا تختر عليَّ، ووجِّهْ قلبك بالصدق إليَّ، فإن فعلت أريتك غرائب لطفي، وبدائع جودي، وأمتع سرك بشهودي.

21. أيها العبد: لقد ظهرت الطريق لأهل التحقيق[^1]، وتبينت معالم الهدي لذوي التوفيق؛ فبحقٍّ سَلَّم إليَّ الموفقون، وبتبيان توكَّلَ عليَّ المتوكلون، علموا أني خير لهم من أنفسهم، وأن تدبيري لهم أحرى من تدبيرهم لها، فأذْعَنُوا لربوبيتي مستسلمين، وطرحوا أنفسهم بين يَدَيَّ مفوِّضِينَ، فعَوَّضْتُهُم عوض ذلك راحة في نفوسهم، ونورًا في عقولهم، ومعرفة في قلوبهم، وتحقيقًا بقربي في أسرارهم. هذا في هذه الدار، ولهم عندي إذا قدموا عليَّ أن أجلَّ منصبهم، وأعلي مَحَلَّهُمْ، ولهم عليَّ إذا أدخلتهم داري ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.

22. أيها العبد: الوقت الذي أنت تستقبله لم أطالبك فيه بالخدمة، فلا تطالبني فيه بالقسمة، فإذا كلفتك تكفلت لك، فإذا استخدمتك أطعمتك، واعلم بأني لا أنساك وإن نسيتني، وإني ذكرتك قبل أن تذكرني، وأن رزقي عليك دائم وإن عصيتني، فإذا كنت لك كذلك في إعراضك عني، فكيف تَرَى أن أكون لك في إقبالك علي.

23. أيها العبد: ما قدرتني حَقَّ قدري إن لم تَسْتَسْلِمْ لقَهْرِي، ولا رعيت حقَّ بِرِّي إن لم تمتثل أمري، فلا تُعْرِضْ عني فإنَّك لا تجد من تستبدله مني، لا تغتر بغيري فإن أحدًا لا يغنيك عنِّي.

24. أيها العبد: أنَا الخالق لك بقدرتي، وأنا الباسط لك منَّتِي، فكما أنه لا خالق لك غيري، فكذلك لا رازق غيري.

25. أيها العبد: أخلق وأحيل علي غيري وأنا المتفضل! أمنع العباد وجود خيري وأنا المنعم! فثِقْ أيُّهَا العبد فأنا ربُّ العباد، واخرج من مرادك لي[^2] أبلغك عين المراد، واذكر سوابِقَ لطفي ولا تنس حقَّ الودادِ.
''');
