import 'package:aldurar_alnaqia/models/azkar_models.dart';

const khitamAlSalahCollection = <Zikr>[
  khitamMaghribFajr,
  khitamIshaDhuhr,
  khitamAsr,
];

const khitamMaghribFajr = Zikr(
    title: 'ورد ختام صلاة المغرب والفجر',
    notes:
        'أوراد ختام الصلوات لفضيلة مولانا الشيخ يسري السيد جبر الحسني حفظه الله تعالى ورعاه ونفعنا به في الدارين آمين',
    content: '''
لا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (١٠ مرات) [^1]

اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ (٧ مرات) [^2]

اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ (٧ مرات) [^3]

وصلِّ اللهم على سيدنا محمد وعلى آله وصحبه وبارك وسلم

أَسْتَغْفِرُ اللهَ (٣ مرات) [^4]

اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ (٣ مرات) [^5]

اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ (٣ مرات) [^6]

أعوذ بالله من الشيطان الرجيم، بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿وَإِلَـٰهُكُمْ إِلَـٰهٌ وَاحِدٌ لَّا إِلَـٰهَ إِلَّا هُوَ الرَّحْمَـٰنُ الرَّحِيمُ﴾ [البقرة: ١٦٣]

﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾ [البقرة: ٢٥٥] [^7]

يا علي يا عظيم جلّ الباقي سبحانك سبحان الله (٣٣ مرة)،

الحمد لله (٣٣ مرة)

الله أكبر (٣٤ مرة) [^8]

الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا، حق لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير

اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ [^9]

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَفِتْنَةِ الْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ (مرة واحدة) [^10]

اللهم ارزقنا الرضا واليقين وحسن الأخلاق والخواتيم يا رحمن يا رحيم

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ﴾ [غافر: ٦٠]

ثم تدعو بما فتح الله عليك لك ولأمة الحبيب صلى الله عليه وآله وسلم

ثم تختم بقراءة سورة الفاتحة
''',
    footer: '''
[1]: أخرجه الإمام أحمد بسنده عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: «مَنْ قَالَ إِذَا صَلَّى الصُّبْحَ: (لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ) عَشْرَ مَرَّاتٍ كُنَّ كَعَدْلِ أَرْبَعِ رِقَابٍ، وَكُتِبَ لَهُ بِهِنَّ عَشْرُ حَسَنَاتٍ، وَمُحِيَ عَنْهُ بِهِنَّ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ بِهِنَّ عَشْرُ دَرَجَاتٍ، وَكُنَّ لَهُ حِرْزًا مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ، وَإِذَا قَالَهَا بَعْدَ الْمَغْرِبِ فَمِثْلُ ذَلِكَ»، الحديث رقم ٢٤٠٠١. وأخرجه أيضًا النسائي في سننه الحديث رقم ١٣٤٩، وكذا ابن حبان في صحيحه الحديث رقم ٢٠٢٣ وحسنه الحافظ ابن حجر رحمه الله تعالى. وأخرج الطبراني في المعجم الكبير بسنده عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ حِينَ يَنْصَرِفُ مِنْ صَلَاةِ الْغَدَاةِ قَبْلَ أَنْ يَتَكَلَّمَ: (لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ) عَشْرَ مَرَّاتٍ، أُعْطِيَ بِهِنَّ سَبْعًا: كُتِبَ لَهُ بِهِنَّ عَشْرُ حَسَنَاتٍ، وَمُحِيَ عَنْهُ بِهِنَّ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ بِهِنَّ عَشْرُ دَرَجَاتٍ، وَكُنَّ لَهُ عَدْلَ عَشْرِ نَسَمَاتٍ، وَكُنَّ لَهُ حِفْظًا مِنَ الشَّيْطَانِ، وَحِرْزًا مِنَ الْمَكْرُوهِ، وَلَمْ يَلْحَقْهُ فِي يَوْمِهِ ذَلِكَ ذَنْبٌ إِلَّا الشِّرْكُ بِاللهِ، وَمَنْ قَالَهُنَّ حِينَ يَنْصَرِفُ مِنْ صَلَاةِ الْمَغْرِبِ أُعْطِيَ مِثْلَ ذَلِكَ فِي لَيْلَتِهِ». الحديث رقم ١١٩. وكذا ابن أبي الدنيا بإسناد حسن.
[2]: أخرجه أبو داود في سننه بسنده عَنْ مُسْلِمِ بْنِ الْحَارِثِ التَّمِيمِيِّ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم أَنَّهُ أَسَرَّ إِلَيْهِ فَقَالَ: «إِذَا انْصَرَفْتَ مِنْ صَلَاةِ الْمَغْرِبِ فَقُلْ: (اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ) سَبْعَ مَرَّاتٍ فَإِنَّكَ إِذَا قُلْتَ ذَلِكَ ثُمَّ مِتَّ فِي لَيْلَتِكَ كُتِبَ لَكَ جِوَارٌ مِنْهَا، وَإِذَا صَلَّيْتَ الصُّبْحَ فَقُلْ كَذَلِكَ فَإِنَّكَ إِنْ مِتَّ فِي يَوْمِكَ كُتِبَ لَكَ جِوَارٌ مِنْهَا»، أَخْبَرَنِي أَبُو سَعِيدٍ عَنِ الْحَارِثِ أَنَّهُ قَالَ: أَسَرَّهَا إِلَيْنَا رَسُولُ اللهِ صلى الله عليه وسلم فَنَحْنُ نَخُصُّ بِهَا إِخْوَانَنَا. الحديث رقم ٥٠٨١.
[3]: أخرجه أبو داود في سننه بسنده عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم لِرَجُلٍ: «كَيْفَ تَقُولُ فِي الصَّلَاةِ؟» قَالَ: أَتَشَهَّدُ ثُمَّ أَقُولُ: (اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ)، أَمَا إِنِّي لَا أُحْسِنُ دَنْدَنَتَكَ وَلَا دَنْدَنَةَ مُعَاذٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم: «حَوْلَهُمَا نُدَنْدِنُ»، الحديث رقم ٧٩٢.
[4]: أخرجه مسلم في صحيحه بسنده عَنْ ثَوْبَانَ قَالَ: كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا انْصَرَفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثًا وَقَالَ: «اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ ذَا الْجَلَالِ وَالإِكْرَامِ»، قَالَ الْوَلِيدُ: فَقُلْتُ لِلأَوْزَاعِيِّ كَيْفَ الاسْتِغْفَارُ؟ قَالَ: تَقُولُ: «أَسْتَغْفِرُ اللَّهَ أَسْتَغْفِرُ اللَّهَ». الحديث رقم ١٣٦٢.
[5]: أخرجه البخاري في صحيحه بسنده عَنْ ثَوْبَانَ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا انْصَرَفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثًا وَقَالَ: «اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ ذَا الْجَلَالِ وَالْإِكْرَامِ»، الحديث رقم ١٣٦٢.
[6]: أخرجه أبو داود في سننه بسنده عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم أخذ بيده وَقَالَ: «يَا مُعَاذُ وَاللهِ إِنِّي لَأُحِبُّكَ وَاللهِ إِنِّي لَأُحِبُّكَ»، فَقَالَ: «أُوصِيكَ يَا مُعَاذُ لَا تَدَعَنَّ فِي دُبُرِ كُلِّ صَلَاةٍ تَقُولُ: (اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ)»، وَأَوْصَى بِذَلِكَ مُعَاذٌ الصُّنَابِحِيَّ وَأَوْصَى بِهِ الصُّنَابِحِيُّ أَبَا عَبْدِ الرَّحْمَنِ. الحديث رقم ١٥٢٤.
[7]: أخرجه البخاري في صحيحه بسنده عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: وَكَّلَنِي رَسُولُ اللهِ صلى الله عليه وسلم بِحِفْظِ زَكَاةِ رَمَضَانَ فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ وَقُلْتُ: وَاللهِ لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ: إِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ وَلِي حَاجَةٌ شَدِيدَةٌ، قَالَ: فَخَلَّيْتُ عَنْهُ فَأَصْبَحْتُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم: «يَا أَبَا هُرَيْرَةَ مَا فَعَلَ أَسِيرُكَ الْبَارِحَةَ؟» قَالَ قُلْتُ: يَا رَسُولَ اللهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالاً فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ، قَالَ: «أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ»، فَعَرَفْتُ أَنَّهُ سَيَعُودُ لِقَوْلِ رَسُولِ اللهِ صلى الله عليه وسلم إِنَّهُ سَيَعُودُ فَرَصَدْتُهُ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ: لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ: دَعْنِي فَإِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ لَا أَعُودُ، فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ، فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم: «يَا أَبَا هُرَيْرَةَ مَا فَعَلَ أَسِيرُكَ؟» قُلْتُ: يَا رَسُولَ اللهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالاً فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ، قَالَ: «أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ»، فَرَصَدْتُهُ الثَّالِثَةَ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ: لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم وَهَذَا آخِرُ ثَلَاثِ مَرَّاتٍ أَنَّكَ تَزْعُمُ لَا تَعُودُ ثُمَّ تَعُودُ، قَالَ: دَعْنِي أُعَلِّمْكَ كَلِمَاتٍ يَنْفَعُكَ اللهُ بِهَا، قُلْتُ: مَا هُوَ؟ قَالَ: إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ ﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ﴾ حَتَّى تَخْتِمَ الآيَةَ، فَإِنَّكَ لَنْ يَزَالَ عَلَيْكَ مِنَ اللهِ حَافِظٌ وَلَا يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ، فَخَلَّيْتُ سَبِيلَهُ، فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم: «مَا فَعَلَ أَسِيرُكَ الْبَارِحَةَ؟» قُلْتُ: يَا رَسُولَ اللهِ زَعَمَ أَنَّهُ يُعَلِّمُنِي كَلِمَاتٍ يَنْفَعُنِي اللهُ بِهَا فَخَلَّيْتُ سَبِيلَهُ، قَالَ: «مَا هِيَ؟» قُلْتُ: قَالَ لِي إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ مِنْ أَوَّلِهَا حَتَّى تَخْتِمَ ﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ﴾ وَقَالَ لِي: لَنْ يَزَالَ عَلَيْكَ مِنَ اللهِ حَافِظٌ وَلَا يَقْرَبَكَ شَيْطَانٌ حَتَّى تُصْبِحَ - وَكَانُوا أَحْرَصَ شَيْءٍ عَلَى الْخَيْرِ - فَقَالَ النَّبِيُّ صلى الله عليه وسلم: «أَمَا إِنَّهُ قَدْ صَدَقَكَ وَهُوَ كَذُوبٌ، تَعْلَمُ مَنْ تُخَاطِبُ مُنْذُ ثَلَاثِ لَيَالٍ يَا أَبَا هُرَيْرَةَ؟» قَالَ: لَا، قَالَ: «ذَاكَ شَيْطَانٌ». الحديث رقم ٢٣٥٣.
[8]: أخرجه الترمذي في سننه بسنده عَنِ ابْنِ عَبَّاسٍ قَالَ: جَاءَ الْفُقَرَاءُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّ الأَغْنِيَاءَ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ أَمْوَالٌ يُعْتِقُونَ وَيَتَصَدَّقُونَ، قَالَ: «فَإِذَا صَلَّيْتُمْ فَقُولُوا: (سُبْحَانَ اللَّهِ ثَلَاثًا وَثَلَاثِينَ مَرَّةً، وَالْحَمْدُ لِلَّهِ ثَلَاثًا وَثَلَاثِينَ مَرَّةً، وَاللَّهُ أَكْبَرُ أَرْبَعًا وَثَلَاثِينَ مَرَّةً، وَلَا إِلَهَ إِلَّا اللَّهُ عَشْرَ مَرَّاتٍ) فَإِنَّكُمْ تُدْرِكُونَ بِهِ مَنْ سَبَقَكُمْ وَلَا يَسْبِقُكُمْ مَنْ بَعْدَكُمْ». وَفِي الْبَابِ أَيْضًا عَنْ أَبِي هُرَيْرَةَ وَالْمُغِيرَةِ، وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ: «خَصْلَتَانِ لَا يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ: يُسَبِّحُ اللهَ فِي دُبُرِ كُلِّ صَلَاةٍ عَشْرًا، وَيَحْمَدُهُ عَشْرًا، وَيُكَبِّرُهُ عَشْرًا، وَيُسَبِّحُ اللهَ عِنْدَ مَنَامِهِ ثَلَاثًا وَثَلَاثِينَ، وَيَحْمَدُهُ ثَلَاثًا وَثَلَاثِينَ، وَيُكَبِّرُهُ أَرْبَعًا وَثَلَاثِينَ». الحديث رقم ٤١٢.
[9]: أخرجه البخاري في صحيحه بسنده عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: أَمْلَى عَلَيَّ الْمُغِيرَةُ بْنُ شُعْبَةَ فِي كِتَابٍ إِلَى مُعَاوِيَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ: «لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ»، وَقَالَ شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بِهَذَا، وَعَنِ الْحَكَمِ عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ وَرَّادٍ بِهَذَا، وَقَالَ الْحَسَنُ: الْجَدُّ: غِنَى. الحديث رقم ٨٥٢.
[10]: أخرجه البخاري في صحيحه بسنده عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَانَ يَدْعُو فِي الصَّلَاةِ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَفِتْنَةِ الْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ»، فَقَالَ لَهُ قَائِلٌ: مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنَ الْمَغْرَمِ! فَقَالَ: «إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ، وَوَعَدَ فَأَخْلَفَ». الحديث رقم ٨٤٠. وأخرج الطبراني في المعجم الكبير بسنده عن ابن مسعود رضي الله عنه، عنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُرْضِيَنَّ أَحَدًا بِسَخَطِ اللَّهِ، وَلَا تَحْمَدَنَّ أَحَدًا عَلَى فَضْلِ اللَّهِ، وَلَا تَذُمَّنَّ أَحَدًا عَلَى مَا لَمْ يُؤْتِكَ اللَّهُ؛ فَإِنَّ رِزْقَ اللَّهِ لَا يَسُوقُهُ إِلَيْكَ حِرْصُ حَرِيصٍ، وَلَا يَرُدُّهُ عَنْكَ كَرَاهِيَةُ كَارِهٍ، وَإِنَّ اللَّهَ تَعَالَى بِقِسْطِهِ وَعَدْلِهِ جَعَلَ الرَّوْحَ وَالْفَرَحَ فِي الرِّضَا وَالْيَقِينِ، وَجَعَلَ الْهَمَّ وَالْحَزَنَ فِي الشَّكِّ [وَالسَّخَطِ]». الحديث رقم ١٠٥١٤. وأخرج الترمذي في سننه بسنده عَنْ أَبِي الدَّرْدَاءِ قَالَ: سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ: «مَا مِنْ شَيْءٍ يُوضَعُ فِي الْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ الْخُلُقِ، وَإِنَّ صَاحِبَ حُسْنِ الْخُلُقِ لَيَبْلُغُ بِهِ دَرَجَةَ صَاحِبِ الصَّوْمِ وَالصَّلَاةِ»، قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ. الحديث رقم ٢١٣١.وأخرج الترمذي في سننه بسنده عَنْ جَابِرٍ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ: «إِنَّ مِنْ أَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحَاسِنَكُمْ أَخْلَاقًا، وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ الثَّرْثَارُونَ وَالْمُتَشَدِّقُونَ وَالْمُتَفَيْهِقُونَ»، قَالُوا: يَا رَسُولَ اللهِ قَدْ عَلِمْنَا الثَّرْثَارُونَ وَالْمُتَشَدِّقُونَ فَمَا الْمُتَفَيْهِقُونَ؟ قَالَ: «الْمُتَكَبِّرُونَ»، قَالَ أَبُو عِيسَى: وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنِ الْمُبَارَكِ بْنِ فَضَالَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ فِيهِ عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، وَالثَّرْثَارُ: الْكَثِيرُ الْكَلَامِ، وَالْمُتَشَدِّقُ: الَّذِي يَتَطَاوَلُ عَلَى النَّاسِ فِي الْكَلَامِ وَيَتَفَيْهَقُ عَلَيْهِمْ. الحديث رقم ٢١٨٠. وأخرج البخاري في صحيحه بسنده عَنْ مَسْرُوقٍ قَالَ: كُنَّا جُلُوسًا مَعَ عَبْدِ اللهِ بْنِ عَمْرٍو يُحَدِّثُنَا إِذْ قَالَ: لَمْ يَكُنْ رَسُولُ اللهِ صلى الله عليه وسلم فَاحِشًا وَلَا مُتَفَحِّشًا، وَإِنَّهُ كَانَ يَقُولُ: «إِنَّ خِيَارَكُمْ أَحَاسِنُكُمْ أَخْلَاقًا». الحديث رقم ٦٠٢٩.
''',
);

const khitamIshaDhuhr = Zikr(
    title: 'ورد ختام صلاة العشاء والظهر',
    content: '''
أستغفر الله (٣ مرات)

اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ (٣ مرات)

اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ (٣ مرات)

أعوذ بالله من الشيطان الرجيم، بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿وَإِلَـٰهُكُمْ إِلَـٰهٌ وَاحِدٌ لَّا إِلَـٰهَ إِلَّا هُوَ الرَّحْمَـٰنُ الرَّحِيمُ﴾ [البقرة: ١٦٣]

﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾ [البقرة: ٢٥٥]

يا علي يا عظيم جلّ الباقي سبحانك سبحان الله (٣٣ مرة)،

الحمد لله (٣٣ مرة)

الله أكبر (٣٤ مرة)

الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا، حق لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير

اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَفِتْنَةِ الْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ (مرة واحدة)

اللهم ارزقنا الرضا واليقين وحسن الأخلاق والخواتيم يا رحمن يا رحيم

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ﴾ [غافر: ٦٠]

ثم تدعو بما فتح الله عليك لك ولأمة الحبيب صلى الله عليه وآله وسلم

ثم تختم بقراءة سورة الفاتحة
''',
);

const khitamAsr = Zikr(
    title: 'ورد ختام صلاة العصر',
    content: '''
أستغفر الله (٣ مرات)

اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ (٣ مرات)

اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ (٣ مرات)

أعوذ بالله من الشيطان الرجيم، بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿وَإِلَـٰهُكُمْ إِلَـٰهٌ وَاحِدٌ لَّا إِلَـٰهَ إِلَّا هُوَ الرَّحْمَـٰنُ الرَّحِيمُ﴾ [البقرة: ١٦٣]

﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ﴾

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿الـم ﴿١﴾ اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ﴿٢﴾﴾ [آل عمران: ١-٢]، ﴿وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ﴾ [طه: ١١١]،

﴿اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾ [البقرة: ٢٥٥]

يا علي يا عظيم جلّ الباقي سبحانك سبحان الله (٣٣ مرة)،

الحمد لله (٣٣ مرة)

الله أكبر (٣٤ مرة)

الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا، حق لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿حم ﴿١﴾ تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْعَلِيمِ ﴿٢﴾ غَافِرِ الذَّنبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ذِي الطَّوْلِ لَا إِلَـٰهَ إِلَّا هُوَ إِلَيْهِ الْمَصِيرُ ﴿٣﴾﴾ [غافر: ١-٣]

﴿لِّلَّـهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّـهُ فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ وَاللَّـهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿٢٨٤﴾ آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿٢٨٥﴾ لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴿٢٨٦﴾﴾ [البقرة: ٢٨٤-٢٨٦]

ثم تختم بقراءة سورة الفاتحة

سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ نَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ نَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ (مرة واحدة) [^1]

﴿وَالْعَصْرِ ﴿١﴾ إِنَّ الْإِنسَانَ لَفِي خُسْرٍ ﴿٢﴾ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ ﴿٣﴾﴾ [العصر: ١-٣] [^2]

وصلى الله على سيدنا محمد وعلى آله وبارك وسلم
''',
    footer: '''
[1]: أخرجه الطبراني في المعجم الصغير بسنده عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ رضي الله عنه قَالَ: قُلْنَا يَا رَسُولَ اللهِ إِنَّا إِذَا قُمْنَا مِنْ عِنْدِكَ أَخَذْنَا فِي أَحَادِيثِ الْجَاهِلِيَّةِ، فَقَالَ: «إِذَا جَلَسْتُمْ تِلْكَ الْمَجَالِسَ الَّتِي تَخَافُونَ فِيهَا عَلَى أَنْفُسِكُمْ فَقُولُوا عِنْدَ مَقَامِكُمْ: (سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ نَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ نَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ) يُكَفَّرْ عَنْكُمْ مَا أَصَبْتُمْ فِيهَا»، لَا يُرْوَى عَنِ الزُّبَيْرِ إِلَّا بِهَذَا الإِسْنَادِ؛ تَفَرَّدَ بِهِ مُحَمَّدُ بْنُ عَلِيٍّ الْبَارِقِيُّ.
[2]: أخرجه الطبراني في المعجم الأوسط بسنده عَنْ أَبِي مَدِينَةَ الدَّارِمِيِّ - وَكَانَتْ لَهُ صُحْبَةٌ - قَالَ: كَانَ الرَّجُلَانِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا الْتَقَيَا لَمْ يَفْتَرِقَا حَتَّى يَقْرَأَ أَحَدُهُمَا عَلَى الآخَرِ: ﴿وَالْعَصْرِ ﴿١﴾ إِنَّ الْإِنسَانَ لَفِي خُسْرٍ ﴿٢﴾﴾، ثُمَّ يُسَلِّمَ أَحَدُهُمَا عَلَى الآخَرِ. الحديث رقم ٥١٣٠.
''',
);
