import 'package:yosria/models/azkar_models.dart';


const adabAltareeqa = Zikr(
    title: 'آداب الطريقة اليسرية الصديقية',
    notes:
        'آداب الطريقة اليسرية الصديقية للسيد عبدالله الصديق الغماري رضي الله عنه',
    content: '''
## أدب المريد مع الله تعالى:
يلزمُ المريدُ من الأدبِ مع ربه أن يكون واقفًا مع حدود الشريعة غير مُعْتَدٍ لها، ولا متهاون فيها، وأن يكون مواظبًا على فعل السنن ونوافل الخيرات؛ فبذلك يحظى بحب مولاه ورضاه عنه جاء في حديث قدسي صحيح: «وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَلاَ يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ».

وأن يكون راضيًا بما يُجْرِيهُ الله من تصاريف الأقدار قال عليه الصلاة والسلام في وصيته لابن عباسٍ رضي الله عنه : «وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ»، ولا شك أن المريد إذا تحقق بهذا وَعَلِمَهُ اطمأنَّ قَلْبُهُ ورضي بما يصرفه في الكون رَبُّهُ.

وأن يتوجه بسؤاله إلى الله في كل شيء قال تعالى: ﴿وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ﴾ [النساء: 32]، وقال عليه الصلاة والسلام : «إِذَا سَأَلْتَ فَاسْأَلِ اللهَ»، وفي حديثٍ آخر: «لِيَسْأَلْ أَحَدُكُمْ رَبَّهُ حَاجَتَهُ كُلَّهَا حَتَّى يَسْأَلَهُ شِسْعَ نَعْلِهِ إِذَا انْقَطَعَ»، وحصل لبعض السلف ضِيقٌ في معيشته حتى هَمَّ أن يطلبَ من بعض إخوانِهِ فرأى في منامه قائلًا يقول له: (أيحسن بالحر المريد إذا وجد عند الله ما يريد أن يميل بقلبه إلى العبيد) فاستيقظ وهو أغنى الناس قلبًا.

وأن يكون متأدبًا مع الرسول عليه الصلاة والسلام متخلقًا بسنته مُقَدِّمًا لها على كل شيء مُعَظِّمًا لأهل بيته وصحابته، وهذا لا يحتاج إلى برهان فقد نص الله تعالى في غير آيةٍ من القرآن على وجوب تعظيم رسوله والتأدب في حقه وجعل طاعتَهُ طاعةً لله، ونفى الإيمانَ عمن لم يرضَ بحكمِهِ، وتوعد من خالف أمره بالفتنة والعذاب الأليم."
## أدبُ المريدِ مع شيخهِ:
يلزم المريد من الأدب مع شيخه أن يُعَظِّمَهُ ويُوَقِّرَهُ، وألا يتقدم بين يديه بقولٍ أو فعلٍ، وأن يَذُبَّ عَنْهُ في غَيْبَتِهِ، وألَّا يحضر في مَجْلِسٍ يُنَالُ فيهِ مِنْ عِرْضِ شَيْخِهِ، وأن يستأذِنَهُ في الخروج إذا كان حَاضِرًا، وألا يخالف ما يشير به عليه الشيخ إلى غير ذلك مما لذكره محل آخر، وهذه الآداب استخرجها الصوفية مما أدّب الله به الصحابة في القرآن، وأمرهم أن يستعملوها مع النبي عليه الصلاة والسلام، ولا شك أن المشايخ خلفاؤُهُ في الإرشاد والتعليم والتهذيب كما قال عليه الصلاة والسلام: «الْعُلَمَاء وَرَثَة الأَنْبِياء» فتلزم هذه الآداب في حقهم بطريق الوراثة، ولهذا ينبغي ويتأكدُ في حق المريد قبل دخوله في الطريق أن يتخير الشيخَ الذي تتحقق فيه الوراثة النبوية، وذلك بأن يكون عالمًا بالشريعة متمكنًا فيها عالمًا بالقرآن والسنة؛ لأنه لا إرشادَ ولا سلوكَ إلا بما كان مطابقًا للشرع متمشيًا مع أحكامه ومن لم يكن متمكنًا في العلم متزينًا بالاستقامة لا يصلح للإرشاد؛ لأن فاقدَ الشيءِ لا يعطيه.
## أدبُ المريدِ معَ إخوانهِ:
يلزمُ المريدُ من الأدبِ مع إخوانه أن يحترمَهم ولا يرى لنفسه فضلًا عليهم، ويواسيَ محتاجَهُمْ، ويعودَ مريضَهم، ويُعلِّمَ جاهلَهم، ويتعاونَ معهم على إقامة شعائر الطريق، ويتغاضى عمن أخطأ منهم في حقه، ويلتمسَ له العذرَ في ذلك، ويحملَ حاله على محملٍ حَسَنٍ، ويخدمَهم بنفسهِ، وإذا قابل أحدًا منهم بدأه بالبِشْرِ والمصافحة، ومن زَلَّ منهم نصحه بالحسنى من غير أن يَحْتَقِرَهُ أو يشنعَ عليه، ويلزمه من الأدب مع المُقَدَّمِ أن يُعَظِّمَهُ ولا يتقدم عليه، ويسمعَ كلامَه ويعتبره نائبًا عن الشيخِ، وعلى المقدم أن يُعْنَى بمسائل الإخوان، ويتعاهَدَهُمْ بالمذاكرة المرة بعد المرة، ويَتَفَقَّدَ غائبَهُمْ ويلين لهم الجانب، وَيُسَوِّيَ بينهم في المعاملة.
## أدبُ المُرِيدِ معَ المسلمينَ:
يلزمه من الأدب معهم أن يعاملهم بالصدق ويتواضع معهم من غير أن يطمع في أحدٍ منهم، ولا يخافه ولا يخشاه، ويسعى في منفعتهم ويحب لهم من الخير ما يحب لنفسه؛ لقوله عليه الصلاة والسلام: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ»، فإذا حافظ المريد على هذه الآداب وواظب عليها كان مُوقِنًا صَادِقًا وَنَالَ منَ الله تعالى ما يبتغيهِ. وفقنا الله جميعًا لما فيه الخير والسداد، وأنالنا رضاه إنه جَوَادٌ كَرِيمٌ رَءُوفٌ رَحِيمٌ.
  '''
//   zikrList: [
//     Zikr(title: 'أدب المريد مع الله تعالى', content: '''
// يلزمُ المريدُ من الأدبِ مع ربه أن يكون واقفًا مع حدود الشريعة غير مُعْتَدٍ لها، ولا متهاون فيها، وأن يكون مواظبًا على فعل السنن ونوافل الخيرات؛ فبذلك يحظى بحب مولاه ورضاه عنه جاء في حديث قدسي صحيح: «وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَلاَ يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ».
//
// وأن يكون راضيًا بما يُجْرِيهُ الله من تصاريف الأقدار قال عليه الصلاة والسلام في وصيته لابن عباسٍ رضي الله عنه : «وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ»، ولا شك أن المريد إذا تحقق بهذا وَعَلِمَهُ اطمأنَّ قَلْبُهُ ورضي بما يصرفه في الكون رَبُّهُ.
//
// وأن يتوجه بسؤاله إلى الله في كل شيء قال تعالى: ﴿وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ﴾ [النساء: 32]، وقال عليه الصلاة والسلام : «إِذَا سَأَلْتَ فَاسْأَلِ اللهَ»، وفي حديثٍ آخر: «لِيَسْأَلْ أَحَدُكُمْ رَبَّهُ حَاجَتَهُ كُلَّهَا حَتَّى يَسْأَلَهُ شِسْعَ نَعْلِهِ إِذَا انْقَطَعَ»، وحصل لبعض السلف ضِيقٌ في معيشته حتى هَمَّ أن يطلبَ من بعض إخوانِهِ فرأى في منامه قائلًا يقول له: (أيحسن بالحر المريد إذا وجد عند الله ما يريد أن يميل بقلبه إلى العبيد) فاستيقظ وهو أغنى الناس قلبًا.
//
// وأن يكون متأدبًا مع الرسول عليه الصلاة والسلام متخلقًا بسنته مُقَدِّمًا لها على كل شيء مُعَظِّمًا لأهل بيته وصحابته، وهذا لا يحتاج إلى برهان فقد نص الله تعالى في غير آيةٍ من القرآن على وجوب تعظيم رسوله والتأدب في حقه وجعل طاعتَهُ طاعةً لله، ونفى الإيمانَ عمن لم يرضَ بحكمِهِ، وتوعد من خالف أمره بالفتنة والعذاب الأليم."
// '''),
//     Zikr(title: 'أدبُ المريدِ مع شيخهِ', content: '''
// يلزم المريد من الأدب مع شيخه أن يُعَظِّمَهُ ويُوَقِّرَهُ، وألا يتقدم بين يديه بقولٍ أو فعلٍ، وأن يَذُبَّ عَنْهُ في غَيْبَتِهِ، وألَّا يحضر في مَجْلِسٍ يُنَالُ فيهِ مِنْ عِرْضِ شَيْخِهِ، وأن يستأذِنَهُ في الخروج إذا كان حَاضِرًا، وألا يخالف ما يشير به عليه الشيخ إلى غير ذلك مما لذكره محل آخر، وهذه الآداب استخرجها الصوفية مما أدّب الله به الصحابة في القرآن، وأمرهم أن يستعملوها مع النبي عليه الصلاة والسلام، ولا شك أن المشايخ خلفاؤُهُ في الإرشاد والتعليم والتهذيب كما قال عليه الصلاة والسلام: «الْعُلَمَاء وَرَثَة الأَنْبِياء» فتلزم هذه الآداب في حقهم بطريق الوراثة، ولهذا ينبغي ويتأكدُ في حق المريد قبل دخوله في الطريق أن يتخير الشيخَ الذي تتحقق فيه الوراثة النبوية، وذلك بأن يكون عالمًا بالشريعة متمكنًا فيها عالمًا بالقرآن والسنة؛ لأنه لا إرشادَ ولا سلوكَ إلا بما كان مطابقًا للشرع متمشيًا مع أحكامه ومن لم يكن متمكنًا في العلم متزينًا بالاستقامة لا يصلح للإرشاد؛ لأن فاقدَ الشيءِ لا يعطيه.
// '''),
//     Zikr(title: 'أدبُ المريدِ معَ إخوانهِ', content: '''
// يلزمُ المريدُ من الأدبِ مع إخوانه أن يحترمَهم ولا يرى لنفسه فضلًا عليهم، ويواسيَ محتاجَهُمْ، ويعودَ مريضَهم، ويُعلِّمَ جاهلَهم، ويتعاونَ معهم على إقامة شعائر الطريق، ويتغاضى عمن أخطأ منهم في حقه، ويلتمسَ له العذرَ في ذلك، ويحملَ حاله على محملٍ حَسَنٍ، ويخدمَهم بنفسهِ، وإذا قابل أحدًا منهم بدأه بالبِشْرِ والمصافحة، ومن زَلَّ منهم نصحه بالحسنى من غير أن يَحْتَقِرَهُ أو يشنعَ عليه، ويلزمه من الأدب مع المُقَدَّمِ أن يُعَظِّمَهُ ولا يتقدم عليه، ويسمعَ كلامَه ويعتبره نائبًا عن الشيخِ، وعلى المقدم أن يُعْنَى بمسائل الإخوان، ويتعاهَدَهُمْ بالمذاكرة المرة بعد المرة، ويَتَفَقَّدَ غائبَهُمْ ويلين لهم الجانب، وَيُسَوِّيَ بينهم في المعاملة.
// '''),
//     Zikr(title: 'أدبُ المُرِيدِ معَ المسلمينَ', content: '''
// يلزمه من الأدب معهم أن يعاملهم بالصدق ويتواضع معهم من غير أن يطمع في أحدٍ منهم، ولا يخافه ولا يخشاه، ويسعى في منفعتهم ويحب لهم من الخير ما يحب لنفسه؛ لقوله عليه الصلاة والسلام: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ»، فإذا حافظ المريد على هذه الآداب وواظب عليها كان مُوقِنًا صَادِقًا وَنَالَ منَ الله تعالى ما يبتغيهِ. وفقنا الله جميعًا لما فيه الخير والسداد، وأنالنا رضاه إنه جَوَادٌ كَرِيمٌ رَءُوفٌ رَحِيمٌ.
// ''')
//   ],
    );

const waseyaGamea = Zikr(
    title: 'وصية جامعة',
    notes:
        'وصية جامعة لجملة من الواجبات والآداب في رسالةٍ كتبها مولانا وإمامُنا ومُنْشِئُ طريقتِنا العارفُ الأكبرُ سيدي الشيخ السيد محمد بن الصديق لأهل مدينة العرائش بالمغرب الأقصى',
    content: '''
إلى إخواننا في الله وأحبائنا فيه كافة فقراء العرائش حفظكم الله وسلام عليكم ورحمة الله تعالى (أما بعد)

فَأُحِبُّكُمْ أَحَبَّكُمُ اللهُ ورَسُولُهُ أن تقومواْ بالوظائفِ الدينيةِ القلبية والقالبية ففيها السعادة الأخروية والراحة الأبدية، فمن الوظائف النطق بالشهادتين مع اعتقادِ معناها الذي هو ثبوت الوحدانية لله ذاتًا وصفةً وفعلاً وثبوت رسالة مولانا رسول الله × مع تصديقه فيما جاء به عن الله واتباع أوامره واجتناب نواهيه، فمنها وهو أهمها بعد الشهادتين أداء الصلوات الخمس في أوقاتها المُعَيَّنَةِ لها مع إيقاعها في الجماعة، والإتيان بجميع شروطها من الطهارة الكبرى والصغرى، واستقبال القبلة، وستر العورة، وإتقان الوضوء بإتقان الاستبراء الذي هو استفراغ ما في المحلين من الأذى مع الاستجمار بالحجارة إن أمكن، والغسل بالماء بعده، والإتيان بجميع الفرائض والسنن والمستحبات، ولابد مع هذا من المحافظة على النوافل كالوتر، والفجر، والرواتب القبلية والبعدية. ومنها الزكاة فأَدُّوهَا إن وجبت عليكم ولابد فإنها طهارة وبركة وسببٌ للغنى.

واحفظواْ مع هذا جوارحكم التي هي الأُذُنُ والعينُ واللسانُ والبطنُ واليدُ والفرجُ والرِّجْلُ من المنهيات فلا تسمعواْ إلا الوعظ والذكر والأمر بالمعروف والنهي عن المنكر ولا تنظروا إلى ما لا يحل لكم من النساء والصبيان والأمتعة.

واحفظوا ألسنتكم من الكَذِبِ، والغِيبَةِ، والنميمة، والزور والبهتان، وأَيْدِيَكُمْ من إذاية الناس في أبدانهم وأموالهم. وبُطُونَكُمْ من الحرام، وَفُرُوجَكُمْ من ممارسةِ ما لا يحلُّ لكم، وَأَرْجُلَكُمْ من المشي في غير طاعة الله، وَقُلُوبَكُمْ من العُجْبِ والْكِبْرِ والرِّيَاءِ والْحَسَدِ والْبُغْضِ والْغِلِّ والْحِقْدِ والْغِشِّ والْخَدِيعَةِ وَالْمُدَاهَنَةِ وَحُبِّ الرِّيَاسَةِ والتَّقَدُّمِ وَحُبِّ الْمَدْحِ وَخَوْفِ الذَّمِّ والاهْتِمَامِ بالرِّزْقِ والْخَوْفِ مِنَ الْخَلْقِ.

وَتَفَكُّرُواْ فِي مَصْنُوعَاتِ اللهِ، وَاسْتَحْضِرُواْ اطِّلَاعَهُ عَلَيْكُمْ في جميع الحالات، ولا تستعظمواْ هذا فإنه سهلٌ إن استعنتم عليه بالله، ثم المؤكد به عليكم الاجتماع لذكرِ اللهِ وقتَ فراغِكُمْ من الأشغال، وخصوصًا فيما بين المغرب والعشاء، وفيما بين صلاة الصبح وطلوع الشمس، ففي ذِكْرِ الله في هذين الوقتين من الفضل والثواب شيء عظيم.

وَتَزَاوَرُواْ في الله، وَتَحَابُّواْ فِيهِ وَوَاسُواْ مُحْتَاجَكُمْ، وصِلُواْ أَرْحَامَكُمْ، وَعُودُواْ مَرْضَاكُمْ، وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ، وَاحْتَمِلُواْ أَذَى مَنْ أَذَاكُمْ، وَلَا تُجَالِسُواْ مَنْ يَقْطَعُكُمْ عَنْ ذِكْرِ اللهِ، وَلَا تُخَالِطُوهُ فِإِنَّهُ يُمِيتُ قُلَوبَكُمْ وَفِي مَوْتِهَا فَسَـــادُ الدِّينِ وَضَعْفُ الْيَقِينِ، وَفِي ذِكْرِ اللهِ ذِكْرُهُ وَرِضَاهُ، وَمُجَالَسَتُهُ طُمَأْنِينَةُ الْقَلْبِ، وَفِي الاجْتِمَاعِ عَلَيْهِ رِيَاضُ الْجَنَّةِ وَغَشَيَانُ الرَّحْمَةِ وَنُزُولُ السَّكِينَةِ وَحُفُوفُ الْمَلَائِكَةِ حسبما وردتْ به الأخبارُ وَصَحَّتْ عَنْ رسولِ الله صلى الله عليه وسلم الآثارُ، وَإِيَّاكُمْ وَالْإِنْصَاتَ لِمَنْ يَصُدَّكُمْ أَوْ يَلُومَكُمْ فَإِنَّهُ شَيْطَانٌ مَارِدٌ وَمَطْرُودٌ شَارِدٌ.

وَلَا تُسِيئُواْ لِأَحَدٍ مِنْ عِبَادِ اللهِ، وَلَا تَخَافُوهُ وَلَا تَرْجُوهُ فَإِنَّ الأمورَ كُلَّهَا بِيَدِ اللهِ لَا يَمْلِكُ أَحَدٌ لِأَحَدٍ مِنْهَا ضَرًا وَلَا نَفْعًا وَلَا خَفْضًا وَلَا رَفْعًا وَصُونُواْ قُلُوبَكُمْ مِنَ الطَّمَعِ فِي الْخَلْقِ فَإِنَّهُ الْفَقْرُ الْحَاضِرُ والذُّلُّ الظَّاهِرُ، وَاعْلَمُواْ أَنَّكُمْ إِنْ فَعَلْتُمْ هَذَا ثَبَتَتْ خُصُوصَيَّتُكُمْ، وَنِلْتُمْ مَطْلُوبَكُمْ مِّن رَّبِّكُمْ، أَعَانَكُمُ اللهُ وَقَوَّاكُمْ، وَمِن نَّزَغَاتِ الشَّيْطَانِ حَفِظَكُمْ وَوَقَاكُمْ وَالسَّلَامُ.
''');

const sanadAltareeqa = Zikr(
    title: 'إسناد الطريقة اليسرية',
    notes: 'إسناد الطريقة اليسرية الصديقية الدرقاوية الشاذلية',
    content: '''
نقول: أخذتُ هذه الطريقةَ النبويةَ الشريفةَ أنا الفقيرُ إلى الله «يسري رشدي السيد جبر» عن:
1. سيدي أبي الفضل عبد الله بن محمد الصِّدِّيقِ الغُمَارِي (ت 1413هـ-1993م)، عن:
2. والده سيدي محمد بن الصِّدِّيقِ الغُمَارِي (ت 1354هـ-1936م)، عن:
3. سيدي محمد بن إبراهيم الفاسي (ت 1326هـ-1908م)، وهو أخذها عن:
4. شيخه سيدي عبد الواحد بُنَاني الفاسي (ت 1285هـ-1869م)، وهو عن:
5. شيخه سيدي محمد أيوب (ت 1273هـ-1856م) دفين زاويته بفاس، وهو أخذها عن:
6. الشريف سيدي الحاج أحمد بن عبد المؤمن الغماري (ت 1262-1846م)، وهو عن:
7. إمام الأولياء سيدنا ومولانا محمد العربي الدرقاوي (ت 1239هـ-1823م) دفين بني زَرْوَال، وهو عن:
8. بحر البحور أبي الحسن سيدي علي الجمل (ت 1194هـ-1780م) دفين زاويته بفاس، وهو أخذ عن:
9. سيدي محمد العربي (ت 1166هـ-1753م)، وهو أخذ عن:
10. والده سيدي أحمد بن عبد الله معن (ت 1120هـ-1708م)، وهو أخذ عن:
11. سيدي قاسم الخصاصي (ت 1083هـ-1673م)، وهو أخذ عن:
12. سيدي محمد فتح بن عبد الله المُكَنَّى مَعَنْ (ت 1062هـ-1652م)، وهو أخذ عن:
13. سيدي عبد الرحمن الفاسي (ت 1036هـ-1626م) مُحَشِّي «تفسير الجلالين»، و«صغرى السنوسي»، وهو أخذ عن:
14. أخيه القطب أبي المحاسن سيدي يوسف الفاسي (ت 1013هـ-1604م)، وهو عن:
15. القطب سيدي عبد الرحمن المجذوب (ت 976هـ-1569م)، وهو عن:
16. أبي الحسن سيدي علي الشهير بالدوار (ت 940هـ-1533م)، عن:
17. أبي إسحاق سيدي إبراهيم أَفْحَام الزَّرْهُونِي، عن:
18. القطب الجامع سيدي أحمد زَرُّوق (ت 879هـ-1474م) المدفون بسملاطة بطرابلس ليبيا، عن:
19. القطب أحمد بن عقبة الحضرمي (ت 895هـ-1490م) المدفون بتربة البرقوقة من القاهرة، عن:
20. أبي زكرياء يحيى بن أحمد بن محمد وفا القادري (ت 857هـ-1453م)، عن:
21. القطب سيدي علي بن محمد وفا (ت 807هـ-1405م)، عن:
22. والده القطب سيدي محمد بحر الصفا (ت 765هـ-1363م)، عن:
23. القطب سيدي داود الباخلي (ت 735هـ-1335م) دفين الإسكندرية، عن:
24. تاج الدين سيدي أحمد بن عطاء الله (ت 709هـ-1309م) صاحب «الحكم»، عن:
25. القطب أبي العباس أحمد بن عمر المرسي (ت 685هـ-1287م)، عن:
26. قطب الأقطاب سيدي أبي الحسن الشاذلي الغماري (ت 656هـ-1258م)، دفين حُمَيْثرة بصعيد مصر، عن:
27. القطب مولانا عبد السلام ابن بشيش، دفين جبل العلم بالمغرب الأقصى، عن:
28. القطب سيدي عبد الرحمن المدني ابن الحسين المشهور بالزيات، لسكناه بحارة الزياتين بالمدينة المنورة، عن:
29. القطب تُقَيْ الدين الفُقَيِّر -بالتصغير فيهما- عبد الرحمن النهروندي نسبة إلى نهروند من قرى واسط بالعراق، وهو عن:
30. القطب فخر الدين، عن:
31. القطب نور الدين أبي الحسن علي، عن:
32. القطب تاج الدين محمد بن القطب شمس الدين التركي، عن:
33. القطب زين الدين القزويني، عن:
34. القطب أبي إسحاق إبراهيم البصري، عن:
35. القطب أبي القاسم أحمد المرواني، عن:
36. القطب أبي محمد سعيد، عن:
37. القطب سعد، عن:
38. القطب أبي محمد فتح السعود، عن:
39. القطب سيدي سعيد الغزواني، عن:
40. القطب سيدي أبي محمد جابر بن عبد الله الأنصاري، عن:
41. أول الأقطاب، وأجل الأصحاب سيدنا الحسن ابن سيدتنا فاطمة الزهراء عن:
42. والده باب مدينة العلم مولانا عليّ كرَّم الله وجهه، عن:
43. سيد المرسلين وحبيب رب العالمين سيدنا محمدٍ صلى الله عليه وسلم عن الحق جل جلاله وتقدَّستْ أسماؤُهُ وصفاته.
''');

const asrGomaa = Zikr(
    title: 'ورد عصر يوم الجمعة',
    notes: 'يقرأ ما بين عصر الجمعة إلى مغربها',
    content: '''
اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَنَبِيِّكَ وَرَسُولِكَ النَّبِي الأُمِّي) (80 مرة).
''');

// ويقرءون هذه الصيغة بغير عدد في أي وقت، وأقلها (3 مرات) وهي للشدائد: اللَّهُمَّ صلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلاةً تُنَجِّينَا بِهَا مِنْ جَمِيعِ الأَهْوَالِ وَالآفَاتِ، وَتَقْضِي لَنَا بِهَا جَمِيعَ الحَاجَاتِ، وَتُطَهِّرُنَا بِهَا مِنْ جَمِيعِ السَّيِئَاتِ، وَتَرْفَعُنَا بِهَا أَعْلَى الدَّرَجَاتِ، وَتُبَلِغُنَا بِهَا أَقْصَى الغَايَاتِ مِنْ جَمِيعِ الخَيْرَاتِ فِي الحَيَاةِ وَبَعْدَ المَمَاتِ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّم. في الملمات والشدائد يقرءون بعدد (4444) الصلاة التازية الشهيرة بالنارية وهي للإمام التازي وصيغتها بالتلقي: اللَّهُمَّ صَلِّ صَلاةً كَامِلَةً وَسَلِّم سَلامًا تَامًّا عَلَى نَبِيٍّ تَنْحَلُّ بِهِ العُقَدُ، وَتَنْفَرِجُ بِهِ الكُرَبُ، وَتُقْضَى بِهِ الحَوَائِجُ، وَتُنَالُ بِهِ الرَّغَائِبُ وَحُسْنُ الخَوَاتِيْم، وَيُسْتَسْقَى الغَمَامُ بِوَجِهِه الكَرِيم. وتقسم على جميع الحاضرين. ومن الأسماء: (يا فتاح، يا رزاق).
//
// ويختم المريد بالفاتحة لروح مولانا القطب محمد بن الصديق ولشيخنا وقدوتنا الحجة ريحانة الزمان سيدي ومولاي الحافظ أبي الفضل عبد الله بن محمد بن الصديق نفعنا الله به وبمشايخه وآبائه وتلامذته ومريديه ومحبيه في الدارين آمين.

