import 'package:aldurar_alnaqia/models/azkar_models.dart';

const poemsCollection = [
  poemMonfarigaGazali,
  poemMonfarigaNahawi,
  poemBanatSuad,
  manzoumaAsmaaHosna,
  poemBordaBosiri,
  poemModaria,
  poemMohamadia,
  poemmadhWithQuarn,
  duaaEstighatha,
];

const poemmadhWithQuarn = Zikr(
    title: 'مدح النبي ﷺ بأسماء سور القرآن',
    notes: '''
هِيَ قَصِيدَةٌ لِلشَّاعِرِ أَبُو عَبْدِ اللهِ شَمْسِ الدِّينِ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ عَلِيٍّ الْهَوَّارِيِّ الْمَالِكِي الْأَندَلُسِيِّ النَّحْوِي رضي الله عنه الْمَعْرُوفِ بِـ «ابْنِ جَابِرٍ» يَمْدَحُ النَّبِيَّ الْأَعْظَمَ صلى الله عليه وسلم بِالتَّوْرِيَةِ بِسُوَرِ الْقُرْآنِ كُلِّهَا.

تقراًجماعة بعد صباح الجمعة بمسجد الأشراف
''',
    url:
        "https://archive.org/download/dorar_audio/%D9%85%D8%AF%D8%AD%20%D8%A7%D9%84%D9%86%D8%A8%D9%8A%20%D8%A8%D8%A3%D8%B3%D9%85%D8%A7%D8%A1%20%D8%B3%D9%88%D8%B1%20%D8%A7%D9%84%D9%82%D8%B1%D8%A2%D9%86%20%D9%84%D8%A7%D8%A8%D9%86%20%D8%AC%D8%A7%D8%A8%D8%B1%20%D8%A7%D9%84%D8%A3%D9%86%D8%AF%D9%84%D8%B3%D9%8A.mp3",
    footer: '''
[1]: لقوله فيها: ﴿ثُمَّ جَعَلْنَاكَ عَلَى شَرِيعَةٍ مِنَ الْأَمْرِ﴾[الجاثية:18].
[2]: القتال: سورة سيدنا محمد صلى الله عليه وسلم.
[3]: امتحان: سورة الممتحنة.
[4]: سأل: المعارج.
[5]: ويل للمطففين.
  ''',
    content: '''
Fفِي كُـلِّ فَاتِحَةٍ لِلْقَوْلِ مُعْتبِرَهْ __ حُقَّ الثَّنَاءُ عَلَى الْمَبْعُوثِ بِالْبَقَرَهْX
Fفِي آلِ عِمْرَانَ قِدَمًا شَاعَ مَبْعَثُهُ __ رِجَالُهُمُ والنِّسَاءُ اسْتَوْضَحُواْ خَبَرَهْX
Fمَنْ مَدَّ لِلنَّاسِ مِنْ نُعْمَاهُ مَائِدَةً __ عَمَّتْ فَلَيْسَتْ عَلَى الْأَنْعَامِ مُقْتَصِرَهْX
Fأَعْرَافُ نُعْمَاهُ مَا حَلَّ الرَّجَاءُ بِهَا __ إِلَّا وَأَنْفَالُ ذَاكَ الْجُودِ مُبْتَدِرَهْX
Fبِهِ تَوَسَّلْ إِذْ نَادَى بِـ تَوْبَتِهِ __ فِي الْبَحْرِ يُونُسُ وَالظَّلْمَاءُ مُعْتَكِرَهْX
Fهُودٌ وَيُوسُفُ كَمْ خَوْفٍ بِهِ أَمِنَا __ وَلَنْ يُرَوِّعَ صَوْتُ الرَّعْدِ مَنْ ذَكَرَهْX
Fمَضْمُونَ دَعْوَةِ إِبْرَاهِيمَ كَـانَ وَفِـي __ بَيْتِ الْإِلَهِ وَفِي الْحِجْرِ الْتَمِسْ أَثَرَهْX
Fذُو أُمَّةٍ كَدَوِيِّ النَّحْلِ ذِكْرُهُمُ __ فِي كُلِّ قُطْرٍ فَسُبْحَانَ الَّذِي فَطَرَهْX
Fبِكَهْفِ رُحْمَاهُ قَدْ لَاذَ الْوَرَى وَبِهِ __ بُشْرَى ابْنِ مَرْيَمَ فِي الْإِنْجِيلِ مُشْتَهِرَهْX
Fسَمَّاهُ طَهَ وَحَضَّ الْانْبِيَاءَ عَلَى __ حَجِّ الْمَكَانِ الَّذِي مِنَ اجْلِهِ عَمَرَهْX
Fقَدَ أَفْلَحَ النَّاسُ بِالنُّـورِ الَّذِي عَمَرُواْ __ مِن نُّورِ فُرْقَانِهِ لَمَّا جَلَا غُرَرَهْX
Fأَكَابِـرُ الشُّعَرَاءِ الُّلسْنِ قَدْ عَجَزُواْ __ كَالنَّمْلِ إِذْ سَمِعَتْ آذَانُهُمْ سُوَرَهْX
Fوَحَسْبُهُ قَصَصٌ لِلْعَنْكَبُوتِ أَتَى __ إِذْ حَاكَ نَسْجًا بِبَابِ الْغَارِ قَدْ سَتَرَهْX
Fفِي الرُّومِ قَدْ شَاعَ قِدَمًا أَمْرُهُ وَبِهِ __ لُقْمَـانَ وَفَّـى لِلـدُّرِّ الَّذِي نَثَـرَهْX
Fكَمْ سَجْدَةٍ فِي طُلَى الْأَحْزَابِ قَدْ __ سَجَدَتْ سُيُوفُهُ فُأَرَاهُمْ رَبُّهُ عِبَرَهْX
Fسَبَاهُـمْ فَاطِرُ السَّبْعِ العُلَى كَرَمًا __ لِمنْ بِيَاسِينَ بَيْنَ الرُّسْلِ قَدْ شَهَرَهْX
Fفِي الْحَرْبِ قَدْ صُفَّتِ الْأَمْلَاكُ تَنْصُرُهُ __ فَصَادَ جَمْعَ الْأَعَادِي هَازِمًا زُمَرَهْX
Fلِغَافِـرِ الذَّنْبِ فِي تَفْضِيلِهِ سُوَرٌ __ قَدْ فُصِّلَتْ لِمَعَانٍ غَيْرِ مُنْحَصِرَهْX
Fشُورَاهُ أَنْ تَهْجُرَ الدُّنْيَا فَزُخْرُفُهَا __ مِثْلُ الدُّخَانِ فَيُغْشِي عَيْنَ مَن نَّظَرَهْX
Fعَزَّتْ شَرِيعَتُهُ[^^1] الْبَيْضَاءُ حِينَ أَتَى __ أَحْقَافَ بَدْرٍ وَجُنْدُ اللهِ قَدْ نَصَرَهْX
Fفَجَاءَ بَعَدَ الْقِتَالِ[^^2] الْفَتْحُ مُتَّصِلًا __ وَأَصْبَحَتْ حُجُرَاتِ الدِّينِ مُنْتَصِرَهْX
Fبِقَافٍ وَالذَّارِيَاتِ اللهُ أَقْسَـمَ فِـي __ أَنَّ الَّذِي قَالَهُ حَقٌّ كَمَا ذَكَرَهْX
Fفِي الطُّورِ أَبْصَرَ مُوسَى نَجْمَ سُؤْدَدِهِ __ والْأُفْقُ قَدْ شُقَّ إِجْلَالًا لَهُ قَمَرَهْX
Fأَسْرَى فَنَالَ مِنَ الرَّحْـمَـنِ وَاقِعَةً __ فِي الْقُرْبِ ثَـبَّـتَ فِيهِ رَبُّهُ بَصَرَهْX
Fأَرَاهُ أَشْيَاءَ لَا يَقْوَى الْـحَـدِيدُ لَهَا __ وَفِي مُـجَـادَلَـةِ الْكُفَّاِر قَدْ أَزَرَهْX
Fفِي الْحَشْرِ يَوْمُ امْتِحَانِ[^^3] الْخَلْقِ يُقْبَلُ فِي __ صَفٍّ مِنَ الرُّسُلِ كُـلٌّ تَابِـعٌ أَثَرَهْX
Fكَفٌّ يُسَـبِّحُ لِلهِ الْحَصَاةُ بِهَا __ فَاقْبَلْ إِذَا جَاءَكَ الْحَقُّ الَّـذِي قَدَرَهْX
Fقَدْ أَبْصَـرَتْ عِنْدَهُ الدُّنْيَا تُغَابُنُهَا __ نَالَتْ طَلَاقًا وَلَمْ يَصْرِفْ لَهَا نَظَرَهْX
Fتَحْرِيمُهُ الْحُبَّ لِلدُّنْيَا وَرَغْبَتُهُ __ عَنْ زَهْرَةِ الْـمُلْكِ حَقًا عِنْدَمَا نَظَرَهْX
Fفِي نُونَ قَدْ حَقَّتِ الْأَمْدَاحُ فِيهِ بِمَا __ أَثْنَى بِهِ اللهُ إِذْ أَبْدَى لَنَا سِيَرَهْX
Fبِجَاهِهِ سَأَلَ[^^4] نُوحٌ فِي سَفِينَتِهِ __ سُفْنَ النَّجَاةِ وَمَوْجُ الْبَحْرِ قَدْ غَمَرَهْX
Fوَقَالَتِ الْجِنُّ جَاءَ الْحَقُّ فَاتَّبِعُواْ __ مُزَّمِّلًا تَابِعًا لِلْحَقِّ لَنْ يَذَرَهْX
Fمُدَّثِّرًا شَافِعًا يَوْمَ الْقِيَامَةِ هَلْ __ أَتَى نَبِيٌّ لَهُ هَذَا الْعُلَى ذَخَرَهْX
Fفِي الْمُرْسَـلَاتِ مِنَ الْكُتُبِ انْجَلَى نَبَأٌ __ عَنْ بَعْثِهِ سَائِرُ الْأَخْبَارِ قَدْ سَطَرَهْX
Fأَلْطَافُهُ النَّازِعَاتُ الضَّيْمَ حَسْبُكَ فِي __ يَوْمٍ بِهِ عَبَسَ الْعَاصِي لِمَا ذَعَرَهْX
Fإِذْ كُوِّرَتْ شَمْسُ ذَاكَ الْيَوْمِ وَانْفَطَرَتْ __ سَمَاؤُهُ وَدَعَتْ وَيْلٌ[^^5] بِهِ الْفَجَرَهْX
Fوَلِلسَّـمَاءِ انْشِقَاقٌ وَالْبُرُوجُ خَلَتْ __ مِنْ طَارِقِ الشُّهْبِ وَالْأَفْلَاكُ مُسْتَتِـرَهْX
Fفَسَبِّحِ اسْمَ الَّذِي فِي الْخَلْقِ شَفَّعَهُ __ وَهَلْ أَتَاكَ حَدِيثُ الْحَوْضِ إِذْ نَهَرَهْX
Fكَالْفَجْرِ فِي الْبَلَدِ الْمَحْرُوسِ غُرَّتُهُ __ وَالشَّمْسُ مِن نُّورِهِ الوَضَّاحِ مُسْتَتِـرَهْX
Fوَالَّليْلُ مِثْلُ الضُّحَـى إِذْ لَاحَ فِيهِ أَلَـمْ __ نَشْرَحْ لَكَ الْقَوْلَ فِي أَخْبَارِهِ الْعَطِرَهْX
Fوَلَوْ دَعَا التَّينَ وَالزَّيْتُونَ لَابْتَدَرَا __ إِلِيهِ فِي الْحِينِ وَاقْرَأْ تَسْتَبِنْ خَبَـرَهْX
Fفِي لَيْلَةِ الْقَدْرِ كَمْ قَدْ حَازَ مِنْ شَرَفٍ __ فِي الْفَخْرِ لَمْ يَكُنِ الْإِنْسَانُ قَدْ قَدَرَهْX
Fكَمْ زُلْزِلَتْ بِالْجِيَادِ الْعَادِيَاتِ لَـهُ __ أَرْضٌ بِقَارِعَةِ التَّخْوِيفِ مُنْتَشِـرَهْX
Fلَـهُ تَكَاثُـرُ آيَاتٍ قَدِ اشْتَهَرَتْ __ فِي كُلِّ عَصْرٍ فَوَيْلٌ لِلَّذِي كَفَرَهْX
Fأَلَمْ تَرَ الشَّمْسَ تَصْدِيقًا لَهُ حُبِسَتْ __ عَلَى قُرَيْشٍ وَجَاءَ الرُّوحُ إِذْ أَمَرَهْX
Fأَرَأَيْتَ أَنَّ إِلَـهَ الْعَرْشِ كَرَّمَهُ __ بِكَوْثَرٍ مُرْسَلٍ فِي حَوْضِهِ نَهِرَهْX
Fوَالْكَافِرُونَ إِذَا جَاءَ الْوَرَى طُرِدُواْ __ عَنْ حَوْضِهِ فَلَقَدْ تَبَّتْ يَدُ الْكَفَرَهْX
Fإِخْلَاصُ أَمْدَاحِهِ شُغْلِـي فَكَمْ فَلَقٌ __ لِلصُّبْحِ أَسَمِعْتَ فِيهِ النَّاسَ مُفْتَخِرَهْX
Fأَزْكَى صَلَاتِي عَلَى الْهَادِي وَعِتْرَتِهِ __ وَصَحْبِهِ وَخُصُوصًا مُنْهُمُ عَشَرَهْX
Fصِدِّيقُهُمْ عُمَرُ الْفَارُوقُ أَحْزَمُهُـمْ __ عُثْمَانُ ثُمَّ عَـلِـيُّ مُهلِكُ الْكَفَرَهْX
Fسَعْدٌ سَعِيدٌ عُبَيْد طَلْحَةٌ وَأَبُو __ عُبَيْدَةَ وَابْنُ عَوْفٍ عَاشِـرُ الْعَشَـرَهْX
Fوَحَمْزَةُ ثُمَّ عَبَّاسٌ وَآلُهُمَا __ وَجَعْفَرٌ وَعَقِيلٌ سَادَةٌ خِيَـرَهْX
Fأُولَئِكَ النَّاسُ آلُ الْمُصْطَفَى وَكَفَـى __ وَصَحْبُهُ الْمُقْتَدُونَ السَّـادَةُ البَـرَرَهْX
Fوَفِي خَدِيجَةَ وَالزَّهْرَا وَمَا وَلَـدَتْ __ أَزْكَى مَدِيحِي سَأُهْدِي دَائِمًا دُرَرَهْX
Fعَنْ كُلِّ أَزْوَاجِهِ أَرْضَى وَأُوثِرُ __ مَنْ أَضْحَتْ بَرَاءَتُهَا فِي الذِّكْرِ مُنْتَشِرَهْX
Fأَقْسَمْتُ لَا زِلْتُ أُهْدِيهِمْ شَذَا مَدْحِـي __ كَالـرَّوْضِ يَنْثُرُ مَنْ أَكْمَامِهِ زَهَرَهْX
''');

const poemModaria = Zikr(
    title: 'القصيدة الْمضَرِيَّة في الصلاة على خير البرية',
    notes: '''
القصيدة الْمضَرِيَّة في الصلاة على خير البرية للإمام البوصيري رضي الله عنه

تقراً جماعة صباح الجمعة بمسجد الأشراف
  ''',
    url:
        "https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%82%D8%B5%D9%8A%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D8%B6%D8%B1%D9%8A%D8%A9.mp3",
    content: '''
Fيَـا رَبِّ صَلِّ عَلَىٰ الْمُخْتَارِ __ مِن مُّضَـرٍ وَالْأَنبِيَـا وَجَمِيـعِ الرُّسْلِ مَا ذُكِرُواْX
Fوَصَلِّ رَبِّ عَلَىٰ الْهَادِي وَشِيعَتِــهِ __ وَصَحْبِهِ مَن لِّطَيِّ الدِّينِ قَدْ نَشَـرُواْX
Fوَجَاهَـدُواْ مَعَـهُ فِي اللّٰهِ وَاجْتَهَدُواْ __ وَهَاجَرُواْ وَلَـهُ آوَوْا وَقَـدْ نَصَـرُواْX
Fوَبَيَّنُواْ الْفَرْضَ وَالْمَسْنُونَ وَاعْتَصَبُواْ __ لِلّٰهِ وَاعْتَصَمُواْ بِاللّٰهِ فَانْتَصَرُواْX
Fأَزْكَـىٰ صَلَاةٍ وَأَنْمَاهَــا وَأَشْرَفَهَا __ يُعَطِّـرُ الكَوْنَ رَيَّاً نَشْرُهَا الْعَطِرُX
Fمَعْبُـوقَــةٍ بِعَبِيـقِ الْمِسْـكِ زَاكِيَــةٍ __ مِـنْ طِيْبِهَا أَرَجُ الرِّضْوَانِ يَنْتَشِـرُX
Fعَدَّ الْحَصَىٰ والثَّـرَىٰ والرَّمْلِ يَتْبَعُهَا __ نَجْمُ السَّمَا وَنبَاتُ الْأَرْضِ والْمَدَرُX
Fوَعَـدَّ وَزْنَ مَثَاقِيـلِ الْجِبَـالِ كَمَـا __ يَلِيْـهِ قَطْرُ جَمِيعِ الْمَـاءِ وَالْمَطَرُX
Fوَعَدَّ مَا حَوَتِ الْأَشْجَارُ مِنْ وَرَقٍ __ وَكُـلُّ حَرْفٍ غَدَا يُتْلَىٰ وَيُسْتَطَـرُX
Fوَالْوَحْشُ وَالطَّيْرُ وَالْأَسْمَاكُ مَعْ نَعَمٍ __ يَلِيهِمُ الْجِــنُّ والْأَمْــلَاكُ والْبَشَرُX
Fوَالذَّرُّ وَالنَّمْلُ مَعْ جَمْعِ الْحُبُوبِ كَذَا __ وَالشَّعْرُ وَالصُّوفُ وَالْأَرْيَاشُ وَالْوَبَرُX
Fوَمَـا أَحَاطَ بِهِ الْعِلْمُ الْمُحِيِطُ وَمَا __ جَـرَىٰ بِـهِ الْقَلَمُ الْمَأْمُورُ وَالْقَدَرُX
Fوَعَدَّ نَعْمَائِكَ اللَّاتِي مَنَنْتَ بِهَا __ عَلَىٰ الْخَلائِقِ مُذْ كَانُواْ وَمُذْ حُشِـرواْX
Fوَعَدَّ مِقْدَارِهِ السَّامِي الَّذِي شَرُفَتْ __ بِهِ النَّبِيُّـونَ وَالْأَمْلاكُ وَافْتَخَـرُواْX
Fوَعَدَّ مَا كَانَ فِي الْأَكْوانِ يَا سَنَدِي __ وَمَـا يَكوُنُ إِلىٰ أَنْ تُبْعَـثَ الصُّـوَرُX
Fفِـي كُـلِّ طَرْفَةِ عَيْـنٍ يَطْرِفُونَ بِهَا __ أَهْلُ السَّمَوَاتِ وَالْأَرَضِينَ أَوْ يَذَرُواْX
Fمِلْءَ السَّمَوَاتِ وَالْأَرَضِينَ مَعْ جَبَلٍ __ وَالْفَرْشِ وَالْعَرْشِ وَالْكُرْسِي وَمَا حَصَرُواْX
Fمَـا أَعْـدَمَ اللّٰهُ مَوْجُودًا وَأَوْجَــدَ __ مَعْدُومًا صَلَاةً دَوَامًا لَيْسَ تَنْحَصِـرُX
Fتَسْتَغْرِقُ الْعَدَّ مَعْ جَمْعِ الدُّهُورِ كَمَا __ تُحِيـطُ بِالْحَـدِّ لَا تُبْقِـي وَلَا تَـذَرُX
Fلَا غَايَةً وَانْتِهَاءً يَـا عَظِيـمُ لَهَا __ وَلَا لَهَا أَمَـدٌ يُقْضَىٰ فَيُـعْتَبَرُX
Fوَعَـدَّ أَضْعَافِ مَا قَدْ مَرَّ مِنْ عَدَدٍ __ مَعْ ضِعْفِ أَضْعَافِهِ يَا مَنْ لَهُ الْقَدَرُX
Fكَمَا تُحِبُّ وَتَرْضَىٰ سَيِّدي وَكَمَا __ أَمَرْتَنا أَنْ نُصَلِّي أَنْـتَ مُقْتَدِرُX
Fمَـعَ السَّـلامِ كَمَا قَدْ مَرَّ مِنْ عَدَدٍ __ رَبِّ وَضَاعِفْهُمَا وَالْفَضْلُ مُنْتَشِـرُX
Fوَكُـلُّ ذَلِكَ مَضْرُوبٌ بِحَقِّـكَ فِي __ أَنْفاسِ خَلْقِكَ إِنْ قَلُّـواْ وَإِنْ كَثُرُواْX
Fيَـا رَبِّ وَاغْفِـرْ لِقَارِيهَـا وَسَامِعِهَا __ وَالمُسْلِمينَ جَمِيعًا أَيْنَمَا حَضَرُواْX
Fوَوَالِـدِينَــا وَأَهْلِينـَا وَجِيرَتِنـَا __ وَكُلُّنـَا سَيِّـدي لِلْعَفْـوِ مُفْتَقـِرُX
Fوَقَـدْ أَتَيْــتُ ذُنُـوبًا لَا عِدَادَ لَهَا __ لَكِـنَّ عَفْـوَكَ لَا يُبْقِـي وَلَا يَذَرُX
Fوَالْهَمُّ عَـنْ كُلِّ مَـا أَبْغِيـهِ أَشْغَلَنِي __ وَقَـدْ أَتَىٰ خَاضِعًا وَالْقَلْبُ مُنْكَسِرُX
Fأَرْجوكَ يَا رَبِّ فِي الدَّارَيْنِ تَرْحَمُنَا __ بِجَاهِ مَنْ فِي يَدَيْـهِ سَبَّحَ الْحَجَرُX
Fيَـا رَبِّ أَعْظِـمْ لَنـا أَجْـرًا وَمَغْفِرَةً __ فَإِنَّ جُودَكَ بَحْرٌ لَيْسَ يَنْحَصِرُX
Fوَاقْضِ دُيُـونًا لَهَـا الْأَخْلاقُ ضائِقَةٌ __ وَفَرِّجِ الْكَرْبَ عَنَّا أَنْت مُقْتَـدِرُX
Fوَكُنْ لَطيفًا بِنَا فِـي كُـلِّ نـازِلَةٍ __ لُطْفًا جَمِيلًا بِـهِ الْأَهْوالُ تَنْحَسِرُX
Fبِالْمُصْطَفَىٰ الْمُجْتَبَىٰ خَيْرُ الْأَنامِ وَمَنْ __ جَلَالَةً نَزَلَتْ فِي مَـدْحِهِ السُّوَرُX
Fثُمَّ الصَّلَاةُ عَلَىٰ الْمُخْتَارِ مَا طَلَعَتْ __ شَمْسُ النَّهَارِ وَمَا قَدْ شَعْشَعَ الْقَمَرُX
Fثُمَّ الرِّضَا عَنْ أَبـي بَكْـرٍ خَلِيفَتِـهِ __ مَنْ قَامَ مِنْ بَعْـدِهِ للدِّينِ يَنْتَصِـرُX
Fوعَنْ أَبي حَفْصٍ الْفَارُوقِ صَاحِبِهِ __ مَنْ قَـوْلُهُ الْفَصْلُ فِي أَحْكَامِهِ عُمَرُX
Fوَجُدْ لِعُثْمانَ ذِي النُّورَينِ مَنْ كَمُلَتْ __ لَهُ الْمَحَاسِـنُ فِي الدَّارَيْنِ وَالظَّفَرُX
Fكَذَا عَلِـيٌّ مَـعَ ابْنَيْـهِ وَأُمِّهِمَـا __ أَهْلُ الْعَبَاءِ كَمَا قَدْ جَاءَنَا الْخَبَرُX
Fسَعْدٌ سَعيْدُ بْنُ عَوفٍ طَلْحَةٌ وَأَبُو __ عُبَـيْـدَةٍ وَزُبـَيـْرٌ سَادَةٌ غـُرَرُX
Fوَحَمْزَةٌ وَكَذَا الْعَبَّاسُ سَيِّدُنَـا __ وَنَجْلُهُ الْحَبْرُ مَنْ زَالَتْ بِـهِ الْغِيَرُX
Fوَاْلآلُ وَالصَّحْبُ وَالْأَتْبَاعُ قَـاطِبَةً __ مَا جَنَّ لَيْلُ الدَّياجِي أَو بَدَا السَّحَرُX
''');

const poemMohamadia = Zikr(
    title: 'القصيدة المحمدية',
    url:
        "https://ia801308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%82%D8%B5%D9%8A%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D8%AD%D9%85%D8%AF%D9%8A%D8%A9.mp3",
    notes: '''
القصيدة المحمدية للإمام البوصيري رضي الله عنه

تقراً جماعة صباح الجمعة بمسجد الأشراف
  ''',
    content: '''
Fمُحَمَّدٌ أَشْـرَفُ الْأَعْرَابِ وَالْعَجَمِ __ مُحَمَّدٌ خَيْرُ مَنْ يَمْشِي عَلَىٰ قَدَمِX
Fمُحَمَّدٌ بَــاسِـطُ الْمَعْرُوفِ جَامِعُهُ __ مُحَمَّدٌ صَاحِبُ الْإِحْسَانِ وَالْكَرَمِX
Fمُحَمَّدٌ تَــــاجُ رُسْلِ اللّٰهِ قَاطِبَةً __ مُحَمَّدٌ صَــادِقُ الْأَقْوَالِ وَالْكَلِمِX
Fمُحَمَّدٌ ثَــــابِتُ الْمِيْثَاقِ حَافِظُهُ __ مُحَمَّدٌ طَيـِّـبُ الْأَخْلاَقِ وَالشِّيَمِX
Fمُحَمَّدٌ رُوِيَتْ بِالنُّــــورِ طِينَتُـهُ __ مُحَمَّدٌ لَمْ يَـزَلْ نُــورًا مِنَ الْقِدَمِX
Fمُحَمَّدٌ حَاكِمٌ بِالْعَدْلِ ذُو شَرَفٍ __ مُحَمَّدٌ مَعْدِنُ الْإِنْعَــــامِ وَالْحِكَمِX
Fمُحَمَّدٌ خَيْرُ خَلْقِ اللّٰهِ مِنْ مُضَـرٍ __ مُحَمَّدٌ خَيْرُ رُسْـــلِ اللّٰهِ كُلِّهِمِX
Fمُحَمَّدٌ دِينُــهُ حَــقٌ نَدِيــنُ بِـهِ __ مُحَمَّدٌ مُجْمِلًا حَقَّـــاً عَلَىٰ عَلَمِX
Fمُحَمَّدٌ ذِكْرُهُ رَوْحٌ لِأَنْفُسِـــنَــا __ مُحَمَّدٌ شُكْـرُهُ فَرْضٌ عَلَىٰ الْأُمَمِX
Fمُحَمَّدٌ زِينَةُ الدُّنْيَــــا وَبَهْجَتُهَا __ مُحَمَّدٌ كَاشِفُ الْغُمَّــاتِ وَالظُّلَمِX
Fمُحَمَّدٌ سَيِّـدٌ طَــــابَتْ مَنَاقِبُـهُ __ مُحَمَّدٌ صَـاغَهُ الرَّحْمَنُ بِالنِّعَـمِX
Fمُحَمَّدٌ صَفْـوَةُ الْبَارِي وَخِيرَتُهُ __ مُحَمَّدٌ طَــاهِرٌ مِن سَائِرِ التُّهَمِX
Fمُحَمَّدٌ ضَاحِكٌ لِلضَّيْفِ مُكْرِمُهُ __ مُحَمَّدٌ جَـــارُهُ وَاللّٰهِ لَمْ يُضَـمِX
Fمُحَمَّدٌ طَابَتِ الدُّنْيَا بِبَعْثَتِــــهِ __ مُحَمَّدٌ جَــاءَ بِالْآيَاتِ وَالْحِكَمِX
Fمُحَمَّدٌ يَوْمَ بَعْثِ النَّاسِ شَافِعُنَا __ مُحَمَّدٌ نُوْرُهُ الْهَادِي مِنَ الظُّلَمِX
Fمُحَمَّدٌ قَـــائـِمٌ للّٰهِ ذُو هِمَمٍ __ مُحَمَّدٌ خَــاتَـمٌ لِلرُّسْـلِ كُلِّهِـمِX
''');

const poemBordaBosiri = Zikr(
    title: 'بردة الإمام البوصيري',
    notes: '''
بردة الإمام البوصيري رضي الله عنه

تقرأ جماعةً صباح الخميس
  ''',
    url:
        'https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A8%D8%B1%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D8%AF%D9%8A%D8%AD.mp3',
    content: '''
## الفصل الأول (في الغزل وشكوى الغرام)
Fأَمِـنْ تَــذَكُّرِ جِـيرَانٍ بــِذِي سَـلَمِ __ مَزَجْتَ دَمْعًـا جَـرَىٰ مِنْ مُقلَةٍ بِدَمِX
Fأَمْ هَبَّـتِ الرِّيحُ مِـنْ تِلْقَـاءِ كَاظِمَةٍ __ وَأوْمَضَ البَرْقُ فِي الظَّلْمَاءِ مِنْ إِضَمِX
Fفـَمَا لِعَيْنـَيْـكَ إِنْ قُلْتَ اكْفُفَـا هَمَـتَا __ وَمَـا لِقَلْبِكَ إِنْ قُـلْتَ اسْـتَفِقْ يَهِـمِX
Fأَيَحْسَــبُ الصَّبُّ أَنَّ الْحُبَّ مُنكَتِـمٌ __ مَا بَيْـنَ مُنْسَـجِمٍ مِنْهُ وَمُضـطَّـرِمِX
Fلَوْلَا الْهَوَىٰ لَمْ تُرِقْ دَمْعًــا عَلَىٰ طَلَلٍ __ وَلَا أَرِقْـتَ لِــذِكْرِ الْبَـانِ وَالْعَـلَمِX
Fفَكَيْفَ تُنْكِـرُ حُبًّا بَعْدَ مَـا شَـهِدَتْ __ بِـهِ عَلَيْـكَ عُدُولُ الدَّمْـعِ وَالسَّـقَمِX
Fوَأَثْبـَتَ الْوَجْدُ خَطَّيْ عَبْـرَةٍ وَضَنًى __ مِثْـلَ الْبَهَـارِ عَلَىٰ خَدَّيْـكَ وَالْعَنَـمِX
Fنَعَمْ سَـرَىٰ طَيْفُ مَنْ أَهْوَىٰ فَأَرَّقَنِي __ وَالْحُـبُّ يَعْتَـرِضُ اللَّـذَّاتِ بِالْأَلَـمِX
Fيَا لَائِمِي فِي الْهَوَىٰ الْعُذْرِيِّ مَعْـذِرَةً __ مِنِّـي إِلَيْـكَ وَلَوْ أَنْصَفْـتَ لَمْ تَلُـمِX
Fعَدَتْـكَ حَـالِيَ لَا سِـرِّي بِمُسْـتَتِـرٍ __ عَـنِ الوُشَـاةِ وَلَا دَائِي بِمُنْحَسِــمِX
Fمَحَضَّتَنِي النُّصْحَ لَكِنْ لَسْتُ أَسْمَعُهُ __ إِنَّ المُحِـبَّ عَنِ العُـذَّالِ فِي صَمَـمِX
Fإِنِّي اتَّهَمْتُ نَصِيحَ الشَّـيْبِ فِي عَذَلٍ __ وَالشَّـيْبُ أَبْعَـدُ فِي نُصْحٍ عَنِ التُّهَمِX

## الفصل الثاني (في التحذير من هوى النفس)
Fفَإِنَّ أَمَّارَتِي بِالسُّوءِ مَا اتَّعَظَتْ __ مِنْ جَهْلِهَا بِنَذير الشَّيْبِ وَالْهَرَمِX
Fوَلَا أَعَدَّتْ مِنَ الفِعْلِ الجَمِيلِ قِرَى __ ضَيْفٍ أَلَمَّ بِرَأسِي غَيْرَ مُحْتَشِمِX
Fلَوْ كُنـتُ أَعلَمُ أَنِّي مَـا أُوَقِّـرُهُ __ كَتَمْتُ سِـرًّا بَـدَا لِي مِنْهُ بِالْكَتِمِX
Fمَن لِّي بِرَدِّ جِمَاحٍ مِنْ غَوَايَتِهَا __ كَمَا يُرَدُّ جِمَاحُ الخَيْلِ باللُّجُمِX
Fفَلَا تَـرُمْ بِالْمَعَاصِي كَسْـرَ شَهْوَتِهَا __ إِنَّ الطَّعَامَ يُقَـوِّي شَهْوَةَ النَّهِمِX
Fوَالنَّفْسُ كَالطِّفْلِ إِنْ تُهمِلْهُ شَبَّ عَلَىٰ __ حُبِّ الرَّضَاعِ وَإِنْ تَفْطِمْهُ يَنفَطِمِX
Fفَاصْرِفْ هَوَاهَا وَحَاذِرْ أَن تُوَلِّيَهُ __ إِنَّ الهَوَىٰ مَا تَوَلَّىٰ يُصْمِ أَو يَصِمِX
Fوَرَاعِهَا وَهْـيَ في الأَعمَالِ سَائِمَةٌ __ وَإِنْ هِـيَ اسْتَحْلَتِ المَرْعَىٰ فَلَا تُسِمِX
Fكَمْ حَسَّـنَتْ لَذَّةً لِلْمَرْءِ قَاتِلَةً __ مِنْ حَيْثُ لَمْ يَدْرِ أَنَّ السُّمَّ فِيِ الدَّسَمِX
Fواخْشَ الدَّسَائِسَ مِن جُوعٍ وَمِن شِبَعٍ __ فَرُبَّ مَخْمَصَةٍ شَـرٌّ مـِنَ التُّخَمِX
Fوَاستَفْرِغِ الدَّمْعَ مِنْ عَيْنٍ قَـدِ امْتَلَأَتْ __ مِنَ المَحَارِمِ وَالْزَمْ حِمْيَـةَ النَّدَمِX
Fوَخَالِفِ النَّفْسَ وَالشَّيْطَانَ وَاعْصِهِمَا __ وَإِنْ هُمَا مَحَضَاكَ النُّصْحَ فَاتَّهِمِX
Fوَلَا تُطِعْ مِنْهُمَا خَصْمًا وَلَا حَكَمًا __ فَأَنتَ تَعْرِفُ كَيْـدَ الخَصْمِ وَالْحَكَمِX
Fأَسْتَغْفِـرُ اللّٰهَ مِـن قَوْلٍ بِلَا عَمَلٍ __ لَقَـدْ نَسَبْتُ بِـهِ نَسْلًا لِذِي عُقُمِX
Fأَمَرْتُـكَ الخَيْرَ لَكِنْ مَا ائْتَمَرْتُ بِهِ __ وَمَا اسْتَقَمْتُ فَمَا قَوْلِيِ لَكَ اسْتَقِمِX
Fوَلَا تَـزَوَّدتُّ قَبْـلَ الْمَـوْتِ نَـافِلَـةً __ وَلَمْ أُصَلِّ سِوَىٰ فَرْضٍ وَلَمْ أَصُـمِX
## الفصل الثالث (في مدح النبي صلى الله عليه وسلم)
Fظَلَمْتُ سُنَّةَ مَنْ أَحْيَا الظَّلَامَ إِلَىٰ __ أَنِ اشْتَكَتْ قَـدَمَاهُ الضُّرَّ مِن وَرَمِX
Fوَشَدَّ مِنْ سَغَبٍ أَحْشَاءَهُ وَطَوَىٰ __ تَحْتَ الْحِجَارَةِ كَشْحًا مُتْرَفَ الْأَدَمِX
Fوَرَاوَدَتْهُ الْجِبَالُ الشُّمُّ مِن ذَهَبٍ __ عَـن نَّفْسِـهِ فَأَرَاهَا أَيَّمَا شَمَمِX
Fوَأَكَّدَتْ زُهْدَهُ فِيهَا ضَرُورَتُهُ __ إِنَّ الضَّرُورَةَ لَا تَعْدُو عَلَىٰ الْعِصَمِX
Fوَكَيْفَ تَدْعُو إِلَىٰ الدُّنَيْا ضَرُورَةُ مَن __ لَّوْلَاهُ لَمْ تُخْرَجِ الدُّنْيَا مِـنَ الْعَدَمِX
Fمُحَمَّدٌ سَـيِّدُ الْكَوْنَينِ وَالثَّقَلَـيْـ __ ـنِ وَالْفَرِيقَـيْنِ مِـنْ عُرْبٍ وَمِنْ عَجَمِX
Fنَبِيُّنَـا الْآمِـرُ النَّاهِـي فَلَا أَحَدٌ __ أَبَـرَّ فِـي قَوْلِ لَا مِنْهُ وَلَا نَعَمِX
Fهُوَ الْحَبِيبُ الَّذِي تُرْجَىٰ شَفَاعَتُهُ __ لِكُلِّ هَوْلٍ مِنَ الْأَهْوَالِ مُقْتَحَمِX
Fدَعَا إِلَىٰ اللّٰهِ فَالْمُسْـتَمْسِكُونَ بِهِ __ مُسْتَمْسِكُونَ بِحَبْـلٍ غَيْرِ مُنْفَصِمِX
Fفَاقَ النَّبِيِّينَ فِي خَلْقٍ وَفِـي خُلُـقٍ __ وَلَـمْ يُـدَانُوهُ فِـي عِلْمٍ وَلَا كَرَمِX
Fوَكُلُّهُم مِّن رَّسُولِ اللّٰهِ مُلْتَمِـسٌ __ غَرْفًا مِنَ الْبَحْرِ أَوْ رَشْفًا مِنَ الدِّيَمِX
Fوَوَاقِفُونَ لَدَيْـهِ عِنـدَ حَدِّهِمِ __ مِن نُّقْطَةِ الْعِلْمِ أَوْ مِن شَكْلَةِ الْحِكَمِX
Fفَهْوَ الَّذِي تَمَّ مَعْنَاهُ وَصُورَتَـهُ __ ثُمَّ اصْطَفاهُ حَبِيبًا بَارِئُ النَّسَمِX
Fمُنَـزَّهٌ عَـن شَرِيكٍ فِـي مَحَاسِـنِهِ __ فَجَوْهَرُ الْحُسْـنِ فِيـهِ غَيْرُ مُنقَسِمِX
Fدَعْ مَـا ادَّعَتْهُ النَّصَارَىٰ فِي نَبِيِّهِمُ __ وَاحْكُمْ بِمَا شِئْتَ مَدْحًا فِيهِ وَاحْتَكِمِX
Fوَانْسُبْ إِلَىٰ ذَاتِهِ مَا شِئْتَ مِن شَرَفٍ __ وَانْسُبْ إِلَىٰ قَدْرِهِ مَا شِئْتَ مِنْ عِظَمِX
Fفَإِنَّ فَضْلَ رَسُولِ اللّٰهِ لَيْـسَ لَهُ __ حَـدٌّ فَيُعْـرِبَ عَنْـهُ نَاطِقٌ بِفَمِX
Fلَوْ نَـاسَـبَـتْ قَدْرَهُ آيَاتُهُ عِظَمًا __ أَحْيَا اسْمُهُ حِينَ يُدْعَىٰ دَارِسَ الرِّمَمِX
Fلَمْ يَمْتَحِنَّا بِمَا تَعْيَـا الْعُقُولُ بِـهِ __ حِرْصًا عَلَيْنَا فَلَمْ نَـرْتَـبْ وَلَمْ نَهِمِX
Fأَعْيَا الْوَرَىٰ فَهْمُ مَعْنَاهُ فَلَيْسَ يُرَىٰ __ فِي الْقُرْبِ وَالْبُعْدِ فِيهِ غَيْرُ مُنفَحِمِX
Fكَالشَّمْسِ تَظْهَرُ لِلْعَيْنَيْنِ مِن بُعُدٍ __ صَغِيرَةً وَتُكِلُّ الطَّرْفَ مِـنْ أَمَمِX
Fوَكَيْفَ يُدْرِكُ فِـي الدُّنْيَا حَقِيقَتَهُ __ قَوْمٌ نِيَامٌ تَسَلَّـوْا عَنْــهُ بِـالْحُلُمِX
Fفَمَبْلَغُ الْعِلْمِ فِيهِ أَنَّهُ بَشَرٌ __ وَأَنَّهُ خَيْرُ خَلْقِ اللّٰهِ كُلِّهِمِX
Fوَكُـلُّ آيٍ أَتَىٰ الرُّسْلُ الْكِـرَامُ بِهَا __ فَإِنَّمِـا اتَّصَلَتْ مِـن نُّورِهِ بِهِــمِX
Fفَـإِنَّهُ شَمْـسُ فَضْلٍ هُمْ كَـوَاكِبُهَا __ يُظْهِرْنَ أَنْـوَارَهَا لِلنَّـاسِ فِي الظُّلَمِX
Fأَكْرِمْ بِخَلْقِ نَبِيٍّ زَانَـهُ خُلُقٌ __ بِـالْحُسْـنِ مُشْـتَمِلٍ بِالْبِشْـرِ مُتَّسِمِX
Fكَالزَّهْرِ فِي تَرَفٍ وَالْبَدْرِ فِي شَرَفٍ __ وَالْبَحْرِ فِي كَرَمٍ والدَّهْرِ فِي هِمَمِX
Fكَأَنَّهُ وَهْوَ فَرْدٌ مِن جَلَالَتِهِ __ فِي عَسْـكَرٍ حِينَ تَلْقَاهُ وَفِي حَشَمِX
Fكَأَنَّمَا اللُّؤْلُؤُ الْمَكْنُونُ فِي صَدَفٍ __ مِنْ مَعْـدِنَيْ مَنْطِـقٍ مِّنْـهُ وَمُبْتَسَـمِX
Fلَا طِيبَ يَعْدِلُ تُرْبًا ضَمَّ أَعْظُمَـهُ __ طُـوبَىٰ لِمُنتَشِـقٍ مِنْـهُ وَمُلْتَثِمِX
## الفصل الرابع (في مولده عليه الصلاة والسلام)
Fأَبَانَ مَولِدُهُ عَن طِيـبِ عُنصُرِهِ __ يَـا طِيبَ مُبْتَـدَإٍ مِّنْـهُ وَمُخْتَتَمِX
Fيَــوْمٌ تَفَرَّسَ فِيــهِ الْفُـرْسُ أَنَّهُـمُ __ قَـدْ أُنـذِرُواْ بِحُلُولِ الْبُؤْسِ وَالنِّقَمِX
Fوَبَـاتَ إِيوَانُ كِسْرَىٰ وَهْوَ مُنْصَدِعٌ __ كَشَمْلِ أَصْحَابِ كِسْـرَىٰ غَيْرَ مُلْتَئِمِX
Fوَالنَّارُ خَامِدَةُ الْأَنفَاسِ مِنْ أَسَفٍ عَلَيْهِ __ وَالنَّهْرُ سَاهِـي الْعَيْنِ مِن سَدَمِX
Fوَسَاءَ سَاوَةَ أَنْ غَاضَتْ بُحَيْرَتُهَـا __ وَرُدَّ وَارِدُهَـا بِالْغَيْـظِ حِيـنَ ظَمِيX
Fكَأَنَّ بِالنَّارِ مَا بِالْمَاءِ مِـن بَلَلٍ __ حُزْنًا وَبِالْمَاءِ مَا بِالنَّارِ مِنْ ضَرَمِX
Fوَالْجِنُّ تَهْتِفُ وَالْأَنْوَارُ سَاطِعَةٌ __ وَالْحَقُّ يَظْهَرُ مِن مَّعْنَىً وَمِن كَلِمِX
Fعَمُواْ وَصَمُّـواْ فَإِعْلَانُ الْبَشَائِرِ لَمْ __ تُسْمَعْ وَبَارِقَةُ الْإِنذَارِ لَمْ تُشَمِX
Fمِن بَعْـدِ مَا أَخْبَرَ الْأَقْوَامَ كَاهِنُهُمْ __ بِأَنَّ دِيـنَهُـمُ الْمُعْـوَجَّ لَـمْ يَقُمِX
Fوَبَعْدَ مَا عَايَنُواْ فِي الْأُفْقِ مِن شُهُبٍ __ مُنْقَضَّةٍ وَفْقَ مَا فِي الْأَرضِ مِن صَنَمِX
Fحَتَّىٰ غَدَا عَن طَرِيقِ الْوَحْيِ مُنهَزِمٌ __ مِنَ الشَّيِاطِينِ يَقْفُو إِثْرَ مُنْهَزِمِX
Fكَأَنَّهُـمْ هَرَبًا أَبْطَالُ أَبْـرَهَةٍ __ أَوْ عَسْكَرٌ بِالْحَصَىٰ مِن رَّاحَتَيْهِ رُمِيX
Fنَبْـذًا بِـهِ بَعْدَ تَسْـبِيحٍ بِبـطْنِهِمَا __ نَبْـذَ الْمُسَبِّحِ مِـنْ أَحْشَـاءِ مُلْتَقِـمِ X
## الفصل الخامس (في معجزاته صلى الله عليه وسلم)
Fجَاءَتْ لِدَعْوَتِهِ الْأَشْـجَارُ سَاجِدَةً __ تَمْشِـي إِلَيْهِ عَلَىٰ سَـاقٍ بِــلَا قَـدَمِX
Fكَـأَنَّمَا سَطَرَتْ سَطْـرًا لِمَا كَتَبَـتْ __ فُرُوعُهَا مِن بَـدِيعِ الْخَـطِّ بِاللَّـقَـمِX
Fمِثْـلَ الْغَمَامَةِ أَنَّـىٰ سَـارَ سـَائِـرَةً __ تَقِيـهِ حَـرَّ وَطِيـسٍ لِلْهَجِـيرِ حَمِيX
Fأَقْسَمْتُ بِالْقَمَرِ الْمُنشـَقِّ إِنَّ لَه __  مِن قَلْبِهِ نِسْبَةً مَبْرُورَةَ الْقَسَــمِX
Fوَمَا حَوَىٰ الْغَارُ مِنْ خَيْرٍ وَمِن كَرَمٍ __ وَكُـلُّ طَرْفٍ مِنَ الْكُفَّارِ عَنْهُ عَمِـيX
Fفَالصِّدقُ فِي الْغَارِ وَالصِّدِّيقُ لَمْ يَرِمَا __ وَهُمْ يَقُولُونَ مَا بِالْغَارِ مِنْ أَرِمِX
Fظَنُّواْ الْحَمَامَ وَظَنُّواْ الْعَنكَبُوتَ عَلَىٰ __ خَـيْرِ البَرِيَّـةِ لَمْ تَنسُـجْ وَلَمْ تَحُـمِX
Fوِقَايَـةُ اللّٰهِ أَغْنَتْ عَن مُّضَاعَفَةٍ __ مِنَ الدُّرُوعِ وَعَنْ عَالٍ مِنَ الْأُطُمِX
Fمَا سَامَنِي الدَّهْرُ ضَيْمًا وَاسْتَجَرْتُ بِهِ __ إِلَّا وَنِــلْتُ جِـوَارًا مِـنْهُ لَمْ يُضَمِX
Fوَلَا الْتَمَسـْتُ غِنَىٰ الدَّارَيْنِ مِن يَدِهِ __ إِلَّا اسْتَلَمتُ النَّدَىٰ مِنْ خَيْرِ مُسْتَلَمِX
Fلَا تُنكِـرِ الْوَحْـيَ مِـن رُّؤْيَـاهُ إِنَّ لَـهُ __ قَلْبًا إِذَا نَامَـتِ الْعَيْنَانِ لَـمْ يَنَمِX
Fوَذَاكَ حِيـنَ بُلُوغٍ مِـن نُّبُـوَّتِـهِ __ فَلَيْـسَ يُنكَرُ فِيهِ حَالُ مُحْتَلِمِX
Fتَبَارَكَ اللّٰهُ مَـا وَحْيٌ بِمُكتَسَـبٍ __ وَلَا نَـبِيٌّ عَلَىٰ غَيْــبٍ بِمُتَّـهَـمِX
Fكَمْ أَبْرَأَتْ وَصِبًا بِاللَّمْسِ رَاحَتُـهُ __ وَأَطْلَقَـتْ أَرِبًا مِـن رِّبْقَةِ اللَّمَمِX
Fوَأَحْيَـتِ السَّـنَةَ الشَّهْبَـاءَ دَعْوَتُـهُ __ حَتَّىٰ حَكَتْ غُرَّةً فِي الْأَعْصُرِ الدُّهُمِX
Fبِعَارِضٍ جَادَ أَوْ خِلْتُ الْبِطَاحَ بِهَـا __ سَـيْبٌ مِنَ الْيَمِّ أَوْ سَـيْلٌ مِنَ الْعَرِمِ X
## الفصل السادس (في شرف القرآن ومدحه صلى الله عليه وسلم)
Fدَعْنِـي وَوَصْفِـيَ آيَـاتٍ لَـهُ ظَهَرَتْ __ ظُهُورَ نَـارِ الْقِرَىٰ لَيْـلًا عَلَـىٰ عَلَمِX
Fفَالدُّرُّ يَـزْدَادُ حُسْنًـا وَهْـوَ مُنتَظِمٌ __ وَلَيْسَ يَـنقُصُ قَـدْرًا غَيْـرَ مُنتَظِـمِX
Fفَمَــا تَطَــاوُلُ آمَـالِ الْمَدِيـحِ إِلَـىٰ __ مَا فِـيـهِ مِـن كَرَمِ الْأَخْلَاقِ وَالشِّيَمِX
Fآيَاتُ حَقٍّ مِنَ الرَّحْمَنِ مُحْدَثَةٌ __ قَدِيمَـةٌ صِفَةُ الْمَوْصُوفِ بِالْقِدَمِX
Fلَمْ تَقْتَرِنْ بِزَمَانٍ وَهْيَ تُخْبِرُنَا __ عَنِ الْمَعَادِ وَعَنْ عَادٍ وَعَنْ إِرَمِX
Fدَامَتْ لَدَيْنَـا فَفَاقَتْ كُــلَّ مُعْجِزَةٍ __ مِـنَ النَّبِيِّيـنَ إِذْ جَاءَتْ وَلَمْ تَــدُمِX
Fمُحَكَّمَاتٌ فَمَا تُبْقِـينَ مِـن شُـبَهٍ __ لِـذِي شِقَاقٍ وَمَا تَبغِينَ مِنْ حَكَمِX
Fمَا حُورِبَتْ قَطُّ إِلَّا عَادَ مِنْ حَرَبٍ __ أَعْدَىٰ الْأَعَادِي إِلَيْهَا مُلْقِي السَّلَـمِX
Fرَدَّتْ بَلَاغَتُهَا دَعْـوَىٰ مُعَارِضِهَا __ رَدَّ الْغَيـُورِ يَـدَ الْجَانِي عَنِ الْحُرَمِX
Fلَهَـا مَعَانٍ كَمَوْجِ الْبَحْرِ فِي مَـدَدٍ __ وَفَـوْقَ جَوْهَرِهِ فِـي الْحُسْنِ وَالْقِيَمِX
Fفَمَا تُعَـدُّ وَلَا تُحْصَىٰ عَجَـائِبُهَـا __ وَلَا تُسَـامُ عَلَىٰ الْإِكْثَارِ بِالسَّـأَمِX
Fقَرَّتْ بِهَا عَيْنُ قَارِيهَا فَقُلْتُ لَـهُ __ لَقَدْ ظَفِرْتَ بِحَبْـلِ اللّٰهِ فَـاعْتَصِمِX
Fإِنْ تَتْلُهَا خِيفَةً مِنْ حَرِّ نَارِ لَظَىٰ __ أَطْفَأْتَ حَرَّ لَظَىٰ مِنْ وِرْدِهَا الشَّبِمِX
Fكَـأَنَّهَـا الْحَوْضُ تَبْيَضُّ الْوُجُوهُ بِـهِ __ مِنَ الْعُصَاةِ وَقَـدْ جَاءُوهُ كَالْحُمَمِX
Fوَكَـالصِّـرَاطِ وَكَـالْمِيـزَانِ مَعْدَلَــةً __ فَالْقِسْطُ مِنْ غَيْرِهَا فِي النَّاسِ لَمْ يَقُمِX
Fلَا تَعْجَبَـنْ لِحَسُـودٍ رَاحَ يُنكِـرُهَـا __ تَجَاهُلًا وَهْـوَ عَـيْنُ الْحَاذِقِ الْفَهِمِX
Fقَدْ تُنكِرُ الْعَيْنُ ضَوْءَ الشَّمْسِ مِن رَّمَدٍ __ وَيُنكِرُ الْفَمُ طَعْمَ الْمَاءِ مِن سَقَمِ X
## الفصل السابع (في إسرائه ومعراجه صلى الله عليه وسلم)
Fيَا خَيْرَ مَنْ يَمَّمَ الْعَافُونَ سَاحَتَهُ __ سَعْيًا وَفَوْقَ مُتُونِ الْأَيْنُقِ الرُّسُـمِX
Fوَمَنْ هُوَ الْآيَـةُ الْكُبْرَىٰ لِمُعْتَبِرٍ __ وَمَنْ هُـوَ النِّعْمَةُ الْعُظْمَىٰ لـِمُغْتَنِمِX
Fسَرَيْتَ مِنْ حَرَمٍ لَيْـلًا إِلَىٰ حَرَمٍ __ كَمَا سَرَىٰ الْبَدْرُ فِي دَاجٍ مِنَ الظُّلَمِX
Fوَبِتَّ تَرْقَىٰ إِلَىٰ أَن نِّلْتَ مَنزِلَـةً __ مِنْ قَابِ قَوْسَيْنِ لَمْ تُدْرَكْ وَلَمْ تُرَمِX
Fوَقَدَّمَتْكَ جَمِيعُ الْأَنبِيَاءِ بِهَا __ وَالرُّسْلِ تَقْدِيمَ مَـخدُومٍ عَلَىٰ خَـدَمِX
Fوَأَنتَ تَخْتَرِقُ السَّـبْعَ الطِّبَاقَ بِهِمْ __ فِي مَوْكِبٍ كُنتَ فِيهِ صَاحِبَ الْعَلَمِX
Fحَتَّىٰ إِذَا لَمْ تَدَعْ شَــأْوًا لِمُسْــتَبِقٍ __ مِـنَ الـدُّنُوِّ وَلَا مَرْقَىً لِمُسْتَنِمِX
Fخَفَضتَّ كُلَّ مَقَامٍ بِالْإِضَـافَةِ إِذْ __ نُودِيتَ بِالرَّفْعِ مِثْلَ الْمُفْرَدِ الْعَلَمِX
Fكَيْمَا تَفُوزَ بِوَصْلٍ أَيِّ مُسْتَتِرٍ __ عَـنِ الْعُيُونِ وَسِـرٍّ أَيِّ مُكْتَتَمِX
Fفَحُزْتَ كُـلَّ فَخَـارٍ غَيْـرَ مُشْـتَرَكٍ __ وَجُزْتَ كُـلَّ مَقَـامٍ غَيْـرَ مُـزْدَحَمِX
Fوَجَلَّ مِقْدَارُ مَا وُلِّيتَ مِن رُّتَب __ وَعَزَّ إِدْرَاكُ مَا أُولِيتَ مِن نِّعَمِX
Fبُشْرَىٰ لَنَا مَعْشَرَ الْإِسْـلَامِ إِنَّ لَنَا __ مِـنَ الْعِنَايَـةِ رُكْنًا غَيْرَ مُنْهَدِمِX
Fلَمَّـا دَعَا اللّٰهُ دَاعِينَا لِطَاعَتِهِ __ بِأَكْرَمِ الرُّسْلِ كُنَّا أَكْرَمَ الْأُمَمِ X
## الفصل الثامن (في جهاد النبي صلى الله عليه وسلم)
Fرَاعَـتْ قُلُوبَ الْعِـدَا أَنبَـاءُ بِعْثَتِهِ __ كَنَبْأَةٍ أَجْفَلَتْ غُفْـلًا مِـنَ الْغَنَــمِX
Fمَـا زَالَ يَلْقَاهُمُ فِـي كُلِّ مُعْتَـرَكٍ __ حَتَّىٰ حَكَوْا بِالْقَنَا لَـحْمًا عَلَىٰ وَضَمِX
Fوَدُّواْ الْفِـرَارَ فَكَـادُواْ يَغْبِطُـونَ بِـهِ __ أَشْلَاءَ شَالَتْ مَعَ الْعِقْبَانِ وَالرَّخَمِX
Fتَمْضِي اللَّيَالِـي وَلَا يَدْرُونَ عِدَّتَهَـا __ مَا لَم تَكُن مِنْ لَيَـالِي الأَشهُرِ الحُـرُمِX
Fكَأَنَّمَا الدِّينُ ضَيْفٌ حَلَّ ساحَتَهُمْ __ بِكُلِّ قَرْمٍ إِلَـىٰ لَحْمِ العِـدَا قَرِمِX
Fيَجُــرُّ بَحْـرَ خَمِيسٍ فَـوْقَ سَابِحَـةٍ __ يَرْمِي بِمَوْجٍ مِنَ الْأَبْطَـالِ مُلْتَـطِمِX
Fمِـن كُـلِّ مُنـتَـدِبٍ لِلّٰهِ مُحْتَسِــبٍ __ يَسْطُـو بِمُسْتَأْصِلٍ لِلْكُفْرِ مُصْطَلِمِX
Fحَتَّىٰ غَدَتْ مِلَّةُ الْإِسْلَامِ وَهْيَ بِهمْ __ مِن بَعْـدِ غُرْبَتِهَا مَوْصُولَةَ الرَّحِـمِX
Fمَكْفُولَـةً أَبَـدًا مِنْهُـم بِـخَيْـرِ أَبٍ __ وَخَيْرِ بَعْلٍ فَلَمْ تَيْتَمْ وَلَمْ تَئِمِX
Fهُمُ الْجِبَـالُ فَسَـلْ عَنْهُمْ مُصَادِمَهُمْ __ مَـاذَا رَأَىٰ مِنْهُمُ فِـي كُلِّ مُصْطَـدِمِX
Fوَسَلْ حُنَيْنًا وَسَلْ بَدْرًا وَسَلْ أُحُدًا __ فُصُولُ حَتْفٍ لَّهُمْ أَدْهَىٰ مِنَ الْوَخَمِX
Fالْمُصْدِرِي الْبِيضِ حُمْرًا بَعْدَمَا وَرَدَتْ __ مِـنَ الْعِـدَا كُلَّ مُسْوَدٍّ مِـنَ الِّلمَمِX
Fوَالْكَـاتِبِينَ بِسُمْرِ الْخَطِّ مَـا تَـرَكَتْ __ أَقْلَامُهُمْ حَرْفَ جِسْمٍ غَيْـرَ مُنْعَجِـمِX
Fشَاكِـي السِّـلَاحِ لَـهُـمْ سِيمَا تُمَيِّزُهُمْ __ وَالْوَرْدُ يَمْتَـازُ بِالسِّيمَا عَـنِ السَّلَـمِX
Fتُهْـدِي إِلَيْكَ رِيَاحُ النَّصْـرِ نَشْرَهُمُ __ فَتَحْسَبُ الزَّهْرَ فِي الْأَكْمَامِ كُلَّ كَمِـيX
Fكَأَنَّهُمْ فِي ظُهُورِ الْخَيْلِ نَبْتُ رُبـًا __ مِـن شِدَّةِ الْحَزْمِ لَا مِن شَدَّةِ الحُزُمِX
Fطَارَتْ قُلُوبُ الْعِدَا مِن بَأْسِهِمْ فَرَقًا __ فَمَا تُـفَـرِّقُ بَيْـنَ الْبَهْـمِ وَالْبُهَـمِX
Fوَمَن تَكُن بِرَسُولِ اللّٰهِ نُصْرَتُهُ __ إِن تَلْقَـهُ الْأُسْدُ فِـي آجَامِهَا تَجِـمِX
Fوَلَن تَرَىٰ مِن وَلِيٍّ غَيْـرِ مُنْتَصِــرٍ __ بِـهِ وَلَا مِنْ عَدُوٍّ غَـيْـرِ مُنقَصِمِX
Fأَحَلَّ أُمَّتَــهُ فِي حِرْزِ مِلَّتِهِ __ كَاللَّيْثِ حَلَّ مَعَ الْأَشْبَالِ فِي أَجَـمِX
Fكَـمْ جَدَّلَتْ كَـلِمَـاتُ اللّٰهِ مِن جَدِلٍ __ فِيـهِ وَكَمْ خَصَمَ الْبُرْهَانُ مِنْ خَصِمِX
Fكَفَاكَ بِـالعِلْمِ فِـي الْأُمِّـيِّ مُعْجِزَةً __ فِـي الْجاهِلِيَّةِ وَالتَّأْدِيبِ فِي الْيُتُمِ X
## الفصل التاسع (في التوسل بالنبي صلى الله عليه وسلم)
Fخَدَمْتُــهُ بِمَدِيـحٍ أَسْـتَقِيـلُ بِــهِ __ ذُنُوبَ عُمْرٍ مَضَىٰ فِي الشِّعرِ وَالْخِدَمِX
Fإِذْ قَـلَّدَانِـيَ مَـا تُخْشَـىٰ عَـوَاقِبُـهُ __ كأَنَّنِي بِهِمَا هَـدْيٌ مِنَ النَّعَمِX
Fأَطَعْتُ غَيَّ الصِّبَا فِي الْحَالَتَيْنِ وَمَا __ حَصَلْتُ إِلَّا عَلَىٰ الْآثَامِ وَالنَّدَمِX
Fفَيَا خَسَارَةَ نَفْسٍ فِي تِجَارَتِهَا __ لَمْ تَشْتَـرِ الدِّيـنَ بِالدُّنْيَـا وَلَمْ تَسُـمِX
Fوَمَن يَبِـعْ آجِلًا مِنْـهُ بِعَاجِلِهِ __ يَبِن لَّهُ الْغَبْنُ فِي بَيْعٍ وَفِـي سَلَمِX
Fإِنْ آتِ ذَنْبًا فَمَا عَهْدِي بِمُنتَقِضٍ __ مِـنَ النَّبِيِّ وَلَا حَبْلِـي بِمُنصَــرِمِX
Fفَإِنَّ لِي ذِمَّةً مِنْـهُ بِتَسمِيَتِي __ مُحَمَّدًا وَهْوَ أَوْفَىٰ الْخَلْقِ بِالذِّمَمِX
Fإِنْ لَمْ يَكُن فِي مَعَادِي آخِذًا بِيَدِي __ فَضْـلًا وَإِلَّا فَقُـلْ يَـا زَلَّـةَ الْقَـدَمِX
Fحَاشَـاهُ أَنْ يَحْرِمَ الرَّاجِـي مَكَارِمَهُ __ أَوْ يَرْجِعَ الْجَارُ مِنْـهُ غَيْـرَ مُحْتَرَمِX
Fوَمُنذُ أَلْزَمْتُ أَفْكَارِي مَدَائِحَهُ __ وَجَدتُّـهُ لِخَـلَاصِي خَــيْـرَ مُلْتَزِمِX
Fوَلَن يَفُوتَ الْغِنَىٰ مِنْهُ يَــدًا تَرِبَتْ __ إِنَّ الْحَيَا يُنْبِتُ الْأَزْهَارَ فِي الْأَكَمِX
Fوَلَمْ أُرِدْ زَهْرَةَ الدُّنْيَا الَّتِي اقْتَطَفَـتْ __ يَدَا زُهَيْـرٍ بِمَا أَثْنَىٰ عَلَىٰ هَرِمِ X
## الفصل العاشر (في المناجاة وعرض الحاجات)
Fيَــا أَكْرَمَ الْخَلقِ مَا لِي مَنْ أَلُوذُ بِهِ __ سِوَاكَ عِنـدَ حُلُولِ الْحَادِثِ الْعَمِمِX
Fوَلَن يَضِيقَ رَسُولَ اللّٰهِ جَاهُكَ بِي __ إِذَا الْكَرِيمُ تَجَلَّـىٰ بِاسْـمِ مُنتَقِـمِX
Fفَإِنَّ مِـنْ جُودِكَ الدُّنْيَا وَضَرَّتَهَا __ وَمِنْ عُلُومِكَ عِلْمَ اللَّوْحِ وَالْقَلَـمِX
Fيَا نَفْسُ لَا تَقْنَطِي مِن زَلَّةٍ عَظُمَـتْ __ إِنَّ الْكَبَائِرَ فِـي الْغُفْـرَانِ كَاللَّمَـمِX
Fلَعَلَّ رَحْمَةَ رَبِّي حِيـنَ يَقْسِمُهَا __ تَأْتِي عَلَىٰ حَسَبِ الْعِصْيَانِ فِي الْقِسَمِX
Fيَا رَبِّ وَاجْعَل رَّجَائِي غَيْرَ مُنْعَكِسٍ __ لَدَيْكَ وَاجعَلْ حِسَابِي غَيْرَ مُنْخَرِمِX
Fوَالْطُفْ بِعَبْدِكَ فِي الدَّارَينِ إِنَّ لَـهُ __ صَبْرًا مَتَىٰ تَدْعُهُ الْأَهْوَالُ يَنْهَزِمِX
Fوَأْذَن لِّسُحْبِ صَلَاةٍ مِنْـكَ دَائِمَـةٍ __ عَلَىٰ النَّبِـيِّ بِمُنْهَلٍّ وَمُنْسَجِمِX
Fمَا رَنَّحَتْ عَذَبَاتِ الْبَانِ رِيحُ صَبًا __ وَأَطْرَبَ الْعِيسَ حَادِي الْعِيسِ بِالنَّغَمِX
Fثُمَّ الرِّضَا عَن أَبِي بَكْرٍ وَعَن عُمَرٍ __ وَعَن عَلِيٍّ وَعَن عُثْمَانَ ذِي الْكَرَمِX
Fوَالْآلِ وَالصَّحْبِ ثُمَّ التَّابِعِينَ فَهُـمْ __ أَهْلُ التُّقَىٰ وَالنَّقَـا وَالْحِـلْمِ وَالْكَرَمِX
Fيَـا رَبِّ بِالمُصْطَفَىٰ بَلِّغْ مَقَاصِدَنَا __ وَاغْفِرْ لَنَا مَا مَضَىٰ يَا وَاسِعَ الْكَرَمِX
Fوَاغْفِرْ إِلَهِـي لِكُـلِّ الْمُسْلِميِنَ بِمَـا __ يَتْلُوهُ فِي الْمَسْجِدِ الْأَقْصَىٰ وَفِي الْحَرَمِX
Fبِجَاهِ مَنْ بَيتُـهُ فِي طَيْبَةٍ حَرَمٌ __ وَاسْمُـهُ قَسَـمٌ مِنْ أَعْظَمِ الْقَسَمِX
Fوَهَذِهِ بُـرْدَةُ الْمُخْتَارِ قَـدْ خُتِمَـتْ __ وَالْحَمْدُ لِلّٰهِ فِـي بَـدْءٍ وَفِـي خَتَمِX
Fأَبْيَاتُهَا قَدْ أَتَـتْ سِتِّينَ مَعْ مِـائَةٍ __ فَرِّجْ بِهَـا كَرْبَنَا يَا وَاسِعَ الْكَرَمِX
''');

const manzoumaAsmaaHosna = Zikr(
  title: 'منظومة أسماء الله الحسنى',
  notes: '''
منظومة أسماء الله الحسنى لسيدي أحمد الدردير رضي الله عنه

تقرأ الأربعاء صباحًا جماعة بمسجد الأشراف.
  ''',
  url:
      "https://ia601308.us.archive.org/9/items/dorar_audio/%D9%85%D9%86%D8%B8%D9%88%D9%85%D8%A9%20%D8%A3%D8%B3%D9%85%D8%A7%D8%A1%20%D8%A7%D9%84%D9%84%D9%87%20%D8%A7%D9%84%D8%AD%D8%B3%D9%86%D9%89.mp3",
  content: '''
﴿وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ﴾
Fتَبَارَكْتَ يَا اللهُ رَبِّي لَكَ الثَّنـَـا __ فَحَمْدًا لِمَوْلَانَــا وَشُكْرًا لِرَبِّنَـاX
Fبِأَسْمَائِكَ الْحُسْنَى وَأَسْرَارِهَــا الَّتِي __ أَقَمْتَ بِهَا الْأَكْوَانَ مِنْ حَضْرِةِ الْغِنَىX
Fفَنَدْعُوكَ يَا اللهُ يَـا مُبْـدِعَ الْوَرَى __ يَقِينًا يَقِينَا الْهَمَّ وَالْكَرْبَ وَالْعَنَاX
Fوَيَا رَبُّ يَا رَحْمَنُ هَبْنَا مَعَــــارِفًا __ وَلُطْفَـاً وَإِحْسَـانًا وَنُورًا يَعُمُّنَــاX
Fوَسِرْ يَا رَحِيمَ الْعَــالَمِينَ بِجَمْعِنَــا __ إِلَى حَضْرِةِ الْقُرْبِ الْمُقَدَّسِ وَاهْدِنَاX
Fوَيَا مَالِكٌ مَلِّكْ جَمِيـعَ عَوَالِمِي __ لِرُوحِي وَخَلِّصْ مِنْ سِوَاكَ عُقُولَنَـاX
Fوَقَدِّسْ أَيَـا قُدُّوسُ نَفْسِي مِنَ الْهَوَى __ وَسَلِّـمْ جَمِيعِي يَـا سَلَامُ مِنَ الضَّنَىX
Fوَيَا مُؤْمِنُ هَبْ لِي أَمَانًا وَبَهْجَةً __ وَجَمِّـلْ جَنَانِي يَا مُهَيْمِنُ بِالْمُنَىX
Fوُجُدْ لِي بِعِزٍّ يَـا عَزِيزُ وَقُوَّةٍ __ وَبِالْجَبْرِ يَا جَبــَّـارُ بَدِّدْ عَدُوَّنَــاX
Fوَكَبِّرْ شُئُونِي فِيكَ يَا مُتَكَبِّـرٌ __ وَيَا خـَالِقَ الْأَكْوَانِ بِالفَيْضِ عُمَّنَــاX
Fوَيَا بَـارِئُ احْفَظَنَـا مِنَ الْخَلْقِ كُلِّهِمْ __ بِفَضْلِكَ وَاكْشِفْ يَا مُصَوِّرُ كَرْبَنَــاX
Fوَبِالْغَفْرِ يَا غَفَّارُ مَحِّصْ ذُنُوبَنَــا __ وَبِالْقَهْـرِ يَـا قَهَّـارُ اقْهَرْ عَدُوَّنَاX
Fوَهَبْ لِي أَيَا وَهَّابُ عِلْمـًا وَحِكْمَةً __ وَلِلرِّزْقِ يَا رَزَّاقُ وَسِّعْ وَجُـدْ لَنَـــاX
Fوَبِالْفَتْـحِ يَا فَتَّــاحُ عَجِّلْ تَكَرُّمًا __ وَبِالْعِلْـمِ نَــوِّرْ يَا عَلِيــمُ قُلُوبَنَـاX
Fوَيَا قَابِضُ اقْبَضْنَـا عَلَى خَيْرِ حَالَةٍ __ وَيَا بَاسِطَ الْأَرْزَاقِ بَسْطاً لِرِزْقِنَـاX
Fوَيَا خَافِضُ اخْفِضْ لِي القُلُوبَ تَحَبُّبًا __ وَيَا رَافِعُ ارْفَعْ ذِكْرَنَا وَاعْلِ قَدْرَنَاX
Fوَبِالزُّهْدِ وَالتَّقْوَى مُعِزٌّ أَعِزَّنَـا __ وَذَلِّـلْ بِصَفْوٍ يَا مُــذِلُّ نُفُوسَنَاX
Fوَنَفِّـذْ بِحَقٍّ يَا سَمِيْـعُ مَقَالَتِي __ وَبَصِّرْ فُـؤَادِي يَـا بَصِيـرُ بِعَيْبِنَاX
Fوَيَـا حَكَمُ يَا عَدْلُ حَكِّمْ قُلُوبَنَا __ بِعَدْلِكَ فِي الْأَشْيَـا وَبِالرُّشْـدِ قَوِّنَاX
Fوَحُفَّ بِلُطْفٍ يَا لَطِيفُ أَحِبَّتِي __ وَتَوِّجْهُمُ بِالنُّورِ كَـيْ يُـدْرِكُواْ الْمُنَىX
Fوَكُنْ يَا خَبِيرًا كَاشِفًـا لِكُرُوبِنَـا __ وَبَالْحِلْمِ خَلِّقْ يَا حَلِيمُ نُفُوسَنَاX
Fوَبِالْعِلْمِ عَظِّمْ يَا عَظِيُـــــمُ شُئُونَنَـا __ وَفِي مَقْـعَـدِ الصِّـدْقِ الْأَجَـلِّ أَحِلَّنَاX
Fغَفُورٌ شَكُـورٌ لَمْ تَزَلْ مُتَفَضِّـلًا __ فَبِـالشُّكْـرِ وَالْغُفْرَانِ مَوْلَايَ خَصَّنَاX
Fعَلِيٌ كَبِيرٌ جَلَّ عَنْ وَهْمِ وَاهِـمٍ __ فَسُبْحَانَكَ اللَّهُمَّ عَنْ وَصْفِ مَنْ جَنَىX
Fوَكُنْ لِي حَفِيظًا يَا حَفِيظُ مِنَ الْبَلَا __ مُقِيتٌ أَقِتْنـَا خَيْـرَ قُوْتٍ وَهَنِّنَاX
Fوَأَنْتَ غِيَاثِي يَا حَسِيبُ مِنَ الرَّدَى __ وَأَنتَ مَلَاذِي يَا جَـلِيلُ وَحَسْبُنَاX
Fوَجُدْ يَا كَرِيمًا بِالْعَطَا مِنْكَ وَالرِّضَا __ وَتَزْكِيَةِ الْأَخْـلَاقِ وَالْجُودِ وَالْغِنَىX
Fرَقِيبٌ عَلَيْنَا فَاعْفُ عَنَّـا وَعَافِنَـا __ وَيَسِّرْ عَلَيْنـَا يَـا مُجِيـبُ أُمُورَنَاX
Fوَيَا وَاسِعًـا وَسِّعْ لَنَا الْعِلْمَ وَالْعَطـَا __ حَكِيمًـا أَنِـلْنَـا حِكْمِةً مِنْـكَ تَهْـدِنَاX
Fوَدُودٌ فَجُدْ بِالْـوُدِّ مِنْـكَ تَكَرُّمًا __ عَلَيْنَا وَشَرِّفْ يَا مَجِيـدُ شُـئُونَنَاX
Fوَيَا بَاعِثُ ابْعَثْنَا عَلَى خَيْرِ حَالَةٍ __ شَهِيـدٌ فَـأَشْهِدْنَا عُلَاكَ بِجَمْعِنَاX
Fوَيَـا حَـقُّ حَقِّقْنَا بِسِــرٍّ مُقَـدَّسٍ __ وَكِيلٌ تَوَكَّلْنَا عَلَيْكَ بِكَ اكْفِنَـاX
Fقَوِيٌّ مَتِيـنٌ قَوِّ عَزْمِي وَهِمَّتِي __ وَلِيٌّ حَمِيـــدٌ لَيْسَ إِلَّا لَكَ الثَّنَاX
Fوَيَا مُحْصِيَ الْأشْياءِ يَا مُبْدِئَ الْوَرَى __ تَعَطَّفْ عَلَيْنـَا بِالمَسَـرَّةِ وَالْهَنَـاX
Fأَعِدْنَا بِنُورٍ يَا مُعِيدُ وَأَحْيِنَا __ عَلَى الدِّينِ يَا مُحْيِي الْأَنَامِ مِنَ الْفَنَاX
Fمُمِيتٌ أَمِتْنِـي مُسْلِمـًا وَمُوَحِّدًا __ وشَرِّفْ بِذَا قَدْرِي كَمَـا أَنْتَ رَبُّنَاX
Fوَيَا حَيُّ يَا قَيُّـومُ قَوِّمْ أُمُورَنَا __ وَيَا وَاجِدٌ أَنْتَ الْغَنِيُّ فَأَغْنِنَـاX
Fوَيَا مَاجِدٌ شَرِّفْ بِمَجْدِكَ قَدْرَنَـا __ وَيَا وَاحِـدٌ فَرِّجْ كُرُوبِي وَغَمَّنـَاX
Fوَيَا صَمَدٌ فَوَّضتُّ أَمْرِي إِلَيْكَ لَا __ تَكِلْنِي لِنَفْسِي وَاهْدِنَا رَبِّ سُبْلَنَاX
Fوَيَا قَادِرُ اقْدِرْنَا عَلَى صَدْمَةِ الْعِدَا __ وَمُقْتَدِرٌ خَلِّصْ مِنَ الْغَيْـرِ سِرَّنَـاX
Fوَقَدِّمْ أُمُـورِي يَا مُقَدِّمُ هَيْبَــةً __ وَأَخِّرْ عِدَانَـا يَا مُؤَخِّرُ بِالْعَنَـاX
Fوَيَا أَوَّلٌ مِنْ غَيْـرِ بَدْءٍ وَآخِـرٌ __ بِغَيْرِ انْتِهَاءٍ أَنْتَ فِي الْكُلِّ حَسْبُنَاX
Fوَيَا ظَاهِرًا فِي كُــلِّ شَيْءٍ شُئُونَهُ __ وَيَا بَاطِنًـا بِالْغَيْبِ لَازِلْتَ مُحْسِنَــاX
Fوَيَا وَالِيـًا لَسْــنَا لِغَيْرِكَ نَنْتَمِي __ فَبِالنَّصِرِ يَا مُتْعَالِيًا كُنْ مُعِزَّنَـاX
Fوَيَـا بَرُّ يَا تَـوَّابُ جُدْ لِي بِتَـوْبَةٍ __ نَصُوحٍ بِهَا تَمْحُو عَظَائِمَ جُرْمِنَاX
Fوَمُنْتَقِمٌ هـَاكَ انْتَقِمْ مِنْ عَدُوِّنَـا __ عَفُوٌّ رَءُوفٌ عَافِنَا وَارْأَفَنْ بِنَاX
Fوَيَا مَالِكَ الْمُلْكِ الْعَظِيـمِ بِقَهْرِهِ __ وَيَا ذَا الْجَلَالِ الْطُفْ بِنَا فِي أُمُورِنَاX
Fوَيَا مُقْسِطٌ بِالِاسْتِقَامِةِ قَـوِّنَا __ وَيَا جَامِعٌ فَاجْمَعْ عَلَيْكَ قُلُوبَنَـاX
Fغَنِيٌّ وَمُغْـنٍ اغْنِنَـا بِكَ سَيّـدِي __ وَيَا مَانِعُ امْنَـعْ كُلَّ كَرْبٍ يَهُمُّنَاX
Fوَيَا ضَارُّ ضُرَّ الْمُعْتَـدِينَ بِظُلْمِهِمْ __ وَيَا نَـافِعُ انْفَعْنَـا بِأَنْوَارِ دِينِنَاX
Fوَيَا نُورُ نَوِّرْ ظَاهِرِي وَسَرَائِرِي __ بِحُبِّكَ يَا هـَادِي وَقَـوِّمْ طَرِيقَنَاX
Fبَدِيعٌ فَأَتْحِفْنَــا بَدَائِعَ حِكْمَـةٍ __ وَيَا بَاقِيًا بِكَ ابْقِنَـا فِيكَ أَفْنِنـَاX
Fوَيَا وَارِثًا وَرِّثْنِي عِلْمًا وَحِكْمَةً __ رَشِيدٌ فَأَرْشِدْنَـا إِلَى طُرُقِ الثَّنَاX
Fوَأَفْرِغْ عَلَيْنَـا الصَّبْرِ بِالشُّكْرِ وَالرِّضَا __ وَحُسْـنَ يَقِينٍ يَا صَبُـورُ وَوَفِّنَاX
Fبِأَسْمَائِكَ الْحُسْنَى دَعَوْنَاكَ سَيِّدِي __ تَقَبَّلْ دُعَانَا رَبَّنَـا وَاسْتَجِبْ لَنَاX
Fبِأَسْرَارِهَا عَمِّرْ فُـؤَادِي وَظَاهِرِي __ وَحَقِّقْ بِهَا رُوحِي لِأَظْفَرَ بِالْمُنَىX
Fوَنَوِّرْ بِهَـا سَمْعِي وَشَمِّي وَنَاظِرِي __ وَقَوِّ بِهَـا ذَوْقِي وَلَمْسِي وَعَقْلَنَـاX
Fوَيَسِّـرْ بِهَا أَمْــرِي وَقَوِّ عَزَائِمِي __ وَزَكِّ بِهَـا نَفْسِي وَفَرِّجْ كُرُوبَنَـاX
Fوَوَسِّعْ بِهَا عِلْمِي وَرِزْقِي وَهِمَّتِي __ وَحَسِّنْ بِهَا خَلْقِي وَخُلْقِي مَعَ الْهَنَاX
Fوَهَبْ لِي بِهَا حُبًّـا جَلِيلًا مُجَمَّلًا __ وَزِدْنِي بِفَـرْطِ الْحُبِّ فِيكَ تَفَنُّنـَاX
Fوَهَبْ لِي أَيَا رَبَّاهُ كَشْفًا مُقَدَّسًا __ لِأَدْرِي بِهِ سِــرَّ الْبَقَـاءِ مَعَ الْفَنَاX
Fوَجُدْ لِي بِجَمْعِ الْجَمْعِ فَضْلًا وَمِنَّةً __ وَدَاوِ بِوَصْلِ الْوَصْلِ رُوحِي مِنَ الضَّنَاX
Fوَسِرْ بِي عَلَى النَّهْجِ الْقَوِيمِ مُوَحِّـدًا __ وَفِي حَضْرَةِ الْقُدْسِ الْمَنَيِعِ أَحِلَّنـَاX
Fوَمُـنَّ عَلَيْنَـا يَا وَدُودُ بِجَذْبَـة __  بِهَا نَلْحَقُ الْأَقْوَامَ مَنْ سَارَ قَبْلَنَـاX
Fوَصَلِّ وَسَلِّمْ سَيِّدِي كُـلَّ لَمْحَةٍ __ عَلَى الْمُصْطَفَى خَيْـرِ الْبَرَايَا نَبِيِّنَـاX
Fوَصَلِّ عَلَى الْأَمْلَاكِ وَالرُّسْلِ كُلِّهِمْ __ وَآلِهِمِ وَالصَّحْبِ جَمْعًا وَعُمَّنَـاX
Fوَسَلِّمْ عَلَيْهِمْ كُلَّمَا قَـالَ قَائِلٌ __ تَبَارَكْتَ يَا اللهُ رَبِّي لَكَ الثَّنَـاX
Fوَصَلِّ عَلَى الْمَبْعُوثِ بِالنُّورِ وَالْهُدَى __ وَبِالْمَدَدِ الْفَيَّاضِ مِنْهُ أَمِدَّنَا X
(ثلاثًا)
Fوَآلٍ وَأَصْحَابٍ وَكُلِّ مَنِ انْتَمَى __ وَحُفَّ بِلُطْفٍ مَنْ أَرَادَ طَرِيقَنَاX

اللَّهُمَّ صَلَّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّد فِي الْأَوَّلِينَ، وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي الْآخِرِينَ، وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي كُلِّ وَقْتٍ وَحِينٍ، وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي الْمَلَأِ الْأَعْلَى إِلَى يَوْمِ الدِّينِ، وَصَلِّ وَسَلِّمْ عَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِينَ وَعَلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ، وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ مِنْ أَهْلِ السَّمَاوَاتِ وَأَهْلِ الْأَرَضِينَ، وَرَضِيَ اللهُ تَبَارَكَ وَتَعَالَى عَنْ سَادَاتِنَا ذَوِي الْقَدْرِ الْجَلِيِّ أَبــِي بَكْــــرٍ وَعُمَرَ وَعُثْمَانَ وَعَلىِّ، وَعَنْ سَائِرِ أَصْحَابِ رَسُولِ اللهِ صلى الله عليه وسلم أَجْمَعِينَ، وَالتَّابِعِينَ لَهُمْ بِإِحْسَانٍ إِلَى يَوْمِ الدِّينِ، احْشُرْنَا وَارْحَمْنَا مَعَهُمْ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ، يا اللهُ يَا حَيُّ يا قَيُّومُ، لَا إِلَهَ إِلَّا أَنْتَ يا اللهُ يَا رَبَّنَا يَا وَاسِع المَغْفِرَةِ يَا أَرْحَمَ الرَّاحِمِينَ اللَّهُمَّ آمِينَ. ﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182].
''',
);

const poemMonfarigaGazali = Zikr(
    title: 'القصيدة المنفرجة للإمام الغزالي',
    notes: '''
القصيدة المنفرجة المنسوبة للإمام أبي حامد الغزالي

تقرأ الأحد صباحًا جماعة بمسجد الأشراف
  ''',
    url:
        "https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%82%D8%B5%D9%8A%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D9%86%D9%81%D8%B1%D8%AC%D8%A9%20%D9%84%D9%84%D8%A5%D9%85%D8%A7%D9%85%20%D8%A7%D9%84%D8%BA%D8%B2%D8%A7%D9%84%D9%8A.mp3",
    content: '''
Fالشِّـدَّةُ أَوْدَتْ بِالمُهَـجِ __ يَا رَبِّ فَعَجِّــلْ بِالْفَرَجِX
Fوَالأَنْفُسُ أَمْسَتْ فِي حَـرَجِ __ وَبِيَدِكَ تَفْرِيـــجُ الْحَـرَجِX
Fهَاجَتْ لِدُعَاكَ خَوَاطِرُنَا __ وَالوَيْلُ لَهَــا إِنْ لَمْ تَهِجِX
Fيَا مَنْ عَوَّدتَّ اللُّطْفَ أَعِدْ __ عَـادَاتِكَ بِاللُّطْفِ الْبَهِجِX
Fوَاغْلِقْ ذَا الضِّيقَ وَشِـــدَّتَهُ __ وَافْتَحْ مَـــا سُدَّ مِنْ الْفَــرَجِX
Fعُجْنَا لِجَنَـابِكَ نَقْصِدُهُ __ وَالأَنْفُسُ فِي أَوْجِ الْـوَجِّX
Fوَإِلَى إِفْضَـالِكَ يَا أَمَلـِي __ يَا ضَيْعَتَنَا إِنْ لَمْ نَعُـجِX
Fمَنْ لِلمَلْهُوفِ سِوَاكَ يُغِثْ __ أَو لِلمُضْطَّر سِـوَاكَ نَجِـيX
Fوَإِسَــاءَتُنَـا أَنْ تَقْطَعَنَــا __ عَنْ بَـابِكَ حَتَّى لَمْ نَلِـجِX
Fفَلَكَمْ عَاصٍ أَخْطَا وَرَجَاكَ __ أَبَحْتَ لـَهُ مَـا مِنْـــكَ نَجِـيX
Fيَا سَــيِّدَنَــا يَا خَالِقَنَـــا __ قَد ضَاقَ الحَبْلُ عَلَى الْـوَدَجِX
Fوَعِبَادُكَ أَضْحَــوْا فِي أَلَمٍ __ مَا بَيْن مُكَيْرِيبٍ وَشَجِيX
Fوَالأَحْشَا صَارَتْ فِي حَرَقٍ __ وَالأعْيُنُ غَــــارَتْ فِي لُجَجِX
Fوَالأعْيُنُ صَارَتْ فِي لُجَجٍ __ غَـاصَتْ فِي الْمَوج مَعَ الْمُهَجِX
Fوَالأزْمَةُ زَادَتْ شِـــدَّتُهَا __ يَـا أَزْمَـــةُ عَلَّكِ تَنْفَـرِجِـيX
Fجِئْنَـــــاكَ بِقَلْبٍ مُنْكَسِرٍ __ وَلِسَـانٍ بِالشَّكْـوَى لَهِجِX
Fوَبِخَوْفِ الذِّلَّةِ فِي وَجَــلٍ __ لَكِـــــنْ بِرَجَــائِكَ مُمْتَزِجِX
Fفَكَم اسْتَشْفَى مَزْكُومُ الذَّنْبِ __ بِنَشْـرِ الرَّحْـمَـــةِ وَالأرَجِX
Fوَبِعَيْنِكَ مَا نَلْقَــاهُ وَمَا __ فِيهِ الأحْــوَالُ مِنَ المَرَجِX
Fوَالفَضْلُ أَعَمُّ وَلَكنْ قَدْ __ قُلْتَ ادْعُــونِي فَلْنَبْتَهِـجِX
Fفَبِكُلِّ نَبِيٍّ نَسْـأَلُ يَـا __ رَبَّ الأَرْبَابِ وَكُـــلِّ نَجِيX
Fوَبِفَضْلِ الذِّكْـــرِ وَحِكْمَتِـهِ __ وَبِمَـــا قَدْ أَوْضَحَ مِنْ نَهَجِX
Fوَبِسِـرِّ الأَحْــرُفِ إِذْ وَرَدَتْ __ وَضِيَـــــاءِ النُّـــورِ المُنْبَلِجِX
Fوَبِسِـــرٍّ أُوْدِعَ فِي بَطَدٍ __ وَبِمَــا فِي وَاحٍ مَعْ زَهَجِX
Fوَبِسِـرِّ البَـــــــاءِ وَنُقْطَتِهَا __ مِنْ بِسْمِ اللهِ لِذِي النَّهَـجِX
Fوَبِقَــــــافِ القَهْرِ وَقُوَّتِهَا __ وَبِقهْــرِ القَـاهِـرِ لِلْمُهَجِX
Fوَبِبَرْدِ المَــا وَإِسَــاغَتِهِ __ وَعُمُــــومِ النَّفْعِ مَعَ الثَّلَجِX
Fوَبِـحَـرِّ النَّـــــــارِ وَحِدَّتِهَا __ وَبِسِـرِّ الحُـرْقَةِ وَالنَّضَجِX
Fوَبِمَـا طَعَّمْتَ مِنَ التَّطْعِيمِ __ وَبِمَـــا دَرَّجْتَ مِنَ الدَّرَجِX
Fيَا قَـــــاهِرُ يَا ذَا الشِّدَّةِ يَا __ ذَا البَطْشِ أَغِثْ يَا ذَا الفَرَجِX
Fيَا رَبِّ ظَلَمْنَــا أَنْفُسَنَا __ وَمُصِيبَتُنَــا مِنْ حَيْثُ نَجِـيX
Fيَا رَبِّ خُلِقْنَــــا مِنْ عَجَلٍ __ فَلِذَلِكَ نَدْعُــو بِاللَّجَـجِX
Fيَا رَبِّ وَلَيْسَ لَنَـــــا جَلَـدٌ __ أَنَّـى وَالقَـــلْبُ عَلَى وَهَـجِX
Fيَا رَبِّ عَبِيدُكَ قَدْ وَفَــدُواْ __ يَـدْعُــونَ بِقَلْـبٍ مُنْزَعِجِX
Fيَا رَبِّ ضِعَــافٌ لَيْسَ لَهُمْ __ أَحَدٌ يَرْجُــونَ لَـدَى الْهَرَجِX
Fيَا رَبِّ فِصِــاَحُ الْأَلْسُنِ قَدْ __ أَضْحَوْا فِي الشِّدَّةِ كَالْهَمَـجِX
Fالسَّـابِقُ مِنَّا صَــارَ إِذَا __ يَعْدُو يَسْبِقُه ذَوُو الْعَــرَجِX
Fوَالْحِكْمَــةُ رَبِّي بَالِغَـةٌ __ جَلَّتْ عَنْ حَيْفٍ أَو عِــوَجِX
Fوَالْأَمْرُ إِلَيْكَ تُدَبِّــرُهُ __ فَأَغِثْنَـــــا بِاللُّطْفِ البَهِـجِX
Fوَادْرُجْ فِي العَفْـوِ إِسَـاءَتَنَا __ وَالخَيْبَةَ إِنْ لَمْ تَنْـدَرِجِX
Fيَا نَفْسُ وَمَـالَكِ مِنْ أَحَـدٍ __ إِلا مَـوْلَاكِ لَهُ فَعُجِـيX
Fوَبِهِ فَلُــذِي وَبِهِ فَعُـذِي __ وَلِبَــابِ مَكَـارِمِه فَلُجِيX
Fكَيْ تَنْصَلِحِي كَيْ تَنْشَرِحِي __ كَيْ تَنْبَسِطِـــي كَيْ تَبْتَهِجِـيX
Fوَيَطِيْبُ مَقَـامُكِ مَعْ نَفَرٍ __ أَضْحَوْا فِي الحِنْدِسِ كَالسُّرُجِX
Fوَفَّوْا للهِ بِمَــا عَهِـدُوا __ مِنْ بَيْــعِ الأَنْفُسِ وَالْمُهَجِX
Fفَهُمُ الهَادِي وَصَحَـابَتُهُ __ ذُو الرُّتْبَةِ وَالعِطْـرِ الأَرَجِX
Fقَوْمٌ سَكَنُوا الجَرْعَاءَ وَهُمْ __ شَرَفُ الجَرْعَـاءِ وَمُنْعَرَجِX
Fجَـاءُواْ لِلْكَوْنِ وَظُلْمَتُهُ __ عَمَّتْ وَظَلَامُ الشِّـرْكِ دَجِـيX
Fمَا زَالَ النَّصْـرُ يَحُفُّهُم __ وَالظُّلْمَةُ تُمْحَى بِالبَلَـجِX
Fحَتَّى نَصَرُواْ الإِسْلاَمَ فَعَادَ __ الدِّيْنُ عَزِيْــزًا فِي بَهَـجِX
Fفَعَلَيْهِـمْ صَلَّى الرَّبُّ عَلَى __ مَــرِّ الأَيَّــامِ مَعَ الحِجَجِX
Fوَعَلَى الصِّـــدِّيقِ خَلِيْفَتِهِ __ وَكَذَا الفَــارُوقِ وَكُلِّ نَجِـيX
Fوَعَلَى عُثْمَـانَ شَهِيْدِ الدَّارِ __ وَفَى فَرَقَى أَعْلَــى الدَّرَجِX
Fوَأَبِي الحَسَنَيْنِ مَعَ الأَوْلاَدِ __ كَذَا الأَزْوَاجِ وَكُــلِّ شَجِـيX
Fمَا مَالَ الْمَـالُ وَحَالَ الْحَالُ __ وَسَــارَ السَّـارِي فِي الدَّلَجِX
Fيَـا رَبِّ بِهِم وَبِآلِـهِـم __ عَجِّلْ بِالنَّصْـرِ وَبِالْفـرَجِX (3مرات)
Fوَاغْفِرْ يَـــا رَبِّ لِنَـــاظِمِهَا __ وَلَـهُ رَقِّي أَعْلَـــــى الـدَّرَجِX
Fوَاخْتِمْ عَمَلِي بِخَوَاتِمِهَــا __ لِأَكُونَ غَدًا فِي الْحَشْــرِ نَجِــيX
Fوَإِذَا بِكَ ضَـاقَ الأَمْـرُ فَقُلْ __ الشِّــــدَّةُ أَوْدَتْ بِالْمُهَـجِX
         يــــَا رَبِّ فَعَجِّـلْ بِالفَـرَجِ
''');

const poemMonfarigaNahawi = Zikr(
    title: 'القصيدة المنفرجة لابن النحوي',
    notes: '''
القصيدة المنفرجة المنسوبة لابن نحوي رضي الله عنه

تقرأ الأحد صباحًا جماعة بمسجد الأشراف
  ''',
    url:
        "https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A7%D9%84%D9%82%D8%B5%D9%8A%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D9%86%D9%81%D8%B1%D8%AC%D8%A9%20%D9%84%D8%A7%D8%A8%D9%86%20%D8%A7%D9%84%D9%86%D8%AD%D9%88%D9%8A.mp3",
    content: '''
Fاشْتَــدِّي أَزْمَــةُ تَنْفَــِرجِــي __ قَـدْ آذَنَ لَيْلُــكِ بِـالْبَلَـجِX
Fوَظََـلَامُ اللَّيْلِ لَــهُ سُــرُجٌ __ حَتَّـى يَغْشَــاهُ أَبُــو السُّـرُجِX
Fوَسَحَــابُ الْخَيْـرِ لَـهُ مَطَـرٌ __ فَـإِذَا جَــاءَ الْإبَّــانُ تَجِـيX
Fوَفَـوَائِــدُ مَـْولَانَــا جُمَـلٌ __ لِسُــرُورِ الْأَنْفُـسِ وَالْمُهَجِX
Fوَلَهَــا أَرَجٌ مُـحْــيٍ أَبَـــدًا __ فَـاقْصِــدْ مَحْيَـا ذَاكَ الْأرَجِX
Fفَـلَـرُبَّتَمَـا فَـــاضَ الْمَحْيَا __ بِبِحَــارِ الْمَــوْجِ مَـعَ اللُّجَجِX
Fوَالْخَــلْقُ جَمِيـعًـا فِي يَـــدِهِ __ فَـذَوُواْ سَعَـةٍ وَذَوُواْ حَـرَجِX
Fوَنُــزُولُهُـمُ وَطُلُـوعُــهُـمُ __ فَــإِلَـى دَرَكٍ وَعَـلَـى دَرَجِX
Fوَمَعَايِشُــــهُـمْ وَعَـوَاقِـبُـهُـمْ __ لَيْسَتْ فِي الْمَشْيِ عَلَـى عِـوَجِX
Fحِكَمٌ نُسِجَتْ بِيَدٍ حَكَمَـتْ __ ثُـمَّ انْتَـسَـجَــتْ بِـالْمُنْتَـسَـجِX
Fفَإِذَا اقْتَصَدَتْ ثُمَّ انْعَرَجَـتْ __ فَبِمُقْتَصِــــدٍ وَبِمُنْـعَـــرِجِX
Fشَهِـدَتْ بِعَجَـائِبِهَا حُجَـجٌ __ قَـامَـتْ بِالْأَمْرِ عَلَى الْحِجَجِX
Fوَرِضًا بِقَضَــاءِ اللهِ حِجَـا __ فَـعَـلَى مَـرْكُوزَتِـهَـا فَعُــجِX
Fفَإِذَا انْفَتَحَـتْ أَبْوَابُ هُدًى __ فَـاعْجَـل لِّخَـزَائِنِـهَـا وَلُــجِX
Fوَإِذَا حَـاوَلْــتَ نِهَــايَتَـهَـا __ فَـاحْـذَرْ إِذ ذَّاكَ مِـنَ الْعَرَجِX
Fلِتَكُـونَ مِــنَ السُّبَّــاقِ إِذَا __ مَـا جِئْـتَ إِلَى تِلْـكَ الْفُـرَجِX
Fفَهُنَــاكَ الْعَيْـشُ وَبَهْجَتُــهُ __ فَبِـمُبْـتَـهِـجٍ وَبِمُـنْتَـهِـجِX
Fفَهِجِ الْأَعْمَالَ إِذَا رَكَـدَتْ __ وَإِذَا مَــا هِجْـتَ إِذَنْ تَهِـجِX
Fوَمَعَـاصِـي اللهِ سَمَـاجَتُهَا __ تَزْدَانُ لِـذِي الْخُـلِقِ السَّمِجِX
Fوَلِطَــاعَتِـهِ وَصَبَـاحَـتِـهَـا __ أَنْـــوَارُ صَبَــاحٍ مُنْـبَـلِــجِX
Fمَنْ يَخْطُبُ حُورَ الْعِينِ بِهَـا __ يَحْــظَى بِـالحُـورِ وَبِالْغُنُـجِX
Fفَكُـنِ الْمَـرْضِــيَّ لَهَـا بِتُقًـا __ تَرْضَـاهُ غَدًا وَتَكُـونُ نَجِـيX
Fوَاتْـلُ الْقُـرْآنَ بِقَـلْبٍ ذِي __ حُـرُقٍ وَبِصَـوْتٍ فِيـهِ شَـجِX
Fوَصَـلَاةُ اللَّيْـلِ مَسَـافَتُهَـا __ فَاذْهَبْ فِيهَـا بِالْفَهْمِ وَجِـيX
Fوَتَـأَمَّلْـهَــــا وَمَعَـانِـيـَهَــا __ تَأْتِـي الْفِـرْدَوْسَ وَتَبْتَـهِـجِX
Fوَاشْـرَبْ تَسْنِيمَ مُفَجِّـرِهَا __ لَا مُمْـتَـزِجًــا وَبِمُـمْـتَــزِجِX
Fمُـدِحَ الْعَقْلُ الْآتِيـهِ هُدًى __ وَهَـوَى الْمُتَـوَلِّ عَنْهُ هُجِـيX
Fوَكِـتَــابُ اللهِ رِيَــاضَـتُـــهُ __ لِعُقُـــولِ النَّـــاسِ بِمُنْــدَرِجِX
Fوَخِـيَـارُ الْخَـلْـقِ هُـدَاتُهُـمُ __ وَسِـوَاهُم مِّـنْ هَمَـجِ الْهَمَـجِX
Fفَإِذَا كُنْتَ الْمِقْدَامَ فَلَا تَجْزَعْ __ فِـي الْحَـرْبِ مِـنَ الــرَّهَــجِX
Fوَإِذَا أَبْصَـرْتَ مَنَـارَ هُـدًى __ فَـاظْهَـرْ فَــرْدًا فَــوْقَ الثَّبَـجِX
Fوَإِذَا اشْتَاقَتْ نَفْسٌ وَجَدَتْ __ أَلَمًــــا بِـالشَّـوْقِ الْمُعْـتَـلِـجِX
Fوَثَنَــايَا الْحَسْنَـا ضَـاحِـكَـةٌ __ وَتَمَامُ الضَّحْكِ عَلَى الْفَلَـجِX
Fوَغِيَابُ الْأَسْرَارِ اجْتَمَعَتْ __ بِـأَمَـانَتِهَـــا تَحْــتِ السُّـرُجِX
Fوَالرِّفْقُ يَدُومُ لِصَـــــاحِبِهِ __ وَالْخَـرْقُ يَصِيــرُ إِلَى الْهَــرَجِX
Fصَـلَوَاتُ اللهِ عَلَى الْمَهْـدِي __ الْهَــادِي النَّـــاسِ إِلَى النَّهْجِX
Fوَأَبِـي بَكْـــــرٍ فِي سِيـرَتِـهِ __ وَلِـسَــــانِ مَقَـــالَتِهِ اللَّهِجِX
Fوَأَبِـي حَـفْـصٍ وَكَـرَامَـتِـهِ __ فِـي قِـصَّـةِ سَارِيَـةَ الخَـلَـجِX
Fوَأَبِـي عَمْـروٍ ذِي النُّـورَيْـنِ __ الْمُسْتَـهْـدِ الْمُـسْتَحْـيِ الْبَـهِجِX
Fوَأَبِـي حَسَنٍ فِي الْعِـلْمِ إِذَا __ وَافَــى بِسَـحَـائِبـِهِ الْخُـلُـجِX
Fوَعَلَـى السِّبْـطَيْـنِ وَأُمِّهِمَا __ وَجَمِــيـــعِ الْآلِ بِمُـنْـــدَرِجِX
Fوَصَـحَـابَتِهِـمْ وَقَـرَابَتِهِـمْ __ وَقُفَـاتُ الْأَثـَـرِ بِـلَا عِـوَجِX
Fوَعَـلَـى تُبَّـاعِـهُـمُ الْعُلَمَا __ بِعَــوَارِفِ دِينِـهِمِ الْبَـهِـجِX
Fيَــا رَبِّ بِـهِـمْ وَبِــآلِهِـمْ __ عَجِّـلْ بِالنَّصْـرِ وَبِـالْفَـرَجِX
Fوَارْحَمْ يَا أَكْرَمَ مَنْ رَحِمَا __ عَبْـدًا عَـنْ بَابِكَ لَـمْ يَعُـجِX
Fوَاخْتِـمْ عَمَـلِـي بِخَوَاتِمِهَا __ لِأَكُونَ غَدًا فِي الْحَشْرِ نَجِيX
Fلَكِنّـِي بِجُـودِكَ مُعْتَــرِفٌ __ فَاقْبَـلْ بِمَعَـاذِرِي حِجَجِـيX
Fوَإذَا بِـكَ ضَــاقَ الْأمْــرُ __ فَقُلْ اشْتَدِّي أَزْمَــةُ تَنْفَرِجِــيX
''');

const poemBanatSuad = Zikr(
    title: 'قصيدة بانت سعاد',
    notes: '''
قصيدةُ (بانت سعاد) لكعب بن زهير رضى الله عنه

تقرأ الأحد صباحًا جماعة بمسجد الأشراف
  ''',
    url:
        'https://ia601308.us.archive.org/9/items/dorar_audio/%D8%A8%D8%A7%D9%86%D8%AA%20%D8%B3%D8%B9%D8%A7%D8%AF.mp3',
    footer: '''
1.
• بانت: فارقت
• سعاد: رمز المحبوبة 
• متبول: ذاهل مغموم 
• مُتَيَّمٌ: أسير ومستعبد
• لم يُفْدَ: من الفداء
• مكبول: مُكَبَّل بالقيود.
2.
• غداة البين: صبيحة الفراق
• أَغَنُّ: كالغزال صوتها به غنة
• غضيض: مسترخي الأجفان
• مكحول: كحيل العين
3.
• هيفاء: ضامرة البطن دقيقة الخصر حال إقبالها
• عجزاء: كبيرة العجيزة حال إدبارها ولا تعاب بطول ولا قصر
4.
• تجلو: تظهر
• عوارض: أسنان ما بعد الأنياب وتسمى ضواحك
• ذي ظَلْمٍ: الظَّلْم ماء الأسنان رقة وشفافية
• منهل: ما يشرب بنهل أولًا
• الراح: الخمر
• معلول: العلل الشرب الثاني بعد الأول
5.
• شُجَّتْ: مزجت
• شَبِمٍ: بارد
• مَحْنِيَةٍ: ما انعطف من الوادي
• صاف: لصفائه من القذى
• أبطح: ما اتسع من بطن الوادي
• أضحى: وقت الضحى
• مشمول: رياح الشمال وهي باردة. أما الصبا فهي رياح شرقية، والدبور هي الرياح الغربية، أما الجنوبية فيسميها أهل مصر القبلية.
6.
• القذى: الأذى والقذر
• أفرطه: تتركه وراءها، ومنها قوله ﷺ في الحديث: «أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ»؛ أي: متقدمكم
• سارية: سحابة الليل، والغادية: هي التي تغدو بالنهار
• بيضٌ: بيضاء
• يعاليل: ما فوق الماء من فقاقيع. وقيل: هذا وصف للجبال التي مرت السحاب فوقها
7.
• خلة: صديقة
• صدقت موعودها: وَفَّتْ بوعدها
• النصح مقبول: أي: قبلت النصيحة
8.
• سِيطَ: خلط
• فجع: إصابة تفجع صاحبها
• ولع: كذب ومنها لَوَع بالعامية أو ملاوع
• إخلاف: خلف وعد
• تبديل: تستبدل به غيره.
9.
• الغول: اسم لمخلوق خيالي عند العرب يغتال الإنسان أو يضلله ويظهر في أشكال كثيرة ويضرب به المثل للمستحيلات الثلاث التي هي: الغول، والعنقاء، والخِل الوفي 
11.
• التضليل: هو الإبطال والتضييع.
12.
• عرقوب: رجل من العماليق وعد رجلًا ثمرة نخله فجاءه حين طلعت قال: دعها حتى تصير بلحًا، فلما أبلحت قال: دعها حتى تصير رطبًا، فلما أرطبت قال: دعها حتى تصير تمرًا، فلما أتمرت قطعها ليلًا ولم يعطه منها شيئًا فصار مثلًا في الخلف.
13.
• إخال: أظن
• تنويل: من النوال
14.
• تبلغها: تصل إليها
• العتاق: كرائم الإبل والخيل
• المراسيل: جمع مرسال يعني سريع السير.
15.
• عذافرة: ناقة صلبة
• الأين: الإعياء والتعب
• إرقال وتبغيل: نوعان من السير السريع شبه بسير البغال لشدته. وترتيب السير من الأبطأ إلى الأسرع كالتالي: غَنَق ثم تبغيل ثم إرقال ثم تَشَعُّر.
16.
• نضاخة: رشح العرق
• الذِّفَرى: ما تحت الأذن من الناقة من يمين الناقة وشمالها وهي أول ما يعرق وهي من الذفر وهو رائحة طيبة كانت أو غيرها ومنها مسك أذفر؛ أي: طيب الرائحة
• عرضتها: همتها؛ أي: مقصدها، وصف لطريق مطموس العلامات مجهول.
17.
• الغيوب: ما غاب عن العين
• مفرد ثور الوحش
• لهق: أبيض
• وهذا وصف لشدة بصر الناقة مع جمالها كما يرى ثور الوحش الأبيض لحدة بصره
• توقدت: اشتدت حرارة الطريق
• الحزان: جمع الحزين وهو الغليظ من الأرض
• والميل: أماكن تجمع الرمال أو المسافة البعيدة. 
18.
• مقلدها: موضع القلادة
• فَعْمٌ: ممتلئ
• مقيدها
• القيد: يعني غليظة الرقبة والأطراف.
19.
• غلباء: غليظة الرقبة، وفي القرآن: ﴿وَحَدَآئِقَ غُلۡبٗا۝٣٠﴾ [عبس: 30]؛ أي: غليظة الشجر
• وجناء: عظيمة الوجنة أي عظمة الخد
• عُلْكُوم: غليظة
• مذكرة: قوية تشبه الذكر
• في دفها: عرض صدرها
• قدامها ميل: أي خطوتها كالميل؛ أي: المسافة الطويلة.
20.
• أُطُوم: زرافة أو دابة بحرية ملسة الجلد
• لا يؤيسه: لا يؤثر في جلدها
• طِلْح: بكسر الطاء وسكون اللام القراد
• بضاحية المتنين: كل شيء معرض للشمس كما في قوله تعالى: ﴿إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعۡرَىٰ۝١١٨وَأَنَّكَ لَا تَظۡمَؤُاْ فِيهَا وَلَا تَضۡحَىٰ۝١١٩﴾ [طه: 118، 119] أي: لا تبرز للشمس، والمَتْنَيْنِ: مثنى متن وهو جانبي الصلب، والمقصود جانبي الصلب المعرَّض للشمس.
21.
• حرف: ناقة ضامرة شبهوها بالحرف لرقتها
• مهجنة: كريمة الأبوين من الإبل
• قوداء: طويلة العنق والظهر
• شمليل: خفيف الحركة.
22.
• لبان: من صدر الفرس أو الناقة يجري عليه اللب وهو الشعر
• أقراب: الخواصر جمع قرب وهي الخاصرة
• زهاليل: الملس جمع زُهلول خصرها ناعم.
23.
• عيرانة: ناقة صلبة تشبه عير الوحش في صلابته
• النحض: اللحم
• عرض: عن جانبيها
• نبات: ما حول
• الزَّور: بفتح الزَّاي الصدر
• مفتول: مدمج ومحكم.
 24.
 • مذبحها: منحرها) برطيل: حجر مستطيل. حاصل المعنى كأنما قدَّر وجهها المنتهي إلى عينيها مبتدءًا من خطمها وكذا إلى فكيها قدر حجر مستطيل.
 25.
 • تمر: أي ذنبًا أو ذيلًا مثل جريدة النخل وهو العسيب
 • ذا خصل: أي جمع خصلة من الشعر
 • غارز: الضرع
 • لم تخونه: أي لم تنقصه
 • الأحاليل: جمع إحليل وهو موضع خروج اللبن. أي ناقة لا تُحلب فيكون ذلك أقوى على المسير.
 26.
 • قنواء: أي في أنفها إحديداب أي انحناء والمذكر أقنى
 • في حرتيها: أذنيها
 • عتق: أي جمال
 • مبين: يعني ظاهر.
 27.
 • تخدي: نوع من السير
 • يسرات: قوائمها
 • لاحقة: ضامرة
 • ذوابل: جمع ذابل وهو اليابس
 • وقعهن: وفي رواية مشيهن
 • تحليل من تحلة القسم؛ أي: لبيان سرعة سيرها.
 28.
 • العجايات: جمع عُجاية وهي عصب قوائم الإبل
 • زيما: بكسر الزاي وفتح الياء متفرق
 • لم يقهن رؤوس الأكم
 • تنعيل: أي لا تحتاج لنعل لتقي خفافها من الحجارة والصخور
 • الأكم: جمع إكام ككتب وكتاب، وإكام جمع أكم كجبال وجبل، وأكم جمع أكمة كثمر وثمرة، والأكمة هي الرابية المرتفعة من الأرض. 29
 • أوبُ ذراعيها: أي سرعة حركة اليدين والرجلين في السير إذا عرقت؛ أي: وقت عرقها بسبب سرعة الحركة
 • تلفع: تلثم
 • بالقور: جمع قار وهي الموضع المرتفع من الأرض
 • العساقيل: السراب، وهذا البيت يدل على سرعة سير الناقة.
 30.
 • الحرباء: دابة تستقبل الشمس وتدور معها حيث دارت
 • مصطخدًا: محترقًا بحرِّ الشمس، وفي رواية «مُصْطَخِمًا»؛ أي: منتصبًا
 • ضاحيه: المتعرض منه للشمس
 • مملول: رماد ساخن.
 31.
 • ورق: جمع أورق وهو الأخضر إلى السواد
 • الجنادب: جمع جندب وهو ذكر الجـراد
 • قيلـوا: من القيلولة وهي أمر من الحادي للقوم لشدة الحر.
 32.
 • أي: رجع يديها كامرأة عجوز شمطاء لا أمل لها في أن تنجب غيره ومعولة: أي ذات عويل
 • نُكدٌ: من لا يعيش لهن ولد
 • مثاكيل: جمع ثكلى وهي التي فَقَدَت ولدها أو زوجها.
 33.
 • رِخْوَة: أي مسترخية
 • الضبَعين: مثنى ضَبْع بسكون الباء هو العضد وجمعه أضباع، أما ضَبُع بضم الباء فهو الحيوان المعروف وجمعه ضباع كسبع وسباع، أما قوله: ليس لها عقل بسبب شدة حزنها لما نعنى لها الناعون؛ أي: جاءها خبر موت بكرها أي: أول أولادها.
 34.
 • تَفْري: أي تمزق صدرها لفقدان عقلها بسبب شدة حزنها فلا تشعر بألم كحال هذه الناقة في سرعة حركتها وشدتها مع وجود الحر والصخور وطول الطريق فلا تشعر بالتعب
 • اللبان: الصدر
 • مدرعها: درعها وهو قميص المرأة
 • رعابيل: قِطَع ممزقة على وزن ومعنى هلاهيل.
 35.
 • الوشاة: جمع واش وهو الذي ينقل الكلام على سبيل الإفساد والفضيحة
 • جنابيها: أي جانبي سعاد المتقدم ذكرها، والحاصل أن الوشاة يريدون أن يفسدوا ما بينه وبين محبوبته بالإرجاف والتخويف بقولهم: إنك لمقتول على سبيل الشماتة.
 36.
 • ألهينك: أشغلنك
 • أي: استجار بجماعة ممن كان مع النبي ﷺ فلم يجيره أحد منهم.
 38.
 • آلة حدباء: يعني النعش
 • محمول: فلا بد من ورود حياض الموت وحمله إلى الرَّمْس وهو تراب القبر.
 39.
 • لما أنشد هذا البيت قيل: إن النبي ﷺ قال: «العفو عند الله مأمول»
 • وأوعدني: تستخدم في العقوبة، ووعدني تستعمل في الخير.
 41.
 • وإن كثرت وفي رواية أخرى: ولو كثرت، وفيه عدم الاعتراف بالذنب هيبة من النبي ﷺ وتوقيرًا وندمًا؛ ولأن الإسلام يهدم ما كان قبله من الذنوب.
 44.
 • ذي نَقمات: أي صاحب قدرة على العقاب والانتقام، كما في قوله تعالى: ﴿يَـٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ۝٧٣﴾ [التوبة: 73]
 • قيله القيل: أي أقواله أوامر.
 45.
 • لَذَاكَ أهْيَبُ، وفي رواية أخرى: لَذَاكَ أَرْهَب
 • منسوب: أي منسوب له أمور صدرت منه ومسئول عنها.
 46.
 • خَادِر: أسد داخل في الخِدر
 • بطن عَثَّر: اسم موضع
 • غِيل: موضع الأسد.
 47.
 • يلحم: يطعمها لحمًا
• ضِرْغَامَيْن: شبلين (ابني الأسد)
• مَعفور: من العفر، وهو التراب
 • خراديل: مُقَطَّع
 • أي يطعم ولديه لحمًا متربًا مقطعًا.
 48.
 • يُساور: المساورة المواثبة، والسور الوثب) مفلول: مكسور مهزوم، وفي رواية أخرى: مجدول وهو المرمي بالجدالة وهو وجه الأرض.
 49.
 • منه: الضمير في منه للخادر
 • ضامرة: أي جائعة، وفي رواية: ضامزة: ممسكة، ساكنة
 • الأراجيل: الرِّجَّالة.
 50.
 • أخُو ثِقة: رجل شجاع واثق من نفسه
 • البَزّ: السلاح (السيف والدرع والمغفر)
• الدَّرْسان: الخلقان من الثياب.
 51.
 • وفي رواية إن الرسول لسيف يستضاء به. ولما وصل كعب لهذا البيت رمى ﷺ بردته الشريفة إليه إعجابًا ورضًا.
 52.
 • عُصبة: جماعة
 • زُولوا: هاجروا من مكة إلى المدينة.
 53.
 • أنكاس: جمع نكس، وهو الرجل الضعيف
 • ولا كُشُف: جمع أكشف وهو الذي لا ترس له ولا سلاح
 • ميل: جمع أميل ومائل وهو الذي لا يُحسن الفروسية
 • معازيل: جمع أعزل وهو من لا سلاح له. والمعنى هاجروا من مكة إلى المدينة وليس فيهم ضعيف ولا عديم سلاح بل كلهم أقوياء فرسان مسلحون.
 54.
 • شُمّ: عالي الأنف، أي أعزة.
 55.
• بيض: جمع بيضاء وهي الدروع
• سوابغ: تامة
• شُكَّت: تداخلت وتشابكت حلقاتها، وفي رواية أخرى: سكت: ضاقت حلقاتها
• القفعاء: نبات على وجه الأرض له حلق
 • مجدول: محكم الصنعة.
 57.
• الزُّهر: البيض
• يعصمهم: يمنعهم
• عَرَّد بفتح العين المهملة وتشديد الراء ومعناه: فَرَّ وأعرض
• التنابيل: جمع تنبال وهو القصير. يمشون إلى الحرب مشي الجمال البيض ويمنعهم من الأعداء ضربها لهم وقت فرار القوم.
 58.
 • تهليل: أي نكوص، يقال: هَلَلَ إذا نكص
 
 ــــــــــــــــــــــــــــ
1. في نسخة: ولا.
2. في نسخة: يُمسِكُ.
3. في نسخة: الحزاز.
4. في نسخة: عبل.
5. في نسخة: وَقْعُهُنَّ.
6. في نسخة: شد النهار ذراعًا عيطل نصف. أي: كأن أوب ذراعيها وقت ارتفاع النهار ذراعًا مثنى ذراع امرأة عيطل أي طويلة. نصف: متوسطة السن.
7. في نسخة: حواليها وهي بمعنى جنابيها.
8. في نسخة: فيه.
9. في نسخة: فتية.
10. في نسخة: تعصمهم.
11. في نسخة: غَرَّد. بمعنى أطرب بالرجز والشعر فلا معنى لها هنا كما قاله ابن هشام في شرحه.
''',
    content: '''
Fبَانَتْ سُعَادُ فَقَلْبِي الْيَومَ مَتْبُولُ __ مُتَيَّمٌ إِثْرَهَا لَمْ يُفْدَ مَكْبُولُX
Fوَمَا سُعَادُ غَدَاةَ الْبَيْنِ إِذْ رَحَلُواْ __ إلَّا أَغَنُّ غَضِيضُ الطَّرْفِ مَكْحُولُX
Fهَيْفَاءُ مُقْبِلَةً عَجْزَاءُ مُدْبِرَةً __ لَا يُشْتَكَى قِصَرٌ مِنْهَا وَلَا طُولُX
Fتَجْلُو عَوَارِضَ ذِي ظَلْمٍ إِذَا ابْتَسَمَتْ __ كَأَنَّهُ مُنْهَلٌ بالرَّاحِ مَعْلُولُX
Fشُجَّتْ بِذِي شَبِمٍ مِنْ ماءِ مَحْنِيَةٍ __ صَافٍ بأَبْطَحَ أَضْحَى وَهْوَ مَشْمُولُX
Fتَنْفِي الرِّيَاحُ القَذَى عَنْهُ وَأَفْرَطَهُ __ مِنْ صَوْبِ سَارِيَةٍ بِيضٌ يَعَالِيلُX
Fأَكْرِمْ بِهَا خُلَّةً لَوَ انَّهَا صَدَقَتْ __ مَوعُودَهَا أَوْ لَوَ أنَّ النُّصْحَ مَقْبُولُX
Fلَكِنَّهَا خُلَّةٌ قَدْ سِيطَ مِن دَمِهَا __ فَجْعٌ وَوَلْعٌ وَإِخْلَافٌ وَتَبْدِيلُX
Fفَمَا تَدُومُ عَلَى حَالٍ تَكُونُ بِهَا __ كَمَا تَلَوَّنُ فِي أَثْوَابِهَا الْغُولُX
Fفَلَا[^^1] تَمَسَّكُ بالْعَهْدِ الَّذِي زَعَمَتْ __ إِلَّا كَمَا تُمْسِكُ[^^2] الْمَاءَ الغَرَابِيلُX
Fفَلَا يَغُرَّنْكَ مَا مَنَّتْ وَمَا وَعَدَتْ __ إِنَّ الْأَمَانِيَّ وَالْأَحْلَامَ تَضْلِيلُX
Fكَانَتْ مَوَاعِيدُ عُرْقُوبٍ لَهَا مَثَلًا __ وَمَا مَوَاعِيدُهَا إِلَّا الْأَبَاطِيلُX
Fأَرْجُو وَآمَلُ أَنْ تَدْنُو مَوَدَّتُهَا __ وَمَا إِخَالُ لَدَيْنَا مِنْكِ تَنْوِيلُX
Fأَمْسَتْ سُعادُ بِأَرْضٍ لَا تُبَلِّغُهَا __ إِلَّا الْعِتَاقُ النَّجِيبَاتُ الْمَراسِيلُX
Fوَلَنْ يُبَلِّغَهَا إِلَّا عُذَافِـرَةٌ __ فِيهَا عَلَى الْأَيْنِ إِرْقَالٌ وَتَبْغِيلُX
Fمِنْ كُلِّ نَضَّاخَةِ الذِّفْرَى إِذَا عَرِقَتْ __ عُرْضَتُهَا طَامِسُ الأعْلَامِ مَجْهُولُX
Fتَرْمِي الغُيُوبَ بِعَيْنَيْ مُفْرَدٍ لَهِقٍ __ إِذَا تَوَقَّدَتِ الحِزَّانُ[^^3] وَالْمِيلُX
Fضَخْمٌ مُقَلَّدُها فَعْمٌ[^^4] مُقَيَّدُها __ فِي خَلْقِهَا عَنْ بَناتِ الفَحْلِ تَفْضِيلُX
Fغَلْبَاءُ وَجْنَاءُ عُلْكُومٌ مُذَكَّرةٌ __ فِي دَفِّهَا سَعَةٌ قُدَّامُهَا مِيلُX
Fوَجِلْدُهَا مِنْ أُطُومٍ لَا يُؤَيِّسُهُ __ طِلْحٌ بِضَاحِيَةِ المَتْنَيْنِ مَهْزُولُX
Fحَرْفٌ أَخُوهَا أَبُوهَا مِنْ مُهَجَّنَة __ وَعَمُّهَا خَالُهَا قَوْدَاءُ شِمْلِيلُX
Fيَمْشِي الْقُرَادُ عَلَيْهَا ثُمَّ يُزْلِقُهُ __ مِنْهَا لَبَانٌ وَأَقْرَابٌ زَهَالِيلُX
Fعَيْرَانَةٌ قُذِفَتْ بِالنَّحْضِ عَنْ عُرُضٍ __ مِرْفَقُهَا عَنْ نَبَاتِ الزَّورِ مَفْتُولُX
Fكأنَّمَا فَاتَ عَيْنَيْهَا وَمَذْبَحُهَا __ مِنْ خَطْمِهَا وَمِنَ اللَّحْيَيْنِ بِرْطِيلُX
Fتُمِرُّ مِثْلَ عَسِيبِ النَّخْلِ ذَا خُصَلٍ __ فِي غَارِزٍ لَمْ تُخَوَّنْهُ الْأَحَالِيلُX
Fقَنْواءُ في حُرَّتَيْهَا لِلْبَصِيرِ بِهَا __ عِتْقٌ مُبينٌ وَفِي الْخَدَّيْنِ تَسْهِيلُX
Fتُخْدِي عَلَى يَسَرَاتٍ وَهْيَ لَاحِقَةٌ __ ذَوابِلٌ مَسُّهُنَّ[^^5] الْأَرْضَ تَحْلِيلُX
Fسُمْرُ العُجَايَاتِ يَتْرُكْنَ الحَصَى زِيَمًا __ لَمْ يَقِهِنَّ رُءُوسَ الأُكْمِ تَنْعِيلُX
Fكَأَنَّ أَوْبَ ذِرَاعَيْهَا إِذَا عَرِقَتْ __ وَقَدْ تَلَفَّعَ بِالقُورِ العَسَاقِيلُX
Fيَوْمًا يَظَلُّ بِهِ الْحِرْبَاءُ مُصْطَخِدًا __ كَأَنَّ ضَاحِيهِ بالشَّمْسِ مَمْلُولُX
Fوَقَالَ لِلْقَوْمِ حَادِيهِمْ وَقَدْ جَعَلَتْ __ وُرْقُ الجَنادِبِ يَرْكُضْنَ الحَصَى قِيلُواْX
Fأَوْبُ يَدَيْ فَاقِدٍ شَمْطَاءَ مُعْوِلَةٍ[^^6] __ قَامَتْ فَجَاوَبَهَا نُكْدٌ مَثَاكِيلُX
Fنَوَّاحَةٌ رِخْوَةُ الضَّبْعَيْنِ لَيْسَ لَهَا __ لَمَا نَعَى بِكْرَهَا النَّاعُونَ مَعْقُولُX
Fتَفْرِي اللَّبَانَ بِكَفَّيْهَا وَمِدْرَعُهَا __ مُشَقَّقٌ عَنْ تَرَاقِيهَا رَعَابِيلُX
Fتَسْعَى الوُشَاةُ بِجَنَابَيْهَا[^^7] وَقَوْلُهُمُ __ إِنَّكَ يَا ابْنَ أَبِي سُلْمَى لَمَقْتُولُX
Fوَقَالَ كُلُّ خَلِيلٍ كُنْتُ آمَلُهُ __ لَا أُلْهِيَنَّكَ إِنِّي عَنْكَ مَشْغُولُX
Fفَقُلْتُ خَلُّواْ سَبِيلِي لَا أَبَا لَكُمُ __ فَكُلُّ مَا قَدَّرَ الرَّحْـمَـنُ مَفْعُولُX
Fكُلُّ ابْنِ أُنْثَى وَإِنْ طَالَتْ سَلَامَتُهُ __ يَوْمًا عَلَى آلَةٍ حَدْبَاءَ مَحْمُولُX
Fأُنْبِئْتُ أَنَّ رَسُولَ اللهِ أَوْعَدَنِي __ وَالْعَفْوُ عِنْدَ رَسُولِ اللهِ مَأْمولُX
Fوقَدْ أَتَيْتُ رَسُولَ اللهِ مُعْتَذِراً __ وَالْعَفْو عِنْدَ رَسُولِ اللهِ مَقْبولُX
Fمَهْلًا هَدَاكَ الَّذِي أَعْطَاكَ نَافِلَةَ __ الفُرْقَانِ فِيهَا[^^8] مَوَاعِيظٌ وَتَفْصِيلُX
Fلَا تَأْخُذَنِّي بِأَقْوَالِ الْوُشَاةِ وَلَمْ __ أُذْنِبْ وَلَوْ كَـثُـرَتْ فِيَّ الْأَقَاوِيلُX
Fلَقَدْ أَقُومُ مَقَامًا مَا لَوْ يَقُومُ بِهِ __ أَرَى وَأَسْمَعُ مَا لَوْ يَسْمَعُ الْفِيلُX
Fلَظَلَّ يَرْعُدُ إِلَّا أَنْ يَكُونَ لَـهُ __ مِنَ الرَّسُولِ بِإِذْنِ اللهِ تَنْوِيلُX
Fحَتَّى وَضَعْتُ يَمِينِي لَا أُنَازِعُهُ __ فِي كَفِّ ذِي نَقِمَاتٍ قِيلُهُ الْقِيلُX
Fلَذَاكَ أَهْيَبُ عِنْدِي إِذْ أُكَلِّمُهُ __ وَقِيلَ إِنَّكَ مَنْسُوبٌ وَمَسْئُولُX
Fمِنْ خَادِرٍ مِّن لِّيُوثِ الْأُسْدِ مَسْكَنُهُ __ مِنْ بَطْنِ عَثَّرَ غِيلٌ دُونَهُ غِيلُX
Fيَغْدُو فَيُلْحِمُ ضِرْغَامَيْنِ عَيْشُهُمَا __ لَحْمٌ مِنَ الْقَوْمِ مَعْفُورٌ خَرَادِيلُX
Fإِذَا يُسَاوِرُ قِرْنًا لَا يَحِلُّ لَهُ __ أَنْ يَتْرَكَ الْقِرْنَ إِلَّا وَهْوَ مَفْلُولُX
Fمِنْهُ تَظَلُّ سِبَاعُ الْجَوِّ ضَامِرَةً __ وَلَا تَمَشَّى بِوَادِيهِ الْأَرَاجِيلُX
Fوَلَا يَزَالُ بِوَادِيهِ أَخُو ثِقَةٍ __ مُطَرَّحُ الْبَـزِّ والدِّرْسَانِ مَأْكُولُX
Fإِنَّ الرَّسُولَ لَنُورٌ يُسْتَضَاءُ بِهِ __ مُهَنَّدٌ مِنْ سُيُوفِ اللهِ مَسْلُولُX
Fفِي عُصْبَةٍ[^^9] مِنْ قُرَيْشٍ قَالَ قَائِلُهُمْ __ بِبَطْنِ مَكَّةَ لَمَّا أَسْلَمُواْ زُولُواْX
Fزَالُواْ فَمَا زَالَ أَنْكَاسٌ وَلَا كُشُفٌ __ عِنْدَ اللِّقَاءِ وَلَا مِيلٌ مَعَازِيلُX
Fشُمُّ الْعَرَانِينِ أَبْطَالٌ لَبُوسُهُمُ __ مِن نَسْجِ دَاودَ فِي الْهَيْجَا سَرَابِيلُX
Fبِيضٌ سَوَابِغُ قَدْ شُكَّتْ لَهَا حِلَقٌ __ كَأنَّهَا حَلَقُ الْقَفْعَاءِ مَجْدُولُX
Fلَا يَفْرَحُونَ إِذَا نَالَتْ رِمَاحُهُمُ __ قَوْمًا وَلَيْسُواْ مَجَازِيعًا إِذَا نِيلُواْX
Fيَمْشُونَ مَشْيَ الْجِمَالِ الزُّهْرِ يَعْصِمُهُمْ[^^10] __ ضَرْبٌ إِذَا عَرَّدَ[^^11] السُّودُ التَّنَابِيلُX
Fلَا يَقَعُ الطَّعْنُ إِلَّا فِي نُحُورِهُمُوَمَا __ لَهُمْ عَنْ حِيَاضِ الْمَوْتِ تَهْلِيلُX


قال كَعْبُ بْنُ زُهَيْرٍ: فَلَمَّا خَتَمْتُ الْقَصِيدَةَ رَمَى عَلَيَّ رَسُولُ اللهِ صلى الله عليه وسلم بُرْدَةً كَانَتْ عَلَيْهِ، فَلَمَّا كَانَ زَمَانُ مُعَاوِيَةَ رضي الله عنه بَعَثَ إِلَى كَعْبِ بْنِ زُهَيْرٍ: (بِعْنَا بُرْدَةَ رَسُولِ اللهِ صلى الله عليه وسلم بِعَشْرَةِ آلَافٍ)، فَوَجَّهَ إِلَيْهِ الْجَوَابَ: مَا كُنْتُ لِأُوثِرَ بِثَوْبِ رَسُولِ اللهِ صلى الله عليه وسلم أَحَدًا. فَلَمَّا مَاتَ كَعْبٌ بَعَثَ مُعَاوِيَةُ إِلَى أَوْلَادِهِ بِعِشْرِينَ أَلْفًا وَأَخَذَ مِنْهُمُ الْبُرْدَةَ. وَهِيَ عِنْدَ السَّلَاطِينِ وَفِي الْمَتَاحِفِ إِلَى عَصْرِنَا هَذَا، وَقَدْ رُوِيَ أَنَّهُ لَمَّا أَنْشَدَ كَعْبٌ هَذَا الْبَيْتَ الْأَخِيرَ نَظَرَ رَسُولُ اللهِ صلى الله عليه وسلم إِلَى مَنْ كَانَ بِحَضْرَتِهِ مِنْ قُرَيْشٍ كَأَنَّهُ يُومِئُ إِلَيْهِمْ أَنِ اسْمَعُواْ. ويؤخذ من هذا ومن نظيره فيما تقدم من إهداء النبي صلى الله عليه وسلم لكعب بردته استحباب سماع هذه القصيدة؛ لِمَا اشتملت عليه من نعوت الحضرة النبوية وأوصاف أصحابه المرضية وغيرها من الفضائل كمعرفة القواعد العربية والفوائد الأدبية. والله أعلم.
''');

const duaaEstighatha = Zikr(
  title: 'دعاء الاستغاثة',
  notes: '''
 دعاء الاستغاثة للعارف بالله سيدي محمد بن ناصر الدِّرْعِيِّ رضي الله عنه المتوفى 1085هـ دفين زاوية بتَا مَكْرُوت بالمغرب الأقصى

تقرأ مع الوظيفة يوم الجمعة
  ''',
  url:
      "https://ia600908.us.archive.org/16/items/hadra_yousria/%D8%AF%D8%B9%D8%A7%D8%A1%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%BA%D8%A7%D8%AB%D8%A9%20%D8%A7%D9%84%D8%AD%D8%B6%D8%B1%D8%A9.mp3",
  content: '''
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ. ﴿إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ﴾

Fيَـا مَـنْ إِلَـىٰ رَحْمتـهِ الْمَفَــرُّ __ وَمَـنْ إِلَيْــه يَلْجَــأُ المُضْطَــرُّX
Fوَيَا قَرِيبَ الْعَفْــوِ يَا مَوْلَاهُ __ وَيا مُغِيـثَ كُـلِّ مَنْ دَعَـاهُX
Fبِكَ اسْتَغَثْنَـــا يَا مُغِيثَ الضُّعَفَا __ فَحَسْبُنَــــا يَا رَبِّ أَنْـتَ وَكَفَـىٰX
Fفَلَا أَجَلَّ مِنْ عَظِيــمِ قُدْرَتِكَ __ وَلَا أَعَزَّ مِنْ عَزِيزِ سَطْوَتِكَX
Fلِعزِّ مُلْكِكَ الْمُلُوكُ تَخْضَــعُ __ تَخْفِضُ قَدْرَ مَنْ تَشَـا وَتَرْفَعُX
Fوَالْأَمْـرُ كُلُّهُ إِلَيْكَ رَدُّهُ __ وَبِيَدَيْكَ حَلُّهُ وَعَقْدُهُX
Fوَقَدْ رَفَعْنَــا أَمْرَنَـا إِلَيْكَ __ وَقَدْ شَكَوْنَــا ضُعْفَنَــا عَلَيْكَX
Fفَارْحَمْنَا يَا مَنْ لَا يَزَالُ عَالِمًا __ بِضُــعْفِنَـــا وَلَا يَـزَالُ رَاحِمًاX
Fانْظُـرْ إِلَىٰ مَا مَسَّنَــــا مِنَ الْوَرَىٰ __ فَحَالُنَـا مِن بَيْنِهِمْ كَمَا تَرَىٰX
Fقَدْ قَـلَّ جَمْعُنَــــا وَقَلَّ وَفْرُنَا __ وَانْحَطَّ مَا بَيْنَ الْجُمُوعِ قَدْرُنَـاX
Fوَاسْتَضْعَفُــونَا شَـوْكَةً وَشِـدَّةً __ وَاسْتَنْقَصُونَـا عُدَّةً وَعِدَّةًX
Fفَنَحْنُ يَـــا مَنْ مُلْكُـــهُ لاَ يُسْلَبُ __ لُذْنَا بِجَـاهِكَ الَّذِي لَا يُغْلَبُX
Fإِلَيْكَ يَا غَــوْثَ الْفَقِيرِ نَسْــتَنِدْ __ عَلَيْـكَ يَا كَهْفَ الضَّعِيفِ نَعْتَمِـدْX
Fأَنْتَ الَّذِي نَدْعُو لِكَشْفِ الْغَمَرَاتْ __ أَنْتَ الَّذِي نَرْجُـو لدَفْعِ الحـسَرَاتْX
Fأَنْتَ الْعِنَـــايَةُ الَّتِي لاَ نَرْتَجِـي __ حِمَــايَةً مِـنْ غَيْـر بَـابِهَـا تَجِـيX
Fأَنْتَ الَّذِي نَسْعَىٰ بِبَـــابِ فَضْلِهِ __ أَكْـــرَمُ مَـنْ أَغْنَـىٰ بِفَيْـضِ نَيْلِهِX
Fأَنْتَ الِّـذِي تَهْدِي إِذَا ضَلَلْنَا __ أَنْـتَ الَّـذِي تَعْفُو إذَا زَلَلْنَـاX
Fوَسِعْتَ كُلَّ مَا خَلَقْتَ عِلْمًا __ وَرَأفَــةً وَرَحْمَـــــةً وَحِلْمًاX
Fوَلَيْسَ مِنَّا فِي الْوُجُودِ أَحْقَرُ __ وَلاَ لِمَا عِنْــدَكَ مِنَّـا أَفْقَرُX
Fيَا وَاسِعَ الإِحْسَـــانِ يَا مَنْ خَيْرُهُ __ عَمَّ الْوَرَىٰ وَلاَ يُنَادَىٰ غَيْـرُهُX
Fيَا مُنْقِذَ الْغَـرْقَىٰ وَيَا حَنَّانُ __ يَا مُنْجِيَ الْـهَلْكَىٰ وَيَا مَنَّـانُX
Fضَاقَ النِّطَاقُ يَا سَمِيـعُ يَا مُجِيبْ __ عَزَّ الدَّوَاءُ يَا سَرِيــــعُ يَا قَرِيـبْX
Fوَقَدْ مَدَدْنَـــــا رَبَّنَا الأَكُفَّ __ وَمِنْكَ رَبَّنَـــا رَجَـــوْنَا اللُّطْـفَX
Fفَالْطُـفْ بِنَـــا فِيمَــا بِهِ قَضَيْتَ __ وَرَضِّنَـــــا بِمَـــا بِهِ رَضَيْـتَX
Fوَأَبْدِلِ اللَّهُمَّ حَـالَ الْعُسْـــرِ __ بِاْليُسْرِ وَامْـدُدْنَا بِرِيحِ النَّصْـرِX
Fوَاجْعَلْ لَنَـا عَلَىٰ الْبُغَاةِ الْغَلَبَة __ وَاقْصُر أَذَىٰ الشَّرِّ عَلَىٰ مَنْ طَلَبَـهX
Fوَاقْهَرْ عِدَانَا يَا عَزِيزُ قَهْرَا __ يَفْصِـمُ حَبْلَهُــمْ وَيُصْمِـي الظَّهْرَاX
Fوَاعْكِسْ مُرَادَهُمْ وَخَيِّبْ سَعْيَهُمْ __ وَاهْـزِمْ جُيُوشَهُـمْ وَأَفْسِـدْ رَأيَهُـمْX
Fوَعَجِّــلِ اللَّهُمَّ فِيهِمْ نِقْمَتَـــكْ __ فَـإِنَّهُـمْ لَا يُعْجِــــزُونَ قُـدْرَتَـكْX
Fيَا رَبِّ يَا رَبِّ بِحَبْـلِ عِصْمَتِكْ __ قَدِ اعْتَصَـمْنَـــا وَبِعِـــزِّ نُصْـرَتِكْX
Fفَكُنْ لَنَــــا وَلَا تَكُنْ عَلَيْنَــــا __ وَلَا تَكِـلْنَــا طَـرْفَـةً إِلَيْنَـاX
Fفَمَـا أَطَقْنَـا قُـــوَّةً لِلدَّفْــعِ __ وَلا اسْــتَـطَعْنَا حِيلَةً للنَّفْعِX
Fوَمَا قَصَدْنَــا غَيْرَ بَابِكَ الْكَرِيمْ __ وَمَا رَجَوْنَـا غَيْـرَ فَضْلِـكَ الْعَمِيـمْX
Fفَمَا رَجَتْ مِنْ خَيْرِكَ الظُّنُونُ __ بِنَفْـسِ مَـا تَقُولُ كُـنْ يَكُونُX
Fيَا رَبِّ يَا رَبِّ بِكَ التَّـوَصُّلُ __ لِمَـــا لَـدَيْـكَ وَبِــكَ التَّــــوَسُّـلُX
Fيَا رَبِّ أَنْتَ رُكْنُنَـــــــا الرَّفِيعُ __ يَا رَبِّ أَنْـتَ حِصْـنُنَـــا الْمَنِـيــعُX
Fيَا رَبِّ يَا رَبِّ أَنِلْنَــــــا الْأَمْنَا __ إِذَا ارْتَحَـلْنَــــــا وَإِذَا أَقَـمْـنَــاX
Fيَا رَبِّ وَاحْفَظْ زَرْعَنَا وَضَرْعَنَا __ وَاحْفَـظْ تِجَـارَنَــا وَوَفِّـرْ جَمْعَنَــاX
Fوَاجْعَـلْ بِلَادَنَا بِلَادَ الـدِّيـنِ __ وَرَاحَـةَ الْمُحْتَاجِ وَالْمِسْـكِينِX
Fوَاجْعَـلْ لَهَا بَيْنَ الْبِلَادِ صَوْلَـةً __ وَحُـرْمَـةً وَمَنْـعَــةً وَدَوْلَــةًX
Fوَاجْعَلْ مِنَ السِّـرِّ المَصُوِنِ عِزَّهَا __ وَاجْعَلْ مِنَ السِّتْرِ الْجَمِيلِ حِرْزَهَاX
Fوَاجْعَلْ بِصَــادٍ وَبِقَافٍ وَبِنُونْ __ أَلْفَ حِجَـابٍ مِنْ وَرَائِهَا يَكُونْX
Fبِجَــاهِ نُـــورِ وَجْهِكَ الْكَرِيمِ __ وَجَــاهِ سِـــرِّ مُلْكِــكَ الْعَظِيمِX
Fوَجَاهِ لَا إِلَـهَ إِلَّا اللّٰهُ __ وَجَاهِ خَيْرِ الْخَلْقِ يَا رَبَّـــاهُX
Fوَجَاهِ مَا بِهِ دَعَاكَ الأَنْبِيَــاءُ __ وَجَــاهِ مَا بِهِ دَعَاكَ الْأَوْلِيَـاءُX
Fوَجَـــاهِ قَدْرِ الْقُطْبِ وَالْأَوْتَـادِ __ وَجَـــاهِ حَالِ الْجَرْسِ وَالْأَفْــرَادِX
Fوَجَـــاهِ الْأَخْيَـارِ وَجَاهِ النُّجَبَا __ وَجَـاهِ الأَبْدَالِ وَجَاهِ النُّقَبَـــاX
Fوَجَـاهِ كُلِّ عَــابِدٍ وَذَاكِرْ __ وَجَـــاهِ كُلِّ حَــامِـدٍ وَشَاكِرْX
Fوَجَـاهِ كُـلِّ مَنْ رَفَعْتَ قَدْرَهُ __ مِمَّنْ سَتَـرْتَ أَوْ نَشَـــرْتَ ذِكْـرَهُX
Fوَجَاهِ آيَاتِ الْكِتَابِ الْمُحْكَمِ __ وَجَـــاهِ الاِسْمِ الأَعْظَمِ المعَظَّمِX
Fيَا رَبِّ يَا رَبِّ وَقَفْنَـا فُقَرَا __ بَيْنَ يَدَيْكَ ضُعَفَاءَ حُقَـرَاX
Fوَقَدْ دَعَوْنَـاكَ دُعَـاءَ مَنْ دَعَا __ رَبًّا كَرِيمًا لَا يَـرُدُّ مَـنْ سَعَىٰX
Fفَاقْبَلْ دُعَاءَنَا بِمَحْضِ الفَضْــلِ __ قَبُـولَ مَـنْ أَلْغَىٰ حِسَـابَ الْعَـدْلِX
Fوَامْنُنْ عَلَيْنَـا مِنَّـةَ الْكَرِيـمِ __ وَاعْطِـفْ عَلَيْنَـــا عَطْفَـةَ الحلِيمِX
Fوَانْشُرْ عَلَيْنـــا يَا رَحِيمُ رَحْمَتَكْ __ وَابْسُـطْ عَلَيْنَــا يَا كَرِيـمُ نِعْمَتَـكْX
Fوَخِرْ لَنَـا فِي سَائِرِ الْأَقْوَالِ __ وَاخْتَرْ لَنَـا فِي سَائِـرِ الْأَفْعَـالِX
Fيَا رَبِّ وَاجْعَلْ دَأْبَنَــا التَّمَسُّــكَا __ بِـالسُّــنَّـة الْغَــرَّاءِ وَالتَّنَسُّكَـاX
Fوَاحْصُرْ لَنَا أَغْراضَنَـا المختَلِفَة __ فِيـكَ وَعَرِّفْنَـا تَمَـامَ المعْـرِفَةX
Fوَاجْمَعْ لَنَـا مَا بَيْنَ عِلْمٍ وَعَمَـلْ __ وَاصْرِفْ إِلَىٰ دَارِ الْبَقَا مِنَّـا الْأَمَـلْX
Fوَانْهَجْ بِنَــا يَا رَبِّ نَهْجَ السُّعَدَا __ وَاخْتِـمْ لَنَـا يَـا رَبِّ خَتْـمَ الشُّهَدَاX
Fوَاجْعَـــلْ بَنِينا فُضَلاَءَ صُلَحَـا __ وَعُلَمَـاءَ عَامِلِيــــنَ نُصَحَــاX
Fوَأَصْلحِ اللَّهُمَّ حَـالَ الْأَهْلِ __ وَيَسِّـرِ اللَّهُـمَّ جَمْـعَ الشَّمْــلِX
Fيَا رَبِّ وَافْتَـحْ فَتْحَكَ الْمُبِينَ __ لِمَـنْ تَـوَلَّـىٰ وَأَعَــزَّ الدِّيـنَX
Fوَانصُرْهُ يَا ذَا الطَّوْل وَانْصُرْ حِزْبَهُ __ وَامْلأْ بِمَا يُرْضِيـكَ عَنْـهُ قَلْبَهُX
Fيَا رَبِّ وَانْصُـرْ دِينَنَا الْمُحَمَّــدِي __ وَاجْعَـلْ خِتَــامَ عِـزّهِ كَمَـا بُـدِيX
Fوَاحْفَظْهُ يَا رَبِّ بِحِفْظِ الْعُلَمَـا __ وارْفَعْ مَنَـارَ نُـورِهِ إِلَىٰ السَّمَـاX
Fوَاعْفُ وَعَافِ وَاكْفِ وَاغْفِرْ ذَنْبَنَا __ وَذَنْــبَ كُــلِّ مُسْلِـمٍ يَا رَبَّنَـاX
Fوَصَـلِّ يَا رَبِّ عَـلَـىٰ الْمُخْتَـارِ __ صَلَاتَـكَ الكَامِلَـةَ الْمِقْـــدَارِX
Fصَلَاتَكَ الَّتِـي تَفِـي بِأَمْــرِهِ __ كَمَـا يَلِيقُ بِـارْتِفَاعِ قَدْرِهِX
Fثُمَّ عَلَـىٰ الآلِ الْكِرَامِ وَعَلَـىٰ __ أَصْحَابِهِ الْغُـرِّ وَمَنْ لَهُمْ تَـلَاX
Fوَالْحَمْدُ للّٰه الـذَّي بِحَمْدِهِ __ يَبْلُـغُ ذُو الْقَصْـدِ تَمَـامَ قَصْــدِهِX
''',
);
