import 'package:yosria/models/azkar_models.dart';

const tareeqaBiosCollection = [drYousryGabrBio, abdallahGomariBio];

const drYousryGabrBio = Zikr(
    title: 'السيرة الذاتية لفضيلة الدكتور يسري جبر',
    notes:
        'الفقير إلى الله يسري رشدي السيد جبر القاهري مولدا ونشأة، الحسني نسبا، السني عقيدة، الشافعي مذهبا، الصديقي طريقة، الشاذلي مشربا، الأزهري إجازة.',
    content: '''
الفقير إلى الله يسري رشدي السيد جبر القاهري مولدا ونشأة، الحسني نسبا، السني عقيدة، الشافعي مذهبا، الصديقي طريقة، الشاذلي مشربا، الأزهري إجازة.
## المولد والنشأة
ولدت في 23 / 9 / 1954 بحي روض الفرج بالقاهرة تلقيت التعليم بالمدارس الحكومية حتى التحقت بكلية الطب جامعة القاهرة وتخرجت منها بتقدير جيد جدا مع مرتبة الشرف ديسمبر 1978م وحصلت على ماجستير الجراحة العامة وجراحة الأوعية الدموية من جامعة القاهرة نوفمبر 1983 وحصلت على دكتوراه الجراحة العامة من جامعة القاهرة مايو 1991م وزمالة جمعية الجراحين الدولية في مايو 1992م ثم التحقت بكلية الشريعة والقانون جامعة الأزهر 1992م وحصلت على ليسانس الشريعة الإسلامية بتقدير جيد جدا 1997م .
## حفظ القرآن الكريم
بدأت حفظ القرآن الكريم برواية حفص عن عاصم أثناء دراستي بكلية الطب على يد فضيلة الشيخ عبد الحكيم بن عبد السلام خاطر ( حاليا ضمن لجنة مراجعة القرآن الكريم بالمدينة المنورة ) وختمته حفظا سنة 1985 وعلى يد الشيخ محمد آدم وختمت على الشيخ محمد بدوي السيد بالسند المتصل إلى حفص الذي قرأ على عاصم ابن أبي النجود عن أبي عبد الرحمن عبد الله بن حبيب السلمي وزر بن حبيش – الأول عن عثمان بن عفان وعلي بن أبي طالب وأبي بن كعب وزيد بن ثابت وعبد الله بن مسعود رضي الله عنهم ، والثاني عن عثمان بن عفان وعبد الله بن مسعود رضي الله عنهما – وهم عن النبي صلى الله عليه وسلم سيد الأنام وخاتم المرسلين عن أمين الوحي جبريل عليه السلام عن اللوح المحفوظ عن رب العزة سبحانه وتعالى جل جلاله وتقدست أسماؤه.

وكذلك تم ختام القرآن بالمدينة المنورة على يد فضيلة الشيخ عبد الحكيم بن عبد السلام خاطر وأجازني برواية حفص عن عاصم، وكان قد أجازني الشيخ عامر عثمان أثناء دراستي بالكلية، وقرأت عليه حزب من سورة البقرة وأجازني الباقي
وقد ختمت قراءة ورش على الشيخ محمد بدوي، وختمت قراءة نافع (قالون وورش) على الشيخ محمد آدم، وكذلك قراءة ابن كثير المكي (قنبل والبزي) من أول المصحف حتى آخر سورة التوبة ثم توفي رحمه الله. كما أجازني الشيخ عبد الفتاح مدكور النمرسي
## المشايخ
حضرت على الشيخ الحافظ التيجاني موطأ الإمام مالك من سنة 1976 حتى سنة 1978 ثم انتقل إلى رحمة الله حضرت على الشيخ محمد نجيب المطيعي صاحب تكملة المجموع بشرح المهذب من سنة 1978 حتى سنة 1981 صحيح البخاري وحاشيتي قليوبي وعميرة على شرح المنهاج في الفقه الشافعي وإحياء علوم الدين للإمام الغزالي وأجازني بأسانيده في الفقه والحديث.

حضرت على السيد الحجة العارف بالله سيدي عبد الله ابن الصديق الغماري الحسني كتاب الشمائل للترمذي في رمضان 1400 – 1980 بمسجد رشدي بالدقي بالإسناد المتصل وأخذت منه الطريقة الصديقية الدرقاوية الشاذلية بالقاهرة في نفس العام وكذلك حضرت عليه في أجزاء من الموطأ للإمام مالك واللمع في علم الأصول بقراءة الشيخ د: علي جمعة عليه واستفدت بصحبته كلما جاء إلى مصر بتوجيهاته ودعواته وفتاويه ومؤلفاته حتى توفاه الله بطنجة في 21 شعبان 1413 هـ 12 / 2/1993 يوم الجمعة ووفقني الله وزرته في ضريحه وزاويته بطنجة.

وتعرفت على فضيلة الشيخ أحمد المرسي من علماء الأزهر الشريف النقشبندي طريقة وكان صديقا لفضيلة الشيخ عبد الله الصديق الغماري وزرته كثيرا واستفدت منه لطائف ومعارف فجزاه الله خيرا ورحمه الله.

وأجازني فضيلة الأستاذ الإمام محمد زكي الدين إبراهيم الحسيني نسباً الشاذلي طريقةً رائد العشيرة المحمدية إجازة عامة بالمناولة و المصافحة بجميع مروياته في الكتب الستة ومسند الشافعي والأم ومسند أبي حنيفة وسنن البيهقي ومعاجم الطبراني الثلاثة وابن عبد البر وعبد الرزاق وموطأ مالك ومصنفات القاضي عياض والإمام النووي والحاكم والشوكاني والديلمي وابن عابدين وابن قدامة وابن رجب وابن السني والصنعاني والنبهاني والشعراني وابن القيم والسنوسي الكبير والعيدروس وغيرهم وذلك في رمضان 1418 يناير 1998.

وحضرت للشيخ اسماعيل صادق العدوي شيخ الجامع الأزهر موطأ الإمام مالك بمسجد سيدي أحمد الدردير بالأزهر وكذا تفسير بعض سور من القرآن الكريم بالمسجد الحسيني بالقاهرة ولازمته عدة سنوات وسافرت معه إلى صعيد مصر لزيارة الصالحين وتعلمت منه حقائق كثيرة في علم التصوف ولمحات ولفتات روحانية عالية ودعا لي كثيرا فجزاه الله عني وعن المسلمين خيرا ورحمه الله رحمة واسعة.

حضرنا على فضيلة الأستاذ الدكتور علي جمعة أستاذ ورئيس قسم أصول الفقه بكلية الدراسات الإسلامية بالأزهر وكان تلميذا للسيد عبد الله الصديق الغماري كتاب الورقات للإمام الجويني في علم الأصول وجمع الجوامع بالأزهر الشريف وقراءة صحيحي البخاري ومسلم بالأسانيد المتصلة وأجزاء من سنن أبي داود ومقدمة ابن الصلاح في علوم الحديث ومغني المحتاج للخطيب الشربيني في الفقه الشافعي ومسائل في الأشباه والنظائر للسيوطي وشرح الخريدة البهية في علم التوحيد للشيخ أحمد الدردير وفتح القريب المجيب لابن قاسم الغزي على متن الغاية والتقريب وحضرنا مع فضيلته على السيد عبد الله الصديق الغماري في كتب اللمع والشمائل ومناقشة مسائل في أصول الفقه وفروع كثيرة في الفقه ومازلت أحضر دروس فضيلته في مسجد السلطان حسن والأزهر الشريف وأجازنا في كتب الحديث والمسانيد وفقه الشافعية ومازلت أحضر له وأستفيد منه فجزاه الله عنا خيرا وبارك الله لنا فيه ونفعنا بعلومه في الدارين.

وقرأت النحو وأجزاء من فقه الشافعية على الشيخ كمال العناني مدرس الفقه بكلية الشريعة أثناء دراستي بكلية الشريعة.

وكذلك قرأت الأحوال الشخصية ومواضيع من فقه المعاملات على الشيخ د: نصر فريد واصل مفتي مصر سابقا وذلك أثناء دراستي بكلية الشريعة.


التقيت بمكة بالسيد محمد بن علوي المالكي الحسني بمنزله عدة مرات وأجازني في مؤلفاته فجزاه الله عني وعن المسلمين خيرا.

أجازني مسند الإسكندرية الشيخ الفاضل الأستاذ محمد إبراهيم عبد الباعث الحسيني الكتاني بمروياته والتقيت به كثيرا وما زلنا على اتصال وكان والده رحمه الله من أصدقاء وأحباب السيد عبد الله الصديق الغماري.

حضرت شرح الآجرومية في علم النحو وكذلك ألفية ابن مالك وأجزاء من إعراب القرآن الكريم وعلم العروض على فضيلة الأستاذ محمد حسن عثمان أستاذ اللغويات بالأزهر الشريف.

والتقيت وسافرت مع فضيلة الشيخ الحبيب علي الجفري الحسيني وتبادلنا الإجازات والدعوات واستفدت كثيرا بصحبته ومازلنا على اتصال.

وحضرت دروس العقيدة مع فضيلة الأستاذ الدكتور محمد ربيع الجوهري أستاذ العقيدة بكلية أصول الدين بالقاهرة.

بالإضافة إلى مشايخنا وأساتذتنا بالأزهر الشريف أثناء فترة دراستي بكلية الشريعة وكثير من علماء اليمن وحضرموت والمدينة ومكة أجازوني وشرفت بمقابلتهم.
## النواحى العلمية والنشاط الدعوى:
شرحت كتب الحديث الستة بالأسانيد المتصلة فى مسجد الأشراف بالمقطم أسفل سكني و الذي أخطب فيه الجمعة
وشرحت أجزاء من صحيح البخارى بالأزهر الشريف ومنازل السائرين بمسجد سيدى أحمد الدرديرى ومازلنا نتكمل شرح صحيح البخارى بهذا المسجد المبارك .
وشرحت بالأزهر الشريف الرسالة القشيرية من عام ‎2007 إلى عام 2010‏ في أربع سنوات بإشارة من فضيلة الأستاذ الدكتور علي جمعة حفظه الله.
وشرحت الحكم العطائية والشفا بتعريف حقوق المصطفى للقاضي عياض وموطاً الإمام مالك ورياض الصالحين و التبيان في آداب حملة القرآن و الخريدة البهية في شرح أحكام الله العلية و المباحث الأصلية و الأذكار و حاشية الشيخ البيجورى والشمائل المحمدية وكتاب كفاية الأخيار في حل غاية الاختصار وكتاب بهجة النفوس وتحليها في معرفة ما للها وما عليها وكتاب فتح القريب المجيب ودلائل الخيرات و قصيدة بانت سعاد لكعب بن زهير و بردة المديح للإمام البصيرى والصلاة المشيشية والصلوات اليسرية على خير البرية ومنفرجة ابن النحوي وحزب البحر وحزب البر.

وقد طبعت كتاب أوراد الطريقة الصديقية الدرقاوية الشاذلية وكتاب الحضرة الصديقية والأسانيد الخاصة بهم وكتاب الصلوات اليسرية على خير البرية وجاري شرح كتاب منازل السائرين لطبعه ليعم النفع بإذن الله.

وبحث في الأوراق المالية وعلاقتها بالأجناس الربوية تحت إشراف الأستاذ الدكتور نصر فريد واصل مفتي الديار المصرية الأسبق.

وراجعت كتاب مناسك الحج والعمرة» وكتاب فقه العمرة لأبنائي في الطريق.

هذا بالاضافه إلي الدروس و الندوات لطلاب العلم بالقاهرة سواء للمصريين أو غيرهم مثل الأتراك والأندونيسيين و الماليزيين والوافدين بالأزهر الشريف?

وقد سجلت حلقات عديدة فى الفضائيات منها قناة الناس شرحت بها كتاب الشمائل المحمدية للإمام الترمذي كاملا في برنامج اعرف نبيك» و قناة اقرأ والإرث النبوى وغيرها من الدروس في الفضائيات وعلى يوتيوب.

وقد أكرمني الله وسافرت إلى القدس وصليت فيه في رمضان عام ‎2017‏ م 1436 ه وصليت فيه ليلة 27‏ رمضان و الجمعة و اعتكفت وختمت به القرآن فى ليلة 29 رمضان ومدحنا فيه النبي صل الله عليه وآله وسلم.

كما أكرمني الله بالحج والعمرة مرات عديدة منذ كنت طالبا بالكلية قبل التخرج وإلى الآن أسافر للعمرة سنوياً والحج

وسافرت إلى العراق عام ‎2001‏ قبل الغزو بدعوة من جمعية الجراحين العراقية وزرت أولياء بغداد و الإمام أبي حنيفة النعمان وضريح أمير المؤمنين علي بن أبي طالب عليه السلام بالنجف وضريح الإمام الحسين عليه السلام بكربلاء .

وسافرت إلى وهران بالجزائر وزرت بعض الأولياء مثل الإمام الغوث أبي مدين والتقيت بالسادة البلقايدية وتبادلنا الأسانيد وألقيت محاضرة عامة عن الإمام الشافعي بالزاوية في رمضان 1435 ه.‏

وسافرت إلى السودان وشرحت كتاب الشمائل المحمدية بمسجد سيدي علي الميرغني بأم درمان وتبادلنا الأسانيد والتقيت بالسادة الأشراف وذلك في نوفمبر ‎2011 م.

وسافرت إلى المغرب وزرت سيدى عبد السلام بن بشيش وأولياء المغرب فى فاس وطنجة ومراكش وزرت
الساحة الريسونية .

ولقد التقينا والحمد لله مع الكثير من الصالحين والأولياء والعلماء وطلاب العلم.

وشرحت كتاب بهجة النفوس بكوالالمبور بماليزيا بمسجد الشاكرين في ستة أيام في ديسمبر 2013 م.

وما زلت قائما على شرح كتب السنة بعد الفجر يوميا بمسجد الأشراف بالمقطم وكذا خطبة الجمعة اسبوعياً.

والحمد لله على نعمة الإسلام وكفى بها نعمة وصل الله على سيدنا محمد وعل آله وسلم.
  ''');

const abdallahGomariBio =
    Zikr(title: 'تعريف للسيد عبد الله بن الصديق الغماري', content: '''
قال الشيخ معرفا بنفسه في كتاب بدع التفاسير قائلا : نشأت في بيت العلم والصلاح والولاية؛ وبلبان الفضل غذيت حفظت القرآن بقراءة ورش وأتقنت رسمه؛ حتى كان يرجع إِليَّ فيه كبار القراء. ثم شرعت في حفظ بعض المتون كألفية ابن مالك في العربية» ومختصر خليل في الفقه» والأربعين النووية؛ وبلوغ المرام في الحديث.

ثم حضرت المقدمة الآجرومية بشرح الأزهري على ابن عمتنا الفقيه الأجل السيد محمد بن عبد الصمد، وعلى شقيقنا الحافظ أبي الفيض رحمه الله.

ثم رحلت إلى فاس لقراءة العلم بجامع القرويين أكبر جامع بالشمال الأفريقي وهو أكبر من الأزهر وأقدم وفيه تخرج علماء المغرب ودرّس فيه أبو بكر ابن العربي المعافري؛ ومحيي الدين ابن العربي الحاتمي وابن خلدون وأبو الحسن الشاذلي وابن غازي وزروق وغيرهم.

فحضرت الألفية بشرح المكودي على العلامة الحسيب النسيب السيد الحبيب المهاجي كما حضرت عليه في مختصر خليل بشرح الخرشي والسلم بشرح القويسني في المنطق.

وحضرت الألفية بشرح ابن عقيل على العلامة الشيخ محمد - بفتح الميم الأولى - ابن الحاج مع مراجعة حاشيتي السجاعي والخضري.

وحضرت الألفية أيضًا بشرح التوضيح لابن هشام مع مراجعة التصريح للأزهري وحاشية الطيب بن كيران على التوضيح أيضَاء وبشرح المكودي مع مراجعة حاشية ابن الحاج؛ على ابن المحشى للعلامة الشيخ محمد بن الحاج كما حضرت عليه في مختصر خليل بشرح الخرثي وحضرت عليه جملة كبيرة من صحيح البخاري بالجامع الإدريسي؛ وكان قوي الحافظة يبدي إعجابه بالحافظ ابن حجر» ويتورك على العيني في اعتراضاته عليه؛ ويقول عنه بعد حكاية اعتراضه: كأني به لم يفهم كلام الحافظ» ثم يجيب عنه.

ولما وصل في قراءة البخاري إلى كتاب الجهاد والمغازي بعث إليه حاكم فاس الفرنسي وطلب منه أن يتخطى هذا الباب إلى غيره ويقرأ ما بعده فامتنع عن الدرس أياماً وبعد مراجعة وكلام حصل الاتفاق على أن يقرأ كتاب الجهاد. على ألا يتوسع في الشرح وهذا نوع من الضغط الذي كان يمارسه الاستعمار
الفرنسي في المغرب.

وحضرت باب الجنايات والقصاص من مختصر خليل بشرح الخرشي على العلامة المحقق السيد أحمد القادري.

وحضرت في المختصر أيضًا على إمام جامع القرويين العلامة السيد إدريس المراكشي وكان على علمه وفضله فيه غفلة.

كما حضرت في المختصر أيضاً على العلامة الشيخ محمد الصنهاجي وحضرت من باب الإجارة إلى الآخر من شرح الدردير لخليل على العلامة الشيخ عبد الرحمن بن القرشي القاضي. وحضرت مواضع من مختصر خليل بشرح عبد الباقي الزرقاني على شيخ الجاعة العلامة السيد عبد الله الفضيلي. كما حضرت عليه رسالة الوضع وكان محققًا بارعًا.

وحضرت فرائض مختصر خليل بشرح (الخرشي) وحاشية شيخ الجماعة السيد أحمد بن الخياط على العلامة الشيخ أبي الشتا الصنهاجي وكان صالحاً خشن المعيشة والملبس وهو شقيق الشيخ محمد الصنهاجي السابق.

وحضرت المقدمة الآجرومية على شيخ الجماعة بفاس العلامة السيد أحمد بن الجيلاني الأمغاري وحضر عليه معظم العلماء تبركاً كما حضرت عليه مواضع من مختصر خليل بشرح الخرشي.

وحضرت على العلامة القاضي السيد الحسين العراقي جمع الجوامع بشرح المحلى وتفسير الجلالين بحاشية الصاوي.

وحضرت مبحث الأداء والقضاء من مقدمة جمع الجوامع على العلامة المحقق السيد الراضي الحنش وكان منقطع النظير في التحقيق.

وحضرت مقدمة جمع الجوامع بشرح المحلي على العلامة المحقق القاضي العباس بن أبي بكر البناني كما حضرت عليه قسم التوحيد من منظومة ابن عاشر وذكر مرة في درس الأصول حديثاً لم يعرف رتبته فبينتها له فسألني من أنت؟ فانتسبت له فقال: تبارك الله؛ الدر من معدنه لا يستغرب. وطلبت منه مرة فتوى فقهية في خصومة كانت بين بعض الإخوان. فسألني هل يطلع عليها والدك؟ قلت: نعم. قال: إذاً يجب التدقيق فيها لأن والدك في العلم مخيف.

وأخذت عنه أيضاً شرح البناني على السلم في المنطق. كما أخذت عنه المقولات. وأجاز لي اجازة عامة كتبها لي بخطه؛ كما أجازلي الشيخ محمد بن الحاج السابق والسيد المهدي العزوزي الذي روى عن السيد مرتضى الزبيدي شارح القاموس بواسطتين.

ثم رجع من الشام إلى فاس العلامة المحدث الولي الصالح السيد محمد بن جعفر الكتاني فلازمته واستفدت منه.

ثم رجعت إلى طنجة فدرست بالزاوية الصديقية لبعض نجباء الطلبة والإخوان المقدمة الآجرومية ورسالة ابن أبي زيد بشرح أي الحسن. وكتبت إذ ذاك شرحاً على الآجرومية يعتبر
أكبر شرح وأكثره فوائد بعد أن راجعت من شروحها وحواشيها ما ينيف على العشرين. منها شرح الراعي وهو مخطوط وشرح الشيخ أحمد بابا السوداني وهو مطبوع بفاس مع حاشية السيد المهدي الوزاني عليه وشرح الشيخ على بركة التطواني، وعليه ضريح يزار بمدينة تطوان وشرحه هذا مخطوط؛ وشرح سيدي
أحمد بن عجيبة؛ وحاشية الفيشي على الأزهري وهما مخطوطان أيضًَاء وعرضته على سيدنا الأستاذ الإمام الوالد رضي الله عنه فأصلح فيه مواضع بخطه وأقره وسماه شقيقنا الحافظ أبو الفيض رحمه الله تعالى «تشييد المباني لتوضيح ما حوته المقدمة الأجرومية من الحقائق والمعاني».

وكنت إلى جانب هذا أقوم باختصار كتاب «إرشاد الفحول إلى تحقيق الحق من علم الأصول» للشوكاني بأسلوب غير أسلوب «حصول الأمول» للقنَّوجي؛ مع حضوري على سيدنا الإمام الوالد رضي الله عنه في رسالة ابن أبي زيد بشرح أبي الحسن وفي شرح العارف أبي محمد ابن أبي جمرة لمختصره للبخاري قبل أن يطبع وكنت أرجع إليه في مواضع من كتاب «مغني اللبيب» كانت تشكل علىَّ فيش رحها لي. وقد قرأت هذا الكتاب مع مراجعة شرح الدماميني وحواشي الأمير والدسوقي وعبد الهادي نجا الإبياري وانتفعت به كثيرًا كما انتفعت بكتاب «الأشباه والنظائر النحوية» للسيوطي وكان من مراجعي في شرح الآجرومية.

وكتبت بحوثًا أخرى في مسائل نحوية عويصة؛ بإشارة سيدنا الإمام الوالد رضي الله عنه؛ الذي كان يشجعني على البحث والكتابة؛ ويدربني على معرفة المظان واتخذني كاتبه؛ أكتب له الفتاوى التي يجررها إلى الجهات المختلفة من أنحاء المغرب وتارة يأمرني فأمضيها باسمي وكان مع أصدقائه يثني على معرفتي وفهمي.

وجاء مرة الأستاذ الأديب الشيخ العياثي سكيرج - وهو من تلاميذه وله مؤلفات - برسالة شرح فيها أبيات ابن مالك التي مطلعها:
Fإني أقول لمن ترجى وقايته __ ق المستجير قياه قوه قي قيناX
وعرضها عليه لييدي رأيه فيهاء فقال له: اعرضها على فلان - يعنيني - فله بهذا العلم معرفة جيدة فجاءني بالرسالة؛ وقال لي: إن السيد أمرني بعرض الرسالة عليك وأثنى على علمك وفهمك, فقرأتها وأبديت له رأيي فيها وكان يتحدث إليَّ ساعات طويلة عن الكتب العلمية في مختلفة العلوم فيعطيني فكرة عن كل كتاب وما يمتاز به عن غيره؛ المطبوع منها والمخطوط وكانت حافظته قوية جداً إذا أفاض في موضوع أتى فيه بها يدهش السامع وكنت أتكلم معه مرة في مسائل نحوية وجاء ذكر لفظ (البتة) وهل هو بهمزة وصل؟ أو قطع؟ فقال لي: تكلم عليه الحافظ ابن حجر في الفتح وحكى فيه الوجهين واختار الوصل.

كما حكاهما الأزهري في التصريح واختار القطع وعين لي الموضع في الكتابين» فوجدتهما كما قال وقال لي مرة في بعض خطاباته إلي: أنت فقيه محدث صوفي وتلقنت منه طريق الشاذلية؛ كما تلقنه من شيخه القطب الكبير سيدي محمد بن إبراهيم عن شيخه العارف المحب الرباني سيدي عبد الواحد بناني عن شيخه العارف المحبوب سيدي محمد أيوب عن جدنا القطب الغوث الجامع سيدي الحاج أحمد بن عبد المؤمن الغماري عن قطب الواصلين مولاي العربي الدرقاوي وبقية السلسلة مذكورة في أول «إيقاظ الهمم بشرح الحكم» لجدنا سيدي أحمد ابن عجيبة.

ثم أذن مؤذن الرحيل إلى مصر فركبنا باخرة يابانية من جبل طارق أنا وشقيقي الأكبر الحافظ أبو الفيض رحمه الله وشقيقي الأصغر مني العلامة السيد محمد الزمزمي ومعنا أحد الإخوان الصديقيين اسمه أحمد عبد السلام الشرقي وشهرته الحاج شكاره رحمه الله.

وقفت الباخرة بنا في مالطة فنزلنا إليها وشهدنا شوارعها ومعالمها ولغة أهلها ثلثها عربي وثلثاها إنجليزي لأنهم كانوا مسلمين يتكلمون العربية لغة القرآن لكن الاستعمار الإنجليزي تمكن منهم؛ فسلبهم دينهم ولغتهم وهكذا فعل الاستعيار الإسباني في الأندلس والاستعبار الإيطالي في صقلية؛ وهكذا حاول أن يفعل الاستعمار الفرنسي في البربر بالمغرب وهذه هي خطة الاستعمار في كل مكان وزمان.

ثم واصلت الباخرة سيرها فوصلت إلى الإسكندرية أواخر شعبان سنة 1349 هجرية؛ نزلنا فيها عند قريب لنا اسمه الحاج محمد أجزنَّاى وفي الأسبوع الأول من رمضان وصلنا إلى القاهرة المعزّية؛ واستأجرنا بيتاً في شارع الكحكيين بجوار الشيخ الدردير وبعد انتهاء رمضان وإجازة العيد التحقت بالأزهر.

فحضرت بالقسم العالي منهاج البيضاوي بشرح الأسنوى في الأصول على الشيخ حامد جاد.
وحضرت جمع الجوامع بشرح المحلي من كتاب القياس إلى الآخر على العلامة المحقق الشيخ محمد حسانين مخلوف العدوي كما حضرت عليه رسالة آداب البحث والمناظرة واستجزته فوجدته لا يعرف معنى الإجازة.

وحضرت السلم بشرح الملوي وحاشية الصبان على الشيخ عبد القادر الزنتاني برواق المغاربة.

وحضرت التهذيب بشرح الخبيصي في المنطق على العلامة المحقق البارع الشيخ محمود الإمام عبد الرحمن المنصوري، أعجبت بشدة تحقيقه، وسعة إطلاعه في علوم المعقول والفقه الحنفي فتعرفت به وزرته في بيته بشبرا وأطلعني على مكتبته القيمة.

ولما علم أن عندنا تخريج أحاديث الكشاف للزيلعي طلب مني إعارته إياه لينسخه كما طلب مني أن أبحث له عن حاشية ابن سعيد التونسي على الأشموني ولو باستحضارها من تونس لأنه كان معجباً بها غاية الإعجاب، سمعت منه حديث الرحمة المسلسل بالأولية، كما سمعه من الشيخ أحمد الحلواني، وكتب لي
سنده فيه بخطه؛ ولم تكن عنده إجازة رحمه الله وأكرم مثواه.

وحضرت الربع الأول من شرح الدردير لمختصر الخليل على شيخ اسمه الشيخ عمران وكان سيدنا الأستاذ الإمام الوالد رضي الله عنه قد أوصاني بقراءة فقه الإمام الشافعي رضي الله عنه؛ فقرات شرح الخطيب لتن أبي شجاع؛ على الشيخ عبد المجيد الشرقاوي. وكان يتقن فقه الشافعية إتقانًا ما عليه مزيد وهو من ذريه الشيخ عبد الله الشرقاوي شارح مختصر الزبيدي.

وقرأت الربع الأول من المنهج بشرح زكريا الأنصاري وحاشية البجيرمي؛ على الشيخ محمد عزت؛ وهو متين في الفقه الشافعي جدا.

وحضرت دروسًا في جمع الجوامع؛ على الشيخ دسوقي العربي المالكي وكان يعنى بمناقشة عبارات الشارح، وما كتب عليه الناصر اللقاني، وما أجاب به ابن قاسم العبادي. الخ

وحضرت دروساً من شرح الهداية في الفقه الحنفي؛ على مفتي الديار المصرية وشيخ علمائها الشيخ محمد بخيت المطيعي الحنفي كما حضرت عليه دروساً في التفسير وزرته ببيته في الزيتون غير مرة، واستجزته فأجاز لي إجازة عامة وكان يزورنا بالبيت ويسأل شقيقنا الحافظ أبا الفيض عن أحاديث تعرض له
وكان واسع العلم غزير الإطلاع حاضر البديهة سريع النكتة كريم الخلق سخي اليد رحمه الله وأثابه رضاه.

وسمعت حديث الأولية من مسند الديار المصرية السيد أحمد رافع الطهطاوي. وأجاز لي بما حواه ثبته «المسعى الحميد إلى بيان وتحرير الأسانيد» وأجاز لي الشيخ محمد إمام السقا خطيب الجامع الأزهر السمالوطي؛ بعد أن حضرت عليه دروساً في سنن الترمذي.

وأجازلي الشيخ عويد نصر الخزاعي المكي عن الشيخ عبد اهادي نجا الأبياري بمؤلفاته ومروياته؛ والشيخ طه الشعبيني شيخ الطريقة الشاذلية وكان عالماً صالحا فاضلاً ومن شيوخه الشيخ أحمد الرفاعي شيخ المالكية والشيخ عبد القادر الشفشاوني صاحب كتاب «سعد الشموس والأقمار».

وممن أجاز لي من شيوخ مصر: الشيخ عبد الغني طموم إمام المسجد الحسيني؛ والسيد محمد الببلاوي خطيب المسجد الحسيني ونقيب الأشراف.

والشيخ عبد المجيد اللبان زرته بمعهد الإسكندرية وكان شيخاً له؛ وذلك بعد ما نزلنا من الباخرة بيومين فهو أول شيخ بمصر أجاز لي ثم لما عين عميداً لكلية أصول الدين حصل حادث علمي خدمته فيه خدمة قيمة فقتوطدت أواصر المودة بينناء وجهد أن يعينني مدرساً للحديث عنده في الكلية؛ فلم يستطع لشدة معارضة الشيخ المراغي شيخ الأزهر إذ ذاك.

والشيخ محمد الخضر حسين» شيخ الجامع الأزهر ورئيس جعية الهداية الإسلامية؛ وكان يزورني بالبيت ويسألني عن أحاديث يحتاج إليها في مواضيع يكتب فيها.

والشيخ محمد دويدار الكفراوي» زرته ببيته في تلا وكان قد جاوز المائة بسنتين، فناولني ثبت الشبراوي، وأجاز لي بما فيه وكتب الإجازة بخطه؛ وهو يروي عن الشيخ إسماعيل الحامدي محشي الكفراوي وصاحب الرسالة في الحالة؛ والشيخ عيسى القلماوي والشيخ الإنبابي» والشيخ الشربيني وغيرهم ويروى بالعامة عن الشيخ إبراهيم الباجوري وأجازلي الشيخ أبو النصر القاوقجي عن والده أبي المحاسن وغيره؛ وأخوه كمال الدين باستدعاء شقيقي الحافظ أبي الفيض لأنه توفي قبل حضوري إلى مصر.

وفي سنة 1350 تقدمت لامتحان شهادة العالمية الخاصة بالغرباء، والامتحان فيها يكون في اثنى عشر عليًا هي: النحو والصرف والمعاني والبيان والبديع والأصول والمنطق والتوحيد والفقه والتفسير والحديث ومصطلح الحديث؛ فنجحت في الامتحان وحصلت عل الشهادة ممضاة باسم شيخ الأزهر وهو الشيخ محمد الأحمدي الظواهري في ذلك الوقت وكان عالماً ذكياً صوفياً إلا أنه ضعيف.

وفي هذه السنة طلب مني كثير من الطلبة أن أدرس لهم بعض العلوم فشرعت في تدريس المكودي على الألفية؛ وأنا أول من درسه بالأزهر ودرست لهم الجوهر المكنون في البلاغة والسلم في المنطق بشرح البناني وسلم الوصول إلى علم الأصول لابن أبي حجاب ثم درست جمع الجوامع بالرواق العباسي بين العشائين فختمته في أربع سنوات.

وحضر علي الطلبة من أندونيسيا والهند وتركيا ويوغوسلافيا ورومانيا وألبانيا والشام والحجاز واليمن والحبشة والصومال والسودان وشمال إفريقيا وغيرها وكان الطالب من أندونيسيا والحبشة والصومال إذا تخرج وسافر إلى بلده يوصي إخوانه القادمين إلى مصر بالحضور علي وكنت أذاكر دروس امتحان العالمية لطلبة القسم العالي المصريين وجميع من ذاكرت لهم نجحوا وهم يتولون الآن وظائف في الأزهر وغيره؛ بل الطلبة الغرباء الذين حضروا علي أو ذاكرت لهم نجحوا وهم يتولون في بلادهم وظائف كبيرة.

وفي سنة ‎1351‏ زارنا بالبيت الأستاذ حسن قاسم - من ذرية الشيخ عبد القادر الكوهن - وطلب مني أن أكتب مقالات لمجلة الإسلام التي كان محرراً فيها - وهي أكبر المجلات الإسلامية إذ ذاك - فكتبت فيها بحوثاً حديثية؛ أعجب بها القراء أيما إعجاب وانهالت على إدارة المجلة خطابات الاستحسان والاستزادة من الشام والسودان والمغرب والجزائر والبحرين وغيرها وكتب إِليَّ الشيخ محمود شويل إمام المسجد النبوي بالمدينة المنورة كتابًا مطولًا يثني فيه على علمي وإطلاعي ويقول: كنا نعد علم الحديث؛ ينتهي في مصر بعد الشيخ رشيد رضا والشيخ أحمد شاكر لكن حين قرأنا بحوثك ضممناك إليهما فأنت عندنا في الرتبة بعد الشيخ شاكر.

وقابلت مرة طالباً سودانياً عند أحد الكتبية بالأزهر فلما عرفني أبدى إعجابه بما قرأ لي وقال: عندنا في السودان إذا جاء مقال أو إفتاء من مصر باسم أحد شيوخ ثلاثة؛ سلموه بدون مناقشة. قلت: من هم؟ قال: الشيخ بخيت والدجوي والغماري ومما مر بمصر في طريقه إلى الحجاز العلامة المحدث السيد عبد الحي الكتاني وذهبت لزيارته؛ هنأني بالحصول على شهادة العالمية؛ وأبدى إعجابه ببحوثي وقال: نحن نفخر با تكتبه وكنت قبل ذلك سمعت منه حديث الأولية. وحضرت عليه دروساً في حاشية الشنواني على مختصر ابن أبي جرة؛ بجامع القرويين وأجاز لي إجازة عامة.

واستمرت كتابتي بمجلة الإسلام عشر سنوات حصلت فيها مناقشات بيني وبين بعض العلماء في مسائل متعددة وكتبت أيضاً في مجلة نشر الفضائل والآداب الإسلامية؛ ومجلة هدى الإسلام ومجلة الرابطة الإسلامية؛ ومجلة الشرق العربي ومجلة الإرشاد التي يصدرها خطباء وأئمة المساجد بمصر ومجلة المسلم التي تصدرها العشيرة المحمدية؛ وهي جمعية صوفية فاضلة مباركة؛ ونشرت مجلة التمدن الإسلامي التي تصدر في دمشق مقالاً لي في شرح حديث. نقلًا عن مجلة الشرق العربي.

وتعرفت بالأستاذ العلامة المطلع البارع الشيخ محمد زاهد الكوثري رحمه الله فتوطدت بيننا أواصر المودة والصداقة وكان يسألني عن بعض الأحاديث التي يُسْأل عنها وكنا مرة عند فضيلة المرحوم الشيخ يوسف الدجوي بعزبة النخل وكان المجلس غاصاً بالعلماء وغيرهم وهو يتكلم في مسائل علمية متنوعة؛ فوجه إليه أحد الحاضرين سؤالًا عن حديث؛ فوجه السؤال إلي وقال: لا يفتى ومالك في المدينة؛ ولما استجزته ببيته بالعباسية أجاز لي واستجازني وألح علي أن أجيز له بل بلغ من وثوقه بعلمي أنه نشر مقالاً بمجلة الإسلام يقرظ فيه كتابي «إقامة البرهان على نزول عيسى في آخر الزمان» الذي رددت به على الشيخ محمود شلتوت قبل أن يراه؛ مع أنه كان ضنيناً جداً بالتقريظ.

ثم تقدمت لامتحان شهادة العالمية الأزهرية؛ ويكون الامتحان فيها في العلوم السابقة مضافاً إليها علم الوضع؛ وعلم العروض والقوافي. وعلم الأخلاق فنجحت وكنت الثالث من ستة نجحوا وكان المتقدمون للامتحان ستة وثمانين ومائتين وحصلت على الشهادة وهي ممضاه باسم الملك فاروق ورأى المرحوم الكوثري اسمي في جريدة الأهرام فأسرع إلى بيتي بسوق السلاح وكان أول من هنأني بالنجاح وبعد هذا بأيام زرت الشيخ محمود شلتوت في بيته بدعوة منه - وكان إذ ذاك وكيلاً لكلية الشريعة - فهنأني بعض الأصدقاء عنده، فقال له الشيخ شلتوت: نحن نهني الأزهر والشهادة الأزهرية بحصول الشيخ عبد الله عليها وكنت قبل ذلك زرته في كلية الشريعة باستدعائه أيضاً ليتعرف بي بعد أن قرأ ردودي عليه بمجلة الإسلام في نزول عيسى عليه السلام وأحدثت دوياً كبيراً في الأوساط العلمية وقال لي حين رآني: كنت أظنك شيخاً كبيراً لكنك شاب، قلت: أنا كما يقول المثل العربي: تسمع بالمعيدي خير من أن تراه. قال لا أقصد هذا وإنا أقصد أن سنك دون مقالاتك التي تدل على علم كبير واطلاع واسع لا يتأتيان إلا من رجل تقدمت به السن مع طول الدراسة؛ قلت: هذا من فضل الله علي وكان سني حينئذ 33 سنة ثم نادى على الشيخ محمد المدني وَعرَّفهُ بي، وحصلت بيننا مناقشة في مسائل علمية متعددة؛ وصارت بعدها معرفة؛ على خلاف في الرأي بيننا ولما تم طبع «إقامة البرهان» قدمت له نسخة في بيته؛ فكتب رداً عليه بضع مقالات في مجلة الرسالة فكتبت كتاباً آخر سميته «عقيدة أهل الإسلام في نزول عيسى عليه السلام» وطبع وقدمته إليه أيضًا في بيته؛ فلم يكتب شيئًا بعده.

وقد وفقني الله إلى كتابة عدة مؤلفات وهي:
• اتحاف الأذكياء بجواز التوسل بسيد الأنبياء (طبع ونفد)
• الأربعون حديثًا الغمارية في شكر النعم (طبع ونفد)
• الأحاديث المنتقاه في فضائل سيدنا رسول الله [[(طبع]] ونفد)
• الأربعون حديثًا الصديقية في مسائل اجتماعية (طبع مرتين)
• الاستقصاء لأدلة تحريم الاستمناء (طبع ونفد)
• إقامة البرهان على نزول عيسى في آخر الزمان (طبع مرتين) وترجم إلى اللغة الأردية
• الرد المحكم المتين على كتاب القول المبين (طبع ثلاث مرات)
• عقيدة أهل الإسلام في نزول عيسى عليه السلام (طبع)
• سمير الصالحين ج1‏ (طبع مرتين) سمير الصالحين ج2 (طبع)
• حسن البيان في ليلة النصف من شعبان (طبع مرات)
• فضائل القرآن (طبع)
• شرح الآجرومية (مخطوط)
• فضائل رمضان (طبع)
• تخريج أحاديث منهاج البيضاوي في الأصول (مخطوط)
• مصباح الزجاجة في صلاة الحاجة (طبع)
• تخريج أحاديث اللمع (مخطوط)
• قصة آدم عليه السلام (طبع)
• قرة العين بأدلة إرسال النبي إلى الثقلين (خطوط)
• قصة إدريس وهاروت وماروت عليهم السلام (طبع)
• خواطر دينية (مخطوط)
• جواهر البيان في تناسب سور القرآن (مخطوط)
• نهاية الآمال في صحة حديث عرض الأعمال (طبع)
• بدع التفاسير (طبع)
• الحجج البينات في إثبات الكرامات (طبع)
• واضح البرهان على تحريم الخمر في القرآن (طبع)
• النفحة الإلهية في الصلاة على خير البرية (طبع)
• شرح وجيز عل الإرشاد في فقه المالكية (طبع مرات)
• إعلام النبيل بجواز التقبيل (طبع مرتين)
• لكنز الثمين في حديث النبي الأمين (مخطوط)

هذا سوى ما كتبته من مقالات إذا جمعت جاءت في مجلد.

ومن تعليقات على كتاب «أخلاق النبي ﷺ» لأبي الشيخ ابن حيان وكتاب «إعجاز القرآن» للخطابي؛ والمقاصد الحسنة للسخاوي وكتاب «تنزيه الشريعة المرفوعة» لابن عراق وتأييد الحقيقة العلية للسيوطي ورسائل أخرى له أيضاً وشرح الأمير على مختصر خليل في فقه المالكية؛ وغير ذلك» ونسأل الله المزيد

ولما ذهبت إلى فاس أول مرة؛ صعب علي العلم واستغلقت أبوابه فكتبت إلى مولانا الأستاذ الإمام الوالد رضي الله عنه أشكو إليه حالتي وأستشيره في اتخاذ مدرس خاص يفهمني الدروس, فأجابني بألا أستعين بمدرس إطلاقاً وأمرني باستذكار الدروس والحضور على المشايخ سواء أفهمت أم لم أفهم؟ وقال لي: العلم لنا مضمون وعما قريب يفتح الله عليك وكذلك كان فلم تمر سنة حتى فتح الله علي وله الحمد. 

ثم تاقت نفسي للسفر إلى مصر وطلبت منه ذلك. قال لي: ستذهب إليها إن شاء الله ولكن أحب أن تذهب إليها عالماً يحتاج إليك علماء مصر.

وقد حقق الله كلامه فاحتاج إلي منهم كثيرون في مقدمتهم المرحومون المشايخ بخيت والدجوي واللبان والخضر حسين.

وكذلك حقق الله بشارته لي في كتاب بعث به إلي وأنا بمصر قال فيه: ولابد أن تكون عالماً كبيراً ومحققاً شهيراً وقد رزقني الله والمنة له التحقيق في علوم النحو والأصول والمنطق والحديث بفنونه الثلاثة؛ مع المشاركة التامة في علوم الفقه والبلاغة وغيرها. وحافظتي قوية والحمد لله؛ واطلاعي كبير
بفضل الله ولهذا أعجبت بالمرحوم الكوثري الذي كان يرضيني اطلاعه الواسع وخبرته التامة بالرجال ويمكن أن أقول - تقريرًا للواقع: بعد وفاة سيدنا الأستاذ الإمام الوالد رضي الله عنه وشقيقنا الحافظ أي الفيض والشيخ بخيت والشيخ الكوثري والشيخ محمد الخضر حسين لا يوجد عالم يجوز تقديري ويرضي معرفتي واطلاعي؛ وكنت أعد نفسي ثالنًا للكوثري والخضر حسين لا أقول هذا فخراً وأى فخر لمن ينتظر الموت بين لحظة وأخرى؟ وإنما أقوله تعريفاً بنفسي وامتثالًا لقوله تعالي: ﴿وَأَمَّا بِنِعۡمَةِ رَبِّكَ فَحَدِّثۡ۝١١﴾[الضحى:11]، واقتداء بيوسف الصديق الذي قال لملك مصر: ﴿قَالَ ٱجۡعَلۡنِي عَلَىٰ خَزَآئِنِ ٱلۡأَرۡضِۖ إِنِّي حَفِيظٌ عَلِيمٌ۝٥٥﴾ [يوسف:55]، وتأسياً بعلماء هذه الأمة وصلحائها

ولا يفوتني أن أذكر حصولي على إجازات من علماء الحجاز واليمن وتونس وغيرها وحُج بي وأنا صغير حين حجت العائلة؛ ثم أديت فريضة الحج سنة 1378 وكنت مالكياً ثم صرت شافعياً ثم تركت التقليد، لا إزراء على الأئمة رضي الله عنهم ولكن لأن التقليد إنما هو للعوام الذين لا يعرفون قواعد الاستنباط والاستدلال ومن عرفها وتمكن في معرفتها لا حاجة به إلى التقليد على أني لا أفتي إلا على مذهب مالك أو الشافعي. لأني لا أحب أن أحمل أحداً على اجتهادي ورأيي إلا في مسألة وضح دليلها وعرف طريقها.

ورأيت مبشرات متعددة فرأيت النبي ﷺ ومعه الشيخان وغيرهما ورأيت جبريل عليه السلام وأخبرني أنه جاء من الأبواء.
ورأيت علياً عليه السلام ورأيت الحافظ ابن حزم مرات وابن عربي المعافري وعز الدين بن عبد السلام وحصلت بيننا مذاكرة في قاعدة علمية والسيد أحمد البدوي رأيته مرتين ورأيت أبا الحسن الشاذلي شارح الرسالة؛ والجمل محشى الجلالين وجدّنا أبا العباس ابن عجيبة؛ ورؤيت لي مبشرات كثيرة منها: إني زرت مرة قرية أويش الحجر من جملة زياراتي لها وألقيت درساً حديثيا كعادتي مع أهل البلدة وانجر الكلام إلى موضوعات متنوعة حتى انتهى إلى أشراف المغاربة وهل هم ينتمون إلى الحسنين؟ فأخبرتهم أن معظم الأشراف عندنا ينتمون إلى الحسن بن علي عليها السلام وقليل منهم ينتمي إلى أخيه الحسين عليه السلام وسألوني أن أملي عليهم نسبي فأمليته عليهم لأني حفظته وأنا في الكتَّاب. فقال لي الشيخ الحسيني - وكان إمام مسجد وسط البلد ومعلم القرآن يتبرك به أهل البلد لصلاحه وعزوفه عن الدنيا رحمه الله: أشهد أنك شريف منسب حقاً قلت: وما ذاك؟ قال: رأيت الليلة الماضية النبي ﷺ وقبلت يده ووجدت شخصاً يقعد بجانبه فسألت عنه فقال: هذا ولدي وسيتلو عليك نسبه فأصبحت بيننا على غير ميعاد وتلوت علينا نسبك.

''');
